[
  {
    "commentText": "Why are we saying Alleged when last week it was a fact if you told it!",
    "likes": 0
  },
  {
    "commentText": "\"some liberal students on campus\"... hahah it's Stanford... 99% of them are going to support democratic initiatives.",
    "likes": 0
  },
  {
    "commentText": "Is Ingraham a dude. That's quite the Adams Apple.",
    "likes": 0
  },
  {
    "commentText": "Those are the real fighters, the minorities fighting the embedded majority, unlike the Antifa punks who are always on the other side of the American flag.",
    "likes": 0
  },
  {
    "commentText": "Susan Rice’s son is a plant. I don’t trust him.",
    "likes": 0
  },
  {
    "commentText": "It was a video that caused the attack. Ask Obozo.",
    "likes": 0
  },
  {
    "commentText": "The voice of the general public is golden.\n\nWhat can you do about world events?\n\n1. Make an appointment to meet with your local congressman to personally discus your concerns.\n\n2. Exercise your right to meet with an FBI agent personally if you encounter any suspicious activity.\n\n3. Educate yourself. Request information from the Freedom of Information Act.",
    "likes": 0
  },
  {
    "commentText": "Bullshit",
    "likes": 0
  },
  {
    "commentText": "I'll feel sympathy for him when his mother goes to prison.",
    "likes": 0
  },
  {
    "commentText": "Individual Liberty... Yea... That warms my heart.. You go son... Proud to have you on my side...\nTRUMP 2020!!!..\nSpread the Love....",
    "likes": 0
  },
  {
    "commentText": "Boof off.",
    "likes": 0
  },
  {
    "commentText": "Looks like a smoke screen.....",
    "likes": 0
  },
  {
    "commentText": "1776\nLIBTURDS LOOSE !!!!",
    "likes": 0
  },
  {
    "commentText": "these people want war",
    "likes": 0
  },
  {
    "commentText": "THEY GET ANGRY WITH THE PROTEST SIGNS OR FLYERS AND TEAR THEM UP SPARKING A CONFRONTATION                  OBVIOUSLY THE LIBERAL GIRL NUT JOB IS VERY MISGUIDED AND NEEDS EDUCATED OR WOKE UP",
    "likes": 0
  },
  {
    "commentText": "So when a woman falsely accuses a nominee for the Supreme Court of sexual abuse, \"she needs to be believed\"(Senator Mazie Hirono). But when a man gets assaulted like this, that's OK? The hypocrisy of The Left is astounding!",
    "likes": 0
  },
  {
    "commentText": "Susan Rice is Trash !! Lets hope she goes to jail the traitor ! Not only is she a race traitor but a traitor to America !!",
    "likes": 0
  },
  {
    "commentText": "I am so proud that students are not backing up. Good job.",
    "likes": 0
  },
  {
    "commentText": "The young man must see som sing smelly from his Mom’s party and became conservative. Isn’t Juan William’s sons, too?",
    "likes": 0
  },
  {
    "commentText": "Press charges please.",
    "likes": 0
  },
  {
    "commentText": "She is a democrat Mrs.Rice. I hope she sees what they do. Her people.",
    "likes": 0
  },
  {
    "commentText": "So funny that the liberal crybabies only seem to do the feet stamping hysterics when they are on camera. They’re just in it for the selfies.",
    "likes": 0
  },
  {
    "commentText": "Forcefully pushed?????",
    "likes": 0
  },
  {
    "commentText": "At 00:30 that Esposito guy has an awesome natural \"you messin' with me?\" look wothout even realizing it.",
    "likes": 0
  },
  {
    "commentText": "Good you are pressing charges. Time to put these maniacs in check.",
    "likes": 0
  },
  {
    "commentText": "Remember when we used to get punched in the face and either got up and fought back or went home and brushed it off? When did we become such pansies that every time we get beat up or someone hits us, we make such a big deal about it. A man fights back.. and if he loses.. he doesn't whine, he doesn't complain, he doesn't seek counseling or need a psychiatrist..   he takes it on the chin.. and makes his enemy pay 10 fold.",
    "likes": 0
  },
  {
    "commentText": "I told you mom,  these people are crazy violent.",
    "likes": 0
  },
  {
    "commentText": "All liberals are wrecthed liars and thugs",
    "likes": 0
  },
  {
    "commentText": "Bullshit",
    "likes": 0
  },
  {
    "commentText": "His mom is to evil to give a care of what happens to her son",
    "likes": 0
  },
  {
    "commentText": "Thats funny considering they are mostly women showing their support for Kavanaugh! I doubt it happened.",
    "likes": 0
  },
  {
    "commentText": "Laura could not stop smiling and looking so happy  that the Rice kid was assaulted . . Normally she looks like Ms Grumpy. . Relax Laura anybody getting assaulted like this is not a good thing.",
    "likes": 0
  },
  {
    "commentText": "Neuter the lad before he breeds!",
    "likes": 0
  },
  {
    "commentText": "New thought. The leftists are basically Sheep. The Taliban & ISIS love sheep, really love on some sheep right!  We can send leftists and antifa sheep down range and everybody wins.   I love it when a plan comes together.",
    "likes": 0
  },
  {
    "commentText": "Well maybe your moma's demarats  friends should keep there dogs on there chains!!!",
    "likes": 0
  },
  {
    "commentText": "sniffle sniffle whine whine...",
    "likes": 0
  },
  {
    "commentText": "I'm a proud Republican.  Republican or democrat I am proud to see you young adults standing up the right way for what you believe.  The Change my mind events would be a great idea full of thoughtful conversation where people could see how much they actually have in common. But the left can't stand the fact that there are differences in opinion. I think what you guys do is a very open and productive way to share thoughts. The problem is both saides have to be mature and empathetic.  Two virtues the left has thrown away.",
    "likes": 0
  },
  {
    "commentText": "Its ALLEGED dont turn into the democrats guys!! INNOCENT UNTIL PROVEN GUILTY",
    "likes": 0
  },
  {
    "commentText": "KARMA for the Dems...",
    "likes": 0
  },
  {
    "commentText": "Keep up the movement to vote for truth justice and the American dream. I'm glad for her son being a conservative but he may be the next victim of suicide with ties to the Democratic party. It isn't easy being a conservative on campus. It surely can't be easy to be a conservative who is Susan Rices son.We need to Pray for him.",
    "likes": 0
  },
  {
    "commentText": "was he the one lefty that hit the 71 year old man holding a sign supporting Kavanaugh He must have hurt his little hand when he hit the poor old man.",
    "likes": 0
  },
  {
    "commentText": "My family is mostly conservative. My family has served in all major wars. My family is diverse. My friends are diverse. Our politics are also diverse. But, do we act like the animals we see on the coasts and campuses today? NO.",
    "likes": 0
  },
  {
    "commentText": "Susan Rice had her own son beat up.",
    "likes": 0
  },
  {
    "commentText": "The lunacy is strong in the leftists.",
    "likes": 0
  },
  {
    "commentText": "Rice you were treasonous against our great nation..",
    "likes": 0
  },
  {
    "commentText": "MAGA ON NOV.  6TH.",
    "likes": 0
  },
  {
    "commentText": "Action needs to be Taken against The crazy Left, and soon.",
    "likes": 0
  },
  {
    "commentText": "The spoiled brat kids at home always get what they want.  They are the Democrat Liberals forcing their views on the rest of the US.",
    "likes": 0
  },
  {
    "commentText": "This young man makes great points.",
    "likes": 0
  },
  {
    "commentText": "***  BEN.....   We have a tie and collar watch.......    I've never seen that before.....    I don't know if it work's or not......    34",
    "likes": 0
  },
  {
    "commentText": "Is it my imagination, or are most of these \nout-of-control leftist whackos female?",
    "likes": 0
  },
  {
    "commentText": "Really!!! Guess what nobody cares..",
    "likes": 0
  },
  {
    "commentText": "lie down with dogs...",
    "likes": 0
  },
  {
    "commentText": "The Left Wing Dingalings have NO MORAL'S At All !!  And Never Heard of what it means !!",
    "likes": 0
  },
  {
    "commentText": "The son of an Obama official?  Anybody ee what's wrong with this picture?",
    "likes": 2
  },
  {
    "commentText": "Press charges, let her face JUSTICE",
    "likes": 0
  },
  {
    "commentText": "Portland doesn't have a police force? WTF?",
    "likes": 2
  },
  {
    "commentText": "That a BT 1000 yo your lucky your still alive.",
    "likes": 0
  },
  {
    "commentText": "I guess her son figured it out!!! His mom is a criminal!!!",
    "likes": 0
  },
  {
    "commentText": "Hmmm he doesn't want his mama\"s evil ways",
    "likes": 1
  },
  {
    "commentText": "Susan Rice has a son?? She's such a baklava. Too bad for the alleged assault and her son I hope she wasn't with them for she provoked the assault",
    "likes": 0
  },
  {
    "commentText": "This has to stop before there is no return.",
    "likes": 0
  },
  {
    "commentText": "We need to build more looney bin institutions in this nations. And fix all the roads with potholes. Just the sight of that woman would scare me off. And probably smell too.",
    "likes": 0
  },
  {
    "commentText": "Oh my God, did some jerk try to Kavanaugh her son-- women and sons can get Kavanaugh-ed these days.",
    "likes": 0
  },
  {
    "commentText": "Susan rice is a liar the world has seen that. Remember Bengazi .",
    "likes": 4
  },
  {
    "commentText": "Oh Susan Rice, lock her up !",
    "likes": 0
  },
  {
    "commentText": "SUSAN RICE  another example that CRIME DOES PAY!",
    "likes": 1
  },
  {
    "commentText": "Heather Heyer was murdered at a Pro-Trump rally in Charlottesville on August 12, 2017. There were also incidents of Trump supporters rioting and beating up others at their peaceful rally that they brought weapons to.",
    "likes": 0
  },
  {
    "commentText": "We were not born yesterday.  This as fake as she is on her son. Fake news. More Selinsky playbooks.",
    "likes": 0
  },
  {
    "commentText": "Yeah right! Like anyone can believe this.",
    "likes": 0
  },
  {
    "commentText": "The only way to STOP this kind d of behavior is to hold people accountable for their actions.",
    "likes": 0
  },
  {
    "commentText": "These women  who have had abortions  are the ones who are upset.  They don't  like  To being told that  they are wrong. They want For validation for their abortions.  when you don't give it to him they get violent. Been happening for years. It makes them mentally unstable. I feel bad for them they have been lied to. It's not just cells.",
    "likes": 0
  },
  {
    "commentText": "Rice needs to go to jail.",
    "likes": 1
  },
  {
    "commentText": "Women need to stop their violence towards men. When will we feel safe again there should be laws for this. ALL men should be believed. This violence and hate culture towards men Must stop. We are tired of being the Victims of this bullying hate mongering gender! :)",
    "likes": 0
  },
  {
    "commentText": "How's that unfair 💩 feel Susan rice, welcome to real America, reap what u sow. Every democrat has attacked Trumps family and republicans, time to change this crap around, fight 🔥 with 🔥.",
    "likes": 0
  },
  {
    "commentText": "Yes. Press charges against the violent LEFTISTS.",
    "likes": 3
  },
  {
    "commentText": "\"Right Will Always Be Right & Left Will Never Be Right.\"\n-Shlomo HaTalmid",
    "likes": 1
  },
  {
    "commentText": "Alleged means take it how ever you like. \nMama rice should be in hail. \nShe's a crazy socialist..",
    "likes": 0
  },
  {
    "commentText": "The word \"liberal\" as used by democrat's and others who have adopted the democrat definition need to correct their word usage and change liberal to leftist. It is an insult to Liberal's when they are lumped together with leftist whacko's.",
    "likes": 1
  },
  {
    "commentText": "Instead of being taught how to think for themselves, evaluate evidence, and determine the truth and falsehood of an assertion, students are being taught that adherence to the Leftist ideology and all that matters, and those who dare to dissent can justifiably be physically assaulted as well as libeled.",
    "likes": 0
  },
  {
    "commentText": "I am open minded and look for good that will make America a better place for all, the left has NOTHING to make us a better Republic!\nIt makes is easy for me to go Republican as they have our country at heart!    Vote Republican! 🇺🇸",
    "likes": 0
  },
  {
    "commentText": "Leftists are so thoroughly indoctrinated that they think that if a victim of a crime is an ideological enemy, and the perpetrator a comrade, then the true victim must be the perpetrator, and the true evildoer the one who suffered the injury.",
    "likes": 0
  },
  {
    "commentText": "THIS IS FAKE NEWS",
    "likes": 0
  },
  {
    "commentText": "Sounds like she's a leftist to me.  Millenials are such pussies.",
    "likes": 2
  },
  {
    "commentText": "Your parents maybe rich ,but they sent you to get a poor education why kids are being taught junk while their parents just sit their never asking questions the bigger question why does session just sit their going what !?",
    "likes": 0
  },
  {
    "commentText": "Well, she will disown that kid it looks bad for her since they are trying to get Obama and Hillary elected again.",
    "likes": 0
  },
  {
    "commentText": "Democrats are so unhinged and violent. They’re also racist. Basically everything they call those on the right. \nDemocrats are on the wrong side of humanity.",
    "likes": 4
  },
  {
    "commentText": "there is the difference between libs and reps, liberals would have put her name out to everyone, this rep kid showed  civility even for a violent rival.",
    "likes": 0
  },
  {
    "commentText": "The United States of America is a liberal country founded on Liberal ideals. \n\n.",
    "likes": 0
  },
  {
    "commentText": "Something is stinking in this story. Something like: please don't come after me, my son is now  Republican you see? Just cover all my sins.",
    "likes": 1
  },
  {
    "commentText": "The derangement is so severe with melinda she just argues and fights with everyone.",
    "likes": 0
  },
  {
    "commentText": "She was a pathological liar when she worked for obummer.",
    "likes": 0
  },
  {
    "commentText": "I wonder if she’ll change her mind about her scum party? Highly doubt it. She’d stand with other women over her own son I’m sure.",
    "likes": 0
  },
  {
    "commentText": "Pilate presented Jesus, pro life, pro justice, anti violent, obey the laws,  and Barrabas, violent, promoted chaos, slaughter anyone who gets in the way, anti govt.,  for judgment  and the crowd of liberal progressive Democrats voted.",
    "likes": 0
  },
  {
    "commentText": "So what get lost you POS",
    "likes": 0
  },
  {
    "commentText": "Why was he at a pro K rally?",
    "likes": 0
  },
  {
    "commentText": "Good to see Susan Rices son at least has some ideological sensibility. I feel sorry for this guy having a lying, traitorous whore for a mother.",
    "likes": 0
  },
  {
    "commentText": "Guess we're gonna have to form proud girls next",
    "likes": 0
  },
  {
    "commentText": "Sorry your mom is a traitor. Maybe it's just karma.",
    "likes": 0
  },
  {
    "commentText": "Liar!!! The deaths this one caused in the Congo. Attention-seeking via her son now?!",
    "likes": 0
  },
  {
    "commentText": "FASCIST FEMINIST DIICTATORSHIP AT WORK to stop Trump and the free people",
    "likes": 2
  },
  {
    "commentText": "democrats are the 3 Ls- losers, Liars and Leeches~",
    "likes": 0
  },
  {
    "commentText": "PMS",
    "likes": 0
  },
  {
    "commentText": "This is just a bs tactic of “The Mob”.\nTrumpNation!🇺🇸",
    "likes": 2
  },
  {
    "commentText": "Actually that was his girlfriend",
    "likes": 0
  },
  {
    "commentText": "Susan Rice has a Republican son?!! hahaha Wow! That's gotta make their Thanksgivings interesting! lol Are you sure he isn't a mole? haha Yeah, Melinda looks like a bruiser. Maybe she's just frustrated because no one will date her...pent-up hormones. lol",
    "likes": 6
  },
  {
    "commentText": "Too bad liberals resort to steeling signs and getting in their faces. Wish they could have a peaceful dialogue. It’s okay to disagree but we need to be respectful each other.",
    "likes": 1
  },
  {
    "commentText": "Ingraham this is so low for you to invoke this kid in your immature life just because she is Susan rice daughter you are trying to dragg his name for cheap ratings!! I wonder why you are so fascinated with college kids .are you some pedophile ?come on old lady!",
    "likes": 0
  },
  {
    "commentText": "That's why I don't have respect for my country because the Rule of Law is not enforced, its only played with.  The higher up you go the more corrupt !  When Rodney Dangerfield came out with \"no respect\", everyone laughed except me.  You'll never get my respect until you deserve it !",
    "likes": 0
  },
  {
    "commentText": "Left is out of control",
    "likes": 0
  },
  {
    "commentText": "Susan Rice is a Snake!",
    "likes": 0
  },
  {
    "commentText": "Susan Rice needs water boarding.",
    "likes": 0
  },
  {
    "commentText": "He got bashed up by a beast woman!",
    "likes": 0
  },
  {
    "commentText": "This is why I walked away...conservatives fight with ideas. Liberals are generally violent or overly physical and entitled. It's gross",
    "likes": 11
  },
  {
    "commentText": "\"Melinda\" is Yuuuuuge",
    "likes": 0
  },
  {
    "commentText": "I want seven FBI investigative reports!",
    "likes": 9
  },
  {
    "commentText": "A bit suspicious that they don't have video to back up this alleged incident\nWhat was the problem? Everyone left their mobile phones at home?",
    "likes": 0
  },
  {
    "commentText": "Trying the victim card again? LOL\nNAHHH... try harder liars",
    "likes": 2
  },
  {
    "commentText": "A woman... you call this a woman? Looks like something else to me... a UWO (Unidentified Walking Object)",
    "likes": 0
  },
  {
    "commentText": "“Let every soul be subject to the governing authorities. For there is no authority except from God, and the authorities that exist are appointed by God. Therefore whoever resists the authority resists the ordinance of God, and those who resist will bring judgment on themselves.”\n‭‭Romans‬ ‭13:1-2‬ ‭NKJV‬‬",
    "likes": 0
  },
  {
    "commentText": "Cnt is going to jail",
    "likes": 0
  },
  {
    "commentText": "Laura, have you interviewed the man hit by a bike lock?\nFollowed up on the injustice allowing professor go free?\nWhy would you give airtime to the son of one of the biggest criminals involved in overthrowing our Republic?\nHe's likely planning a future in politics, climb to the top and pardon his mom. If he's against his mom he'd just go away, live his best life and NOT be in the public eye.",
    "likes": 1
  },
  {
    "commentText": "PAID PAID PAID  Soros thrives on divide and conquer.",
    "likes": 7
  },
  {
    "commentText": "This is bullshit, her son was beat up at another Trump rally too, he’s an agitator",
    "likes": 0
  },
  {
    "commentText": "Hehe Susan Rice does not like this video. He has woken up to the truth. I wish he came on to speak himself. His mom must have threatened to stop paying his tuition. Keep up the good job boys!",
    "likes": 3
  },
  {
    "commentText": "LOL Her son is conservative ... that must really burn Rice.",
    "likes": 51
  },
  {
    "commentText": "Seems almost every day now there's a story and/or video of the left being violent.",
    "likes": 4
  },
  {
    "commentText": "public record",
    "likes": 0
  },
  {
    "commentText": "Good young man who was converted into conservatism.",
    "likes": 0
  },
  {
    "commentText": "That kid does not know how to tie a tie. Bad knot, too big.",
    "likes": 0
  },
  {
    "commentText": "Why are liberal women always fat, ugly, or fat and ugly. And don't forget stupid and mentally ill.",
    "likes": 0
  },
  {
    "commentText": "Nothing these people allege should be believed. There has to be a spin in there somewhere.",
    "likes": 0
  },
  {
    "commentText": "Stanford University is one of the most evil institutions in America.",
    "likes": 5
  },
  {
    "commentText": "Leftism = hatred.  Leftism = violence.  Leftism = racism.  Leftism = injustice.  Leftism = lawlessness.",
    "likes": 0
  },
  {
    "commentText": "Left over sht.",
    "likes": 1
  },
  {
    "commentText": "Nice to see independent thinkers in a political family of liberals! All the best to the Republicans students, vote and hopefully you will have a larger voice on campus soon.",
    "likes": 37
  },
  {
    "commentText": "I believe in equal rights for women.  If a woman attacks a man, she deserves whatever he can deliver back.",
    "likes": 0
  },
  {
    "commentText": "Always press charges. Even if they aren't charged, it will document their behavior and allow a pattern to emerge.",
    "likes": 4
  },
  {
    "commentText": "Maybe she was on her period lol",
    "likes": 2
  },
  {
    "commentText": "He’s so adorable in his tie ☺️",
    "likes": 5
  },
  {
    "commentText": "Fake news",
    "likes": 0
  },
  {
    "commentText": "Good",
    "likes": 0
  },
  {
    "commentText": "He so awesome 😎",
    "likes": 0
  },
  {
    "commentText": "Funny how in this case we here the word ‘allegedly’.....Justice Kavanaugh didn’t get that presumption of innocence until proven guilty.🤔😒",
    "likes": 15
  },
  {
    "commentText": "I hope Americans continue to see just how violent the “party of tolerance” has become. I can’t believe sensible ppl still identify with that party. Even Michelle obama was rebuked by her own party when she called for civility.",
    "likes": 16
  },
  {
    "commentText": "Anyone else confused as balls by the title?",
    "likes": 0
  },
  {
    "commentText": "Assaulted for doing a Louder with Crowder bit",
    "likes": 4
  },
  {
    "commentText": "Remember the lies you told for Obama and Hillary on Benghazie. Well your son heard your lies and went republican. Only now you have to see him attack because of all the talk calling for violence by Democrats  Maxine Waters your pal Hillary Clinton and Eric Holder. It has come to kick you in the ass. How does it feel?",
    "likes": 7
  },
  {
    "commentText": "Melinda how proud you parents might be not you are a mad cow that’s the new liberal disease!!!",
    "likes": 4
  },
  {
    "commentText": "Susan Rice's son is a conservative Republican? Wow...",
    "likes": 102
  },
  {
    "commentText": "Nerdy dude has some muscles. Good work. Eat red meat, lift heavy things and keep away from the soy!",
    "likes": 4
  },
  {
    "commentText": "Don’t ever say susan rice didn’t do anything right.",
    "likes": 3
  },
  {
    "commentText": "a female aggressor, what else is new, they keep it up and they will find their faces smashed and not repairable cosmetically!",
    "likes": 13
  },
  {
    "commentText": "Glad they're pressing charges; the media portrays all things Conservative as evil & the DNC instructs the left to \"act out,\" so this is what we get.",
    "likes": 2
  },
  {
    "commentText": "\"Oh, by the way, mommy...\" \"You're gay, son? That's okay.\" \"No, mom. I'm a Republican.\" \"WHAT?!!! You're outta the will!\"",
    "likes": 1
  },
  {
    "commentText": "How can you go against your moms?",
    "likes": 0
  },
  {
    "commentText": "Screw the left.",
    "likes": 0
  },
  {
    "commentText": "run susan run",
    "likes": 6
  },
  {
    "commentText": "Susan Rice should be hanged for Bengahzi.",
    "likes": 17
  },
  {
    "commentText": "Taste of your own dem medicine. Tough. Best",
    "likes": 51
  },
  {
    "commentText": "Leftists don't allow due process.",
    "likes": 15
  },
  {
    "commentText": "Ben & his pal, John are far brighter & more articulate than John's mom, Susan.",
    "likes": 12
  },
  {
    "commentText": "Good! Next all of them",
    "likes": 0
  },
  {
    "commentText": "Can we please stop framing the left as “liberals“? Call them as they are, socialist leftists and please, please stop associating them with liberals.",
    "likes": 0
  },
  {
    "commentText": "Susan the LIAR Rice",
    "likes": 12
  },
  {
    "commentText": "Liberalism is a mental disorder( Mike Savage)",
    "likes": 46
  },
  {
    "commentText": "Susan Rice's son became a Republican because of his mother's involvement in the unmasking of Trump's campaign people and her covering up the Benghazi incident.",
    "likes": 80
  },
  {
    "commentText": "Antifa \"took over Portland\"?   Laura, I am with you 100% but let's not make such exaggerations.",
    "likes": 1
  },
  {
    "commentText": "2:21 ... Bingo !  out of the mouths of babes ...  thank you Ben ... nice to see brave, polite young people \nlike you  👍  🇺🇸  👍",
    "likes": 18
  },
  {
    "commentText": "This is when a female think a guy won't fight back that guy should have seriously He should have knocked her out he had the right",
    "likes": 13
  },
  {
    "commentText": "She is probably a feminist and he is a man.",
    "likes": 2
  },
  {
    "commentText": "Liberalism has become nothing more than anti-establishment. So what happens if liberal policies get established ? Will they cannibalize ?",
    "likes": 0
  },
  {
    "commentText": "Mole.",
    "likes": 0
  },
  {
    "commentText": "I feel for this young man,  because his mother is Susan Rice.",
    "likes": 116
  },
  {
    "commentText": "He doesn't want to give the name of this little terrorist out? Conservatives keep tying their hands behind their backs at every turn. Honestly, it's a wonder that we win at anything.",
    "likes": 7
  },
  {
    "commentText": "Controlled opposition",
    "likes": 0
  },
  {
    "commentText": "Good. I hope this isn’t fake news.",
    "likes": 4
  },
  {
    "commentText": "She's fat, she's ugly and she's triggered. Must be a sjw.",
    "likes": 0
  },
  {
    "commentText": "MILLENNIAL MILLIE ON YOUTUBE⬅ HOT CHICK QUESTIONS PEOPLE🌞",
    "likes": 0
  },
  {
    "commentText": "Bear spray",
    "likes": 10
  },
  {
    "commentText": "Lock her up!",
    "likes": 127
  },
  {
    "commentText": "Susan Rice assaulted all of America and the families of the victims that died in Benghazi. What say you Susan??",
    "likes": 114
  },
  {
    "commentText": "its too bad, he was just supporting kavanaugh before a leftwing extremist attacked him",
    "likes": 57
  },
  {
    "commentText": "MO MORE DEMOCRAPS!  Please no more DEMOCRAPS",
    "likes": 38
  },
  {
    "commentText": "The left is the party of acceptance tho right?",
    "likes": 48
  }
]