[
  {
    "commentText": "We don't need a wall!!!  We already have one! We need to just stop with all the FREEbies!!",
    "likes": 0
  },
  {
    "commentText": "If Trump won't build the Wall,  USA will look like Selena Gomez's father in 5 yrs.",
    "likes": 0
  },
  {
    "commentText": "is \"NORTH AMERICA\"  ISN'T \"AMERICA\" STUPID RETARDS.",
    "likes": 0
  },
  {
    "commentText": "East Berlin 1961",
    "likes": 0
  },
  {
    "commentText": "Why is a giant cheetoh puff our president?",
    "likes": 0
  },
  {
    "commentText": "2:13",
    "likes": 0
  },
  {
    "commentText": "Yes built that wall ! make sure to use  giant Lego blocks cheaper  than cement  and save 20 billion  dollar.",
    "likes": 0
  },
  {
    "commentText": "Beeldatwal",
    "likes": 0
  },
  {
    "commentText": "Now thats alotta damage!",
    "likes": 0
  },
  {
    "commentText": "Build the Wall. Lock the Door.",
    "likes": 0
  },
  {
    "commentText": "Make sure the wall doesn't leak.",
    "likes": 0
  },
  {
    "commentText": "Jesus Christ died for your sins on a cross and rose again after three days. You have committed evil deeds, as we all have done. God is a just judge, and must punish you for these sins, because he is perfect by his nature. But God loves you, does not want to punish you. This is why God took the form of a man, Jesus Christ, and died as a sacrifice for your sins on a cross. He was punished for your sins, so that you could be made righteous in God's sight. After three days, Jesus rose again, because it is impossible for him to have been held down by death.\n\nThis is great news! Repent, (that is, change your mind,) and believe the Gospel of Jesus Christ, and be saved from the judgement of God. God will reward you for your faith with eternal life, and forgiveness for your deeds. I sin, and you sin, and we both will continue to sin, but Jesus Christ died for these sins, and God is willing to forgive them. Please, repent, and believe the Gospel.",
    "likes": 0
  },
  {
    "commentText": "More asbestos more asbestos",
    "likes": 0
  },
  {
    "commentText": "Mexicans we ain't stopping till the world is ours",
    "likes": 0
  },
  {
    "commentText": "Border patrol doesn't know about border more than cartels wtf is he talking about  Liar   Is they know so much why they don't catch all them cartels and all them drugs coming through",
    "likes": 0
  },
  {
    "commentText": "MAGA!!! Trump 2020!!!! Yeeewwww!!!",
    "likes": 0
  },
  {
    "commentText": "build that WAR",
    "likes": 0
  },
  {
    "commentText": "build what? its late 2018",
    "likes": 0
  },
  {
    "commentText": "I've always found it so odd when people go on about how honest illegal immigrants are, when the people they are talking about are committing a crime every second.\nYou do not just let the burglar off when they have left the house, and if they are caught in the house what kind of person keeps going on how honest they are?\nSome one once asked me \"If twenty years ago some one committed a burglary to feed their family, do I think they should have to go to prison now\"  To which I answered \"May be not after all twenty years ago they did not get caught. But if they are still doing it today and every day for the last twenty years then Yes. Just because they got away with it twenty years ago doe's not mean they win have the right to get away with it everyday. The crime does not end the day they come in, every second after that they are still committing a crime. Being a criminal is a life lifestyle choice, not a race. You can pick your lifestyle you can not pick your race.\"\nThe next line they always come up with is how hard working illegal immigrants are. To which I say \"So what? Some crime is hard work, not all crime is easy. But it's easy than not being a criminal or people would not be criminals. Do you know whats a harder than being a illegal immigrant? Being a legal immigrant. If it was easier there would be no illegal immigrant. Legal immigrants are the number one group where a large percentage hate illegal immigrants, after all, if you had to work hard, how would you like people who got the same reward for no work?.\"\nOf course they never say illegal immigrants it's always some thing like undocumented guest worker, which I find odd. A guest is some one who is invited, and at the end of that invitation leaves. A guess has no right to tell me how to live my life, and can not get me to change it to be like the place they were so much of a hurry to leave, then want me to pay for it.\nBreaking into a country doesn’t make you any more a member of that country, than breaking into a house makes you a member of the family.",
    "likes": 0
  },
  {
    "commentText": "Nope! In Anaheim Disneyland Resort is way better than this crap,",
    "likes": 0
  },
  {
    "commentText": "He’s never going to have a wall. He’s poor for building dat wall..Also, It’s not important idiot trump.",
    "likes": 0
  },
  {
    "commentText": "Bill da wah",
    "likes": 0
  },
  {
    "commentText": "good luck trying  building the wall. LOL 2018 and so far I din't see nothing LOL",
    "likes": 0
  },
  {
    "commentText": "\"Tear down this wall!\"  ~ Ronald Regan",
    "likes": 0
  },
  {
    "commentText": "Build a wall also build a wall in canada",
    "likes": 0
  },
  {
    "commentText": "BUILD THAT WALL!!!",
    "likes": 0
  },
  {
    "commentText": "Memes",
    "likes": 0
  },
  {
    "commentText": "Yes \"make america great again\" with another \"Berlin Wall!!!...  That's what America needs  -  Thank God for the Orange - Uranatang squatting (with his ass-plastered on his face)  and inside the beautiful White House!  Of-course this is what America needs :(  ...... and all his goonies running behind him  :(    ....Someone have the SENSE to blow this monkey off his perch!",
    "likes": 0
  },
  {
    "commentText": "I thought this was a soundtrack from bastion",
    "likes": 0
  },
  {
    "commentText": "But did they build that wall?",
    "likes": 0
  },
  {
    "commentText": "\"Great Wall Of America\"",
    "likes": 0
  },
  {
    "commentText": "this is california.\ncalifornians are sick of immigrants taking their work and watering down their income. They hate being in a car accident with an illegal who is insured or licensed and wont pursue any justice just deportation.",
    "likes": 0
  },
  {
    "commentText": "Build that walllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllll from Japan !!!!!!!!!!!!!!!",
    "likes": 0
  },
  {
    "commentText": "i love it",
    "likes": 0
  },
  {
    "commentText": "The wall still isnt built lol, stupid republicans fooled",
    "likes": 0
  },
  {
    "commentText": "\"We're Ganna build the wall we have no choice\" - Trump,May 2016 \n\n\n\n2 years later 😂😂",
    "likes": 1
  },
  {
    "commentText": "...... and he talks all this jargon and doesn't back it up with a single fact or name or citation or anything resembling evidence. it's unbelievable that people listen to this sales pitch and call it \"leadership\".",
    "likes": 0
  },
  {
    "commentText": "does anyone hate trump?",
    "likes": 0
  },
  {
    "commentText": "For all you people yelling Build that wall .why don't you have your government garnish your paycheck to help pay for it. Americans  are broke and can't afford it . You should be chanting pay back China, with ya broke ass. America is going into a depression with your president Trump and most of you don't care as long as you have your hate. DEATH to America...........",
    "likes": 0
  },
  {
    "commentText": "Build the wall",
    "likes": 0
  },
  {
    "commentText": "I like the Hispanic hitman to the right of trump lol",
    "likes": 1
  },
  {
    "commentText": "Dump TRUMP",
    "likes": 0
  },
  {
    "commentText": "crazy Trump",
    "likes": 0
  },
  {
    "commentText": "Yes bulid that Wall",
    "likes": 0
  },
  {
    "commentText": "If y’all want to be “technical”, I’m 100% Navajo and y’all are on my land...🤣 (sarcasm, if y’all leftists/democratics/liberals/ANTIFA-loving people didn’t get that 😉). Laws are laws. We have laws for a reason. There’s a right way and a wrong way to do everything. Legal is legal. Illegal is ILLEGAL. Cry me a river. The United States of America is the greatest county in the world! Build that wall! I’ll help build the wall!",
    "likes": 0
  },
  {
    "commentText": "\"Gorbachov, tear down that wall\", Ronald Reagan Republican. Trump will build a wall three times higher. What a sick country the USA is. Worse than the Third world that people leave to go there. Its a pigsty.",
    "likes": 0
  },
  {
    "commentText": "Wait is agent 76 about to kill trump",
    "likes": 0
  },
  {
    "commentText": "It's 2018 and I'm still watching this",
    "likes": 0
  },
  {
    "commentText": "I disagree totally on most democratic issues, at times I've considered becoming a republican. But now, like some I'm reluctant becoming an republican party, due to the fact that. The Republicans parties have essentially become to weak and decadent over the years. To the point that they've caved in to the leftist socialist views that it's almost impossible to distinguished between the two parties.  What happened to the conservative Republican parties ? ( where are they, please stand up ) !!!  why morality along with commonsense and patriotic political legislation been replaced with amorality, and weak ambiguities of  leftist liberal agendas. The white males in congress have now allowed, CNN, MSNBC, and Hollywood, to chip away at the core key issues, that describes what it means to be a true American supporter of patriotism. We need to hold ALL Republicans that have leftist liberal views accountable, and those politicians who  vote and side with stupid dumb democratic agendas, we need to call them OUT, ! expose them for who they truly are, and give them a very hard time, until these trader Republicans change their leftist liberal asinine anti American agendas.",
    "likes": 0
  },
  {
    "commentText": "Spend money on the WALL not school security.",
    "likes": 0
  },
  {
    "commentText": "WHITE KIDS KILL YOUR BABIES IN SCHOOLS NOT IMMAGRENTS.",
    "likes": 0
  },
  {
    "commentText": "Build it high",
    "likes": 0
  },
  {
    "commentText": "Waiting",
    "likes": 0
  },
  {
    "commentText": "Boo trump i will get you when im president i will break your wall",
    "likes": 0
  },
  {
    "commentText": "GO TRUMP",
    "likes": 0
  },
  {
    "commentText": "Jezz lol how this looks to others sadly  hopefully you can work things out together best of luck :) prayers to you both countries",
    "likes": 0
  },
  {
    "commentText": "BUILD THE WALL",
    "likes": 0
  },
  {
    "commentText": "Build thay wall. These people are coming to our country and taking our jobs! No taxes or anything. Make america great again",
    "likes": 0
  },
  {
    "commentText": "BUILD BRIDGES! NOT WALLS!",
    "likes": 0
  },
  {
    "commentText": "Mexican'ts think we're bad for wanting a wall. But all we want is a better life.",
    "likes": 2
  },
  {
    "commentText": "build that wah, build that wah",
    "likes": 0
  },
  {
    "commentText": "BULID THAT WALL!!!!!!!!!!",
    "likes": 0
  },
  {
    "commentText": "\"Mr. Trump, Tear Down This Wall!\"",
    "likes": 0
  },
  {
    "commentText": "BTW MAGA BBQ",
    "likes": 0
  },
  {
    "commentText": "I hope it’s not a wall to keep Christians from escaping from what’s to come,\nRecognize the beast Fam 🙏",
    "likes": 0
  },
  {
    "commentText": "THE ONLY THING YOU NEED tO BUILD IS YOUR ASS STFU ALL U DUMBASS",
    "likes": 0
  },
  {
    "commentText": "Build da wall",
    "likes": 0
  },
  {
    "commentText": "├┬┴┬┴┬┴┬┴┤",
    "likes": 0
  },
  {
    "commentText": "What wall some can explain?",
    "likes": 0
  },
  {
    "commentText": "BREAK THE WALLS DOWN!\n\n-Y2J",
    "likes": 0
  },
  {
    "commentText": "I'm just glad the Mexicans are paying for it.\nGod bless Trump!",
    "likes": 2
  },
  {
    "commentText": "2018 and the wall is in progress :D",
    "likes": 0
  },
  {
    "commentText": "The wall will stop illegal immigration.",
    "likes": 0
  },
  {
    "commentText": "90 percent sure thats tito ortiz to the right",
    "likes": 0
  },
  {
    "commentText": "funniest thing is that he is not even american...",
    "likes": 0
  },
  {
    "commentText": "Build the wall if you want but how are you gonna' stop ppl from illegally staying after their visa expires?",
    "likes": 0
  },
  {
    "commentText": "WRONG",
    "likes": 0
  },
  {
    "commentText": "PUT ANOTHER BRICK N THE WALL ✌️",
    "likes": 0
  },
  {
    "commentText": "trump is a legend",
    "likes": 3
  },
  {
    "commentText": "What the hell does he mean by let people flow across like Swiss cheese? That's a really weird way to put it",
    "likes": 0
  },
  {
    "commentText": "Cia in the back?",
    "likes": 0
  },
  {
    "commentText": "do you like kids?",
    "likes": 0
  },
  {
    "commentText": "President Agent Orange.",
    "likes": 0
  },
  {
    "commentText": "No choice.... build that wall",
    "likes": 2
  },
  {
    "commentText": "This is so that birds have a hard time flying south for the winter, it would kill them. Its not even about what they say.",
    "likes": 0
  },
  {
    "commentText": "Its just so funny watching these people chant together with their president such a stupid thing! Had a good laugh. I accepted that not all people can think straight. Probably one of the biggest gatherings of idiots ive ever seen.",
    "likes": 0
  },
  {
    "commentText": "You brainless shithole trump supporters should get your asses out there to build that wall yourself brain dead trump dick riders",
    "likes": 0
  },
  {
    "commentText": "Build the wall!!!!!!",
    "likes": 1
  },
  {
    "commentText": "UGHHH GOD SOME SHOT HIM IN HIS DIRTY BRAIN",
    "likes": 0
  },
  {
    "commentText": "This is ONE of the MOST dumbest shits I've ever heard or seen in my life!!! Built a wall? How about going to see the Wizard with Dorothy and get your ass a brain!!",
    "likes": 0
  },
  {
    "commentText": "Pink Floyd  didn't like this",
    "likes": 0
  },
  {
    "commentText": "This is like WWE",
    "likes": 0
  },
  {
    "commentText": "Mr beast sent me here",
    "likes": 0
  },
  {
    "commentText": "I’m mexican if your to leave a like and trump dies",
    "likes": 2
  },
  {
    "commentText": "Lol it’s kinda chatty",
    "likes": 0
  },
  {
    "commentText": "Folks. We need a wall.",
    "likes": 5
  },
  {
    "commentText": "trumps finishes border between mexico.\n\nMeanwhile...\n\nnorth korea builds a wall between it's place facing south korea.",
    "likes": 1
  },
  {
    "commentText": "goodbye black people hello USA!!!!!!!!!!",
    "likes": 0
  },
  {
    "commentText": "Usa today anhiem building wall now",
    "likes": 0
  },
  {
    "commentText": "My math teacher said put a binder between u and ur partner and think of it as a wall THE KID NEXT TO ME WAS BORN IN MEXICO i laughed so hard and nobody but the kid next to me got it",
    "likes": 0
  },
  {
    "commentText": "As a Donald Trump supporter, I'm glad that he's our current US President but the idea of the building a wall to keep illegal people out, that's something i cannot agree with him. I may sound like a hypocrite but it's true.",
    "likes": 0
  },
  {
    "commentText": "The rest of the world should join in and build a great big wall all around the USA , not to keep people out but keep Americans in . Who in their right mind would want to go to a country where the people murders each other even in their schools , churches and places of entertainment , where Neo Nazis marches with torches like the KKK with the tacit approval from their president, where the police kills their black citizens with no consequences and where the killing of police officers are common place , where the political system is corrupt and rotten to the core . Build that wall ! Build that wall !",
    "likes": 0
  },
  {
    "commentText": "Its just another president saying stuff that is not going to happen",
    "likes": 0
  },
  {
    "commentText": "I wonder if his parents snuck and did not do nothing bad wonder what kind of story it would be then",
    "likes": 0
  },
  {
    "commentText": "It feels good to know Trump is President.    As being half mexican   I hope he builds the wall, if you want to come to America use the front door & do it legally.   Mexicos drug war is out of control & is spilling into the USA.",
    "likes": 0
  },
  {
    "commentText": "Build the wall! Build the wall! Build the wall! Build the wall! Build the wall!",
    "likes": 0
  },
  {
    "commentText": "WE NEED TO BUILD A WALL TO KEEP IMMIGRANTS OUT",
    "likes": 0
  },
  {
    "commentText": "hitman in the back trying to protect trump",
    "likes": 0
  },
  {
    "commentText": "I don’t think it will get build , white people are so lazy and procrastinators , they will never finish it",
    "likes": 2
  },
  {
    "commentText": "Instead the fking dumb wall , invest on cleaning the sea , there is trash islands as big is texas state in the pacific , trash from california , invest on that fker , make america greater having  clean oceans , use our taxes for good purposes",
    "likes": 1
  },
  {
    "commentText": "fk the wall",
    "likes": 2
  },
  {
    "commentText": "Bruh i think u should build a wall on Trumps face xD and no we are not hiding :D ( roasted )",
    "likes": 0
  },
  {
    "commentText": "I hate Donald Trump",
    "likes": 0
  },
  {
    "commentText": "Build that wall",
    "likes": 1
  },
  {
    "commentText": "Tito Ortiz in the background. Hit man and Trump supporter. lol nice",
    "likes": 0
  },
  {
    "commentText": "BUILD THAT WALL UNITED STATES OF AMERICA!!",
    "likes": 0
  },
  {
    "commentText": "Wt heck is he talking about if we build a dome no what just check out the Simpsons movie it will show you",
    "likes": 0
  },
  {
    "commentText": "Say what you want. Trump knows how to connect with his audience.",
    "likes": 0
  },
  {
    "commentText": "..hmmm",
    "likes": 0
  },
  {
    "commentText": "Ah well, a year later we are only talking about \"Repair that fence!\"  And nobody expects the Mexicans to pay for it. Trump supporters , tired of winning yet?",
    "likes": 0
  },
  {
    "commentText": "Why are people anti wall? That's legit",
    "likes": 0
  },
  {
    "commentText": "I find it incredible/disturbing that his people believe Everything that he says without questioning a single word.\nAre you people SO desperate or just really Stupid?",
    "likes": 1
  },
  {
    "commentText": "A wall won't do anything but cost the USA money.  Anyone who believes a wall will actually do anything is very VERY brainwashed and ignorant.  Trump is a very stupid person and that is obvious.   But when he talks about building a wall I can't tell if he actually believes it will work.  Or if he just says it because he knows that his followers are even dumber than him.  It literally makes be sad that so many people support trump.  But it makes me even more sad to know that the majority of people supported Hillary or Trump because both are extremely despicable.   Oh and for any trump supporters who are reading this don't feel bad if you can't comprehend all of what I am saying.  I understand that you are mentally impaired and I sympathize.",
    "likes": 0
  },
  {
    "commentText": "why do trump waste 200 milion dorllar on a wall but it \nonly cost 125 suns",
    "likes": 0
  },
  {
    "commentText": "Humpty Trumpy, sat on the fall\nHumpy Trumpy, had a great wall.\nHe comes the President who had a dangerous disability! \n\n(I used these two words switched from these two lines from the end).",
    "likes": 0
  },
  {
    "commentText": "Every time Trump chants build that wall, he has a different hand signal hahahaha",
    "likes": 0
  },
  {
    "commentText": "Is that Tito Ortiz??",
    "likes": 0
  },
  {
    "commentText": "donald trump is not a bad president i am ecuadorian latino he only want to help usa with no mexi narcos",
    "likes": 0
  },
  {
    "commentText": "Why a wall? Why not snipers or apache helicopters?",
    "likes": 0
  },
  {
    "commentText": "France needs a guy like him.",
    "likes": 0
  },
  {
    "commentText": "Just get Hank Donner A.K.A El Gringo on border patrol xD",
    "likes": 0
  },
  {
    "commentText": "these guys are like little kids.....cheeze americans",
    "likes": 0
  },
  {
    "commentText": "I'm American but it's funny how you guys support him, he's a joke",
    "likes": 0
  },
  {
    "commentText": "Trump=Hitler",
    "likes": 2
  },
  {
    "commentText": "Where is the wall?",
    "likes": 0
  },
  {
    "commentText": "Build that wall",
    "likes": 0
  },
  {
    "commentText": "Climb that wall climb that wall",
    "likes": 2
  },
  {
    "commentText": "BUILD THE WALL!!!!!",
    "likes": 2
  },
  {
    "commentText": "Ok fast forward to July 27th 2017 and the wall still hasn't even begun to be built",
    "likes": 0
  },
  {
    "commentText": "Trump got the idea from attack on titan XDDD\nJk",
    "likes": 0
  },
  {
    "commentText": "2:00 when the red pills started to kick in",
    "likes": 0
  },
  {
    "commentText": "build it already",
    "likes": 0
  },
  {
    "commentText": "What happens if mexico build a wall first?",
    "likes": 0
  },
  {
    "commentText": "NO construiremos tu muro \nUstedes pagenlo nosotros los mexicanos no pagaremos tu muro ustedes pagenlo",
    "likes": 0
  },
  {
    "commentText": "F*** DONALD UGLY A** TRUMP",
    "likes": 0
  },
  {
    "commentText": "i know why i voted for this man. he is a true American",
    "likes": 1
  },
  {
    "commentText": "how bout dis dont build da wall build a island",
    "likes": 0
  },
  {
    "commentText": "Build that Waw? Listen to him chanting... The L's seem to disappear",
    "likes": 0
  },
  {
    "commentText": "Build that fuggin' wall!!!🇺🇸🇺🇸🇺🇸🇺🇸🤣",
    "likes": 0
  },
  {
    "commentText": "To trump here's an idea start using prisoners, jail etc. it be less cheaper instead hiring white people.",
    "likes": 0
  },
  {
    "commentText": "atleast america will be safe if Titans existed in the future.",
    "likes": 0
  },
  {
    "commentText": "Go ahead isis \nBomb them all\nBomb them all\nBomb them all\nLet's see 9-11 part 2 happen but on Trump Towers :) \nThere lives don't matter? Yes they don't there trump supporters :)\n#PrayForBombering :)\n#PrayForExecution :)",
    "likes": 0
  },
  {
    "commentText": "US need that wall . So many Mexican Cows and goat crossing the border.",
    "likes": 0
  },
  {
    "commentText": "build a wall up he's ass!!!",
    "likes": 0
  },
  {
    "commentText": "Guys, I bet Donald Trump would be the next elusive target in the next Hitman game.\n\nAgent 47 is standing behind him!",
    "likes": 0
  },
  {
    "commentText": "we don't want no more illegal drugs coming in to our country so we have no choice\n\n#makeamericagreatagain!",
    "likes": 0
  },
  {
    "commentText": "6 months later no wall, no wall funding, DACA and DAPA safe, more funding for refugees in the FY2018 than all 8 years of Obama\n\nWINNING!",
    "likes": 3
  },
  {
    "commentText": "\"We have the equipment, we have everything but we are told to stand back and let them pour in...\" surely you've just answered your own question. Instead of spending 25Bn on a wall, change the rules so the border patrol can engage with any people illegally entering the US? I don't know, just using trumps own words, which I believe is something he hates people doing.",
    "likes": 0
  },
  {
    "commentText": "he is 145th king fritz",
    "likes": 0
  },
  {
    "commentText": "Hahaha... no thanks stupid.",
    "likes": 0
  },
  {
    "commentText": "HAHAHA OTAKNYA BODOHKAH BIKIN TEMBOK\n\nHAHAHA IS HIS BRAIN IS DUMB BUILDING A WALL",
    "likes": 0
  },
  {
    "commentText": "Damn i live in anaheim never knew he said this at my home town",
    "likes": 0
  },
  {
    "commentText": "what wall?..... I don't see a wall. wtf are you guys singing about?",
    "likes": 0
  },
  {
    "commentText": "How's that wall coming along lol?",
    "likes": 0
  },
  {
    "commentText": "Build that wall!",
    "likes": 0
  },
  {
    "commentText": "Wait is that Tito Ortiz at the back?",
    "likes": 0
  },
  {
    "commentText": "BUILD  THAT  GREAT  WALL !   God  BLESS  you  Donald Trump !",
    "likes": 0
  },
  {
    "commentText": "Build the wall! Build the wall!",
    "likes": 0
  },
  {
    "commentText": "how can Europeans cross the sea kill, rape, still land, an slave people,  that's the impalement of true Evil, and now in 2017 nothing has changed they are still Evil, building a wall to keep out the Mexican people, Texas, los Angeles, Huston was stolen, I'm not Mexican I'm a proud African American, born to tell the truth, and sometimes the truth hurts.",
    "likes": 2
  },
  {
    "commentText": "Why did this become a meme?",
    "likes": 0
  },
  {
    "commentText": "do not build a wall that's bad you know what happens if you build a while you were separated family",
    "likes": 0
  },
  {
    "commentText": "Okay Trump we get it \nYou want to make Attack on Titan",
    "likes": 0
  },
  {
    "commentText": "BUILD THAT WALL",
    "likes": 0
  },
  {
    "commentText": "builds the wall ya happy now?",
    "likes": 0
  },
  {
    "commentText": "Build the dome we dont need another 9/11 attack",
    "likes": 0
  },
  {
    "commentText": "Cause there's no one to love you\nif you build your walls\ntoo high..\nSTOP THE WALL IDEA TRUMP!1!!1!11!",
    "likes": 0
  },
  {
    "commentText": "I like Donald trump",
    "likes": 0
  },
  {
    "commentText": "So um, Kubz Scouts brought me here. Okay...",
    "likes": 0
  },
  {
    "commentText": "2:13",
    "likes": 0
  },
  {
    "commentText": "The wall just got 10 ft higher",
    "likes": 0
  },
  {
    "commentText": "\"Ice Wall Coming Up!\"",
    "likes": 1
  },
  {
    "commentText": "#maga",
    "likes": 0
  },
  {
    "commentText": "Now, I'm sure a considerable number of people who were yelling build that wall are racists.",
    "likes": 0
  },
  {
    "commentText": "Sociology is a great topic, I recommend everyone here check out some articles sometimes",
    "likes": 0
  },
  {
    "commentText": "Everybody should just go back to Mexico this state was only built for Americans not Mexicans and Muslims.....sorry I'm just speaking my mind😏",
    "likes": 0
  },
  {
    "commentText": "do not bild that wall",
    "likes": 0
  },
  {
    "commentText": "please build the wall because I'm opening a drone company in Mexico that Carry's people and ladders",
    "likes": 0
  },
  {
    "commentText": "Build that WALL!  build that wall! build that wall!",
    "likes": 0
  },
  {
    "commentText": "YOU SIR ARE A RACiSSSSSSSSST!!!!!",
    "likes": 0
  },
  {
    "commentText": "Build that wall ☝🏼️Build that wall ☝🏼️Build that wall ☝🏼️",
    "likes": 0
  },
  {
    "commentText": "Never thought about it but couldn't they just dig few feet under the wall so they dont have to climb the huge expensive wall?",
    "likes": 0
  },
  {
    "commentText": "the donald is encouraging people to be rasict KILL THE DONALD KILL THE DONALD KILL THE DONALD KILL THE DONALD KILL THE DONALD",
    "likes": 0
  },
  {
    "commentText": "If you want to build a wall, YOU pay for it!",
    "likes": 0
  },
  {
    "commentText": "Walls are ugly. It's going to look as ugly as Donald Trump.",
    "likes": 0
  },
  {
    "commentText": "it actually starts @ 2:00",
    "likes": 0
  },
  {
    "commentText": "BUILD THAT WALL   BUILD THAT WALL   BUILD THAT WALL!",
    "likes": 0
  },
  {
    "commentText": "why am I still watching this in March 2017?",
    "likes": 0
  },
  {
    "commentText": "I'd love to stand there holding up a sign \"stand with Dump\"",
    "likes": 0
  },
  {
    "commentText": "build A longer wall than the Greatwall in China.",
    "likes": 0
  },
  {
    "commentText": "this is honestly my favourite youtube video",
    "likes": 0
  },
  {
    "commentText": "I feel like the wall is gonna end up like that other one that was torn down.",
    "likes": 0
  },
  {
    "commentText": "Why did I come here from mrbeast just why...",
    "likes": 0
  },
  {
    "commentText": "BUILD THAT WALL SO TRUMP CANT GET DIARIA AND DIE",
    "likes": 0
  },
  {
    "commentText": "BUILD THAT WALL BUILD THAT WALL",
    "likes": 0
  },
  {
    "commentText": "Bill the wall.",
    "likes": 0
  },
  {
    "commentText": "SUPPORT FROM SERBIA...",
    "likes": 0
  },
  {
    "commentText": "Build that wall",
    "likes": 0
  },
  {
    "commentText": "\"Niemand hat die Absicht eine Mauer zu bauen.\"\n\"Noone wants to build a Wall.\"\n\nWalter Ulbricht 1961\nDDR-Staatsratsvorsitzender\nHead of the German Democratic Republic and the Socialist Unity Party of Germany",
    "likes": 0
  },
  {
    "commentText": "2:07 xD Dat Face Bruh",
    "likes": 0
  },
  {
    "commentText": "\"We will make America Great Again\" More Like \"We will make America Worse Again\"",
    "likes": 0
  },
  {
    "commentText": "u hate Muslims well look what God will say trump:-:-:-:-:-:-:-",
    "likes": 0
  },
  {
    "commentText": "Omg Tito Ortiz and John Cena at the background!",
    "likes": 0
  },
  {
    "commentText": "Milošek love Donald Trup",
    "likes": 0
  },
  {
    "commentText": "stupid trump why don't you build your face inserted of a walll😌😌😌",
    "likes": 0
  },
  {
    "commentText": "2:03",
    "likes": 0
  },
  {
    "commentText": "Build it ten times as wide and high as the Great Wall of China!!!",
    "likes": 1
  },
  {
    "commentText": "anyone else noticed the bug on his head at the start of the video?",
    "likes": 0
  },
  {
    "commentText": "White America is scared and weak.",
    "likes": 0
  },
  {
    "commentText": "BUILD THAT WALL!",
    "likes": 1
  },
  {
    "commentText": "Americans don't need the wall. American people need to stop buying drugs and build recovery centers.  that easy.  and work in the field picking up your food.  that is the real wall.",
    "likes": 0
  },
  {
    "commentText": "he has a retard haircut",
    "likes": 0
  },
  {
    "commentText": "Now that I've whatched this I thing I wanna put his face in my toilet and yea",
    "likes": 4
  },
  {
    "commentText": "plssssssss don't build a wole",
    "likes": 1
  },
  {
    "commentText": "is that UCF tito ortiz in the back?",
    "likes": 0
  },
  {
    "commentText": "What an blind nation. America is built on immigrants and now they build wall and shut down visas for other immigrants? WHat an dumb nation....",
    "likes": 0
  },
  {
    "commentText": "This is not how a real president would behave at a rally",
    "likes": 0
  },
  {
    "commentText": "The wall worked for China.",
    "likes": 0
  },
  {
    "commentText": "Da da da Dora\n\n\n\n\n\nDe de de deported.",
    "likes": 6
  },
  {
    "commentText": "fora mexicanos",
    "likes": 0
  },
  {
    "commentText": "Agent 47 Detected!!!",
    "likes": 0
  },
  {
    "commentText": "DONT BUILD THAT WALL!",
    "likes": 0
  },
  {
    "commentText": "Tall wall",
    "likes": 0
  },
  {
    "commentText": "I HATE TRUMP",
    "likes": 0
  },
  {
    "commentText": "He's building that wall! Donald Trump is hero of the American people",
    "likes": 0
  },
  {
    "commentText": "you need healthcare not a wall",
    "likes": 0
  },
  {
    "commentText": "No much higher so American can not get out or their own country.",
    "likes": 0
  },
  {
    "commentText": "We have no choice we have no choice lmfao!!! 😂",
    "likes": 0
  },
  {
    "commentText": "So just a question all you morons that can't comprehend how a wall works.....do you have a wall/fence around your property.....do you lock your doors at night.......do these pos celebrities that don't want a wall on our border have a fortress with security that will take you out! Just ask Madonna a man was killed on her property for crossing her fence! So what's the difference?? We all want safety! It's not that difficult to understand!",
    "likes": 1
  },
  {
    "commentText": "where's the video when Trump was doing a fist pound as he was chanting Build That Wall with his eyes closed?",
    "likes": 0
  },
  {
    "commentText": "Knock down the wall imo.",
    "likes": 0
  },
  {
    "commentText": "WOW! With a speech like this he could win the nobel peace price, easy.",
    "likes": 1
  },
  {
    "commentText": "BUILD THAT WALL!! and we will",
    "likes": 0
  },
  {
    "commentText": "Dumb fucks...they can walk across the border through all entries. Be smart...charge them and use the funds to build a wall...charge an extra tax to anyone that travels to the U.S. from any Southern American Country. We don't have to spend American Dollars to fund a wall...So stop dreaming about we are building it. You're pissing money and intelligence away based on racial stupidity.",
    "likes": 0
  },
  {
    "commentText": "HA HA HA - PACK YOUR BAGS YOU ILLEGALS - HA HA HA - LOVE AND VOTED FOR TRUMP TO GET RID OF THE DRAIN ON MY TAX DOLLAR.  GO FREELOAD ELSEWHERE!",
    "likes": 0
  },
  {
    "commentText": "BUILD THAT WALL 🙌👊",
    "likes": 3
  },
  {
    "commentText": "wait... I thought he's rich, was expecting the wall to be made out of gold like his toilet",
    "likes": 0
  },
  {
    "commentText": "Sounds like he said Billed that wall",
    "likes": 0
  },
  {
    "commentText": "Now he is building it...",
    "likes": 0
  },
  {
    "commentText": "Build that wall build that wall lmfaoooo",
    "likes": 0
  },
  {
    "commentText": "Faz o muro",
    "likes": 0
  },
  {
    "commentText": "obviously Trump is an IDIOT guess he's  never heard of people getting on PLAINS or  HELICOPTERS. LMFAO. Obviously  these IDIOTS also   that are chanting  Build THAT WALL  never heard of people getting on PLAINS or HELICOPTERS either LMFAO. ugh so sad America  just slowly  going down the drain",
    "likes": 0
  },
  {
    "commentText": "building the wall is NOT RACIST ITS ENFORCING THE LAW, think for a moment you anti wall protestors",
    "likes": 0
  },
  {
    "commentText": "why not a mote full of gators and pirrana ?\nIsnt that easier than a wall ?",
    "likes": 0
  },
  {
    "commentText": "BUILD THAT WALL!!!! BUILD THAT WALL!!! BUILD TAHT WALLLLL!!!!!",
    "likes": 1
  },
  {
    "commentText": "why the people want to make a wall",
    "likes": 0
  },
  {
    "commentText": "why is he build a wall why🤔🤔🤔🤔",
    "likes": 0
  },
  {
    "commentText": "No one needs a wall, New Mexico's Pueblo's de Toas are 1,400 years old. We have been under United States occupation for 107 years. We make no apologies for being New Mexican, we are no longer in fear. We retained Popular Soveriengty, power is reserved to the people, for the people by the people, inviolate. Go in Peace and stay out. New Mexico Republic for which it stands, One Nation under God indivisible with liberty and justice for all in 2017!!",
    "likes": 0
  },
  {
    "commentText": "Ancient Israel had a similar problem and this was written: “I looked for someone among them who would build up the wall and stand before me in the gap on behalf of the land so I would not have to destroy it, but I found no one.\" Ezekiel 22:30. This is why Trump was chosen, American politicians can't build a wall.",
    "likes": 0
  },
  {
    "commentText": "build that wall hhahahaah",
    "likes": 0
  },
  {
    "commentText": "My man",
    "likes": 1
  },
  {
    "commentText": "Construa o muro!",
    "likes": 0
  },
  {
    "commentText": "No I hate the wall",
    "likes": 0
  },
  {
    "commentText": "this wont solve immagration im pretty sure ropes and ladders are available in mexico",
    "likes": 1
  },
  {
    "commentText": "Anyone else immediately notice the fly in his hair at the beginning of the video?",
    "likes": 0
  },
  {
    "commentText": "is that Tito Ortiz is the crowd lol",
    "likes": 0
  },
  {
    "commentText": "Raid the sanctuary cities for illegals. Have Sherriff Arpaio  conduct tent cities as the illegals start to build the wall. When completed toss the illegals south of the wall. Done.",
    "likes": 0
  },
  {
    "commentText": "Taxpayers will pay for it",
    "likes": 0
  },
  {
    "commentText": "BUILD THAT WALL BUILD THAT WAll",
    "likes": 2
  },
  {
    "commentText": "people think he is being raceist,but he is just stoping illigal people",
    "likes": 5
  },
  {
    "commentText": "NOT EVEN IN OFFICE AND ALREADY  BREAKIN   PROMISES, SUCKERS",
    "likes": 0
  },
  {
    "commentText": "And mine hand shall be upon the prophets that see vanity, and that divine lies: they shall not be in the assembly of my people, neither shall they be written in the writing of the house of Israel, neither shall they enter into the land of Israel; and ye shall know that I am the Lord GOD. Because, even because they have seduced my people, saying, Peace; and there was no peace; and one built up a wall, and, lo, others daubed it with untempered morter: Lo, when the wall is fallen, shall it not be said unto you, Where is the daubing wherewith ye have daubed it? Thus will I accomplish my wrath upon the wall, and upon them that have daubed it with untempered morter, and will say unto you, The wall is no more, neither they that daubed it;\nEzekiel:13:9-10,12,15",
    "likes": 0
  },
  {
    "commentText": "The wall just got 10 feet higher.",
    "likes": 0
  },
  {
    "commentText": "build the wall and blow up the tunnels that the cartels are doing. the wall will be easy for the cartel to get in, they got ways. one case where the US government ( under Obama administration) sold money to the drug cartels from Mexico and one of the border patrol saw them doing it and then he was killed off the spot. I agree with the wall but he needs also to blow up the underground tunnels",
    "likes": 0
  },
  {
    "commentText": "I thought Hilary and Obama voted in favor to build a border fence in 2006 while they were in the Senate?",
    "likes": 0
  },
  {
    "commentText": "Build that wall!!",
    "likes": 0
  },
  {
    "commentText": "Lets build an Wall",
    "likes": 0
  },
  {
    "commentText": "Love Trump!",
    "likes": 0
  },
  {
    "commentText": "#MakeAmericaGreatAgain",
    "likes": 0
  },
  {
    "commentText": "I think Donald' trump should have been a brick layer 😨",
    "likes": 0
  },
  {
    "commentText": "Rock hard Johnson from Mr President",
    "likes": 0
  },
  {
    "commentText": "fact a wall will not keep them out wen thay have boats plains tanks ect not to mention its imposepel",
    "likes": 0
  },
  {
    "commentText": "YES!!! BUILD A WALL BUILD THAT WALL!!!!",
    "likes": 3
  },
  {
    "commentText": "BUILD THAT WALL!!! Give us the time and place Mr. Trump and we will be there to help build it.",
    "likes": 0
  },
  {
    "commentText": "next thing you know , BOOM a glass dome over america , Simpsons really predict alot 🤔",
    "likes": 0
  },
  {
    "commentText": "I thought China makes copyrighted things? Why is he gonna build The Great Wall of America?",
    "likes": 0
  },
  {
    "commentText": "https://instagram.com/p/BNnshD_Ak0I/I built a wall go check it out",
    "likes": 0
  },
  {
    "commentText": "well, Mexico is gonna build a great tunnel.",
    "likes": 0
  },
  {
    "commentText": "Please build the wall already Mr trump",
    "likes": 0
  },
  {
    "commentText": "Repetition will lead mankind into the slaughterhouse like the sheep they are. Persuasion rules the nation",
    "likes": 0
  },
  {
    "commentText": "helllo mr trump i need a wall at home ,can u help me?",
    "likes": 0
  },
  {
    "commentText": "288 sjwtards can't stop crying liberal tears!!!!",
    "likes": 0
  },
  {
    "commentText": "Tito Ortiz!",
    "likes": 0
  },
  {
    "commentText": "make the wall 100 feet 900 feet high",
    "likes": 0
  },
  {
    "commentText": "build that nice beautiful wall over our border",
    "likes": 0
  },
  {
    "commentText": "this guy is so funny lol",
    "likes": 3
  },
  {
    "commentText": "look at Trump's hands while he's chanting.",
    "likes": 0
  },
  {
    "commentText": "Funny watching this now that Sheriff Arpaio just lost the re-election haha.",
    "likes": 0
  },
  {
    "commentText": "Is that Cain in the back?",
    "likes": 0
  },
  {
    "commentText": "skip him",
    "likes": 0
  },
  {
    "commentText": "wat is wrong with people",
    "likes": 0
  },
  {
    "commentText": "Ronald Reagan tear down this wall Donald Trump build that wall my how the Republican party has changed",
    "likes": 0
  },
  {
    "commentText": "May our walls be ever ten feet taller!",
    "likes": 0
  },
  {
    "commentText": "Trump is a fkn Legend lmaoo",
    "likes": 0
  },
  {
    "commentText": "279 Mexican don't like that video lol",
    "likes": 0
  },
  {
    "commentText": "it kinda sounds like he is chanting \"bill at war\"",
    "likes": 0
  },
  {
    "commentText": "is that tito ortiz in the background?",
    "likes": 0
  },
  {
    "commentText": "Damn The Grass Is Gonna Be Long Asf And No More Buildings. ..",
    "likes": 1
  },
  {
    "commentText": "does he not relize he needs the Senate's aproval.",
    "likes": 0
  },
  {
    "commentText": "and whose gonna pay for it---mexicooo",
    "likes": 0
  },
  {
    "commentText": "viva mexico trump sucks",
    "likes": 0
  },
  {
    "commentText": "Attack on titan",
    "likes": 0
  },
  {
    "commentText": "Build that wall bitches!!!! I'm already on this side",
    "likes": 10
  },
  {
    "commentText": "ATTACK OF MEXICO!!!",
    "likes": 1
  },
  {
    "commentText": "Build that wall!",
    "likes": 0
  },
  {
    "commentText": "Build the wall intensifies! THE WALL JUST GOT 10 FEET HIGHER!",
    "likes": 2
  },
  {
    "commentText": "#BUILDTHATWALL!",
    "likes": 5
  },
  {
    "commentText": "#BUILDTHATWALL",
    "likes": 5
  },
  {
    "commentText": "BUILD THAT WALL!!!",
    "likes": 3
  },
  {
    "commentText": "is that bald smiling dude at the right of DT  tito ortis?",
    "likes": 0
  },
  {
    "commentText": "Hahaha, Trump just backpedaled on the great, big powerful wall. He is know chanting build that fence!!!!",
    "likes": 1
  },
  {
    "commentText": "tunnels 😂",
    "likes": 0
  },
  {
    "commentText": "a yuge wall?",
    "likes": 5
  },
  {
    "commentText": "lmao",
    "likes": 0
  },
  {
    "commentText": "I understand that boarder control (around the world) is important. but, is this any different to the Berlin Wall????? I'm just asking for people's opinion. I'm not saying it is or it is not.",
    "likes": 0
  },
  {
    "commentText": "How embarrassing- people around the world are shaking their heads in disbelief. Hundreds, if not thousands of Americans will have their privately owned land forcibly taken over by the government for political purposes. Disgusting.  And it won't work- has anyone ever heard of a boat? Many illegal immigrants have, and the number coming in by water is growing every year. Maybe Trump and his supporters could learn from them.",
    "likes": 0
  },
  {
    "commentText": "Planes",
    "likes": 0
  },
  {
    "commentText": "i better see tat wall from trump and maxico paying for it",
    "likes": 0
  },
  {
    "commentText": "Oh my god. !  2:13",
    "likes": 8
  },
  {
    "commentText": "I can't be the only one laughing and ashamed at the same time",
    "likes": 21
  },
  {
    "commentText": "I would have needed counseling if Clinton would have won",
    "likes": 3
  },
  {
    "commentText": "Build that wall we need it TX is overrun if they were going up north people up there would want a wall to.They are starting to take good jobs like welding and electrician",
    "likes": 0
  },
  {
    "commentText": "build that wall, build that wall, build that mall, build that mall",
    "likes": 9
  },
  {
    "commentText": "Thank God Trump Won the presidency. God Bless America",
    "likes": 1
  },
  {
    "commentText": "Yeah. Worked pretty well in east Berlin too. Build it, it will be fantastilicious...",
    "likes": 2
  },
  {
    "commentText": "simpletons... in 2 years \"the wall\" will be a  myth. the simple fact is \nthat there will be no one to build it, as 90%  of the contracting in \nthis country relies on immigrant labor.\n\nand, in  the unlikely event they do start building the wall... pick up \nwhere  chapo left off and build more tunnels.",
    "likes": 1
  },
  {
    "commentText": "1.The 'wall' will keep oppressed 'americans OUT of Mexico after the SHTF.\n2. Why is there no wall to keep illegal white Youropeans out?????",
    "likes": 2
  },
  {
    "commentText": "Hate trump",
    "likes": 0
  },
  {
    "commentText": "Donald Trump WIN. ...Now hide your family, MOJADOS, MUSLIM, and FAG'S. !    ha ha the time is come to clean the country of haters and low class scumbags welfare bitches. ! Build that wall. ....!",
    "likes": 2
  },
  {
    "commentText": "In the beginning there's a fly on his hair 😂",
    "likes": 0
  },
  {
    "commentText": "Who else is here after election results?",
    "likes": 0
  },
  {
    "commentText": "Build the wall 20 feet high with barb wire around it!!!",
    "likes": 7
  },
  {
    "commentText": "MUERETE",
    "likes": 0
  },
  {
    "commentText": "Build a fence! Build a fence! Build a fence! Lmao good job america for voting for this con man. 😂",
    "likes": 0
  },
  {
    "commentText": "your all desendents of imiigrants retartds who makes you better thsn them ... america is a immigrant nation not white ... remeber that",
    "likes": 0
  },
  {
    "commentText": "mexico for damn sure is not gunna pay for that wall theres already a border if america wants a wall america has to pay for it ..just like trump sayed were gunna build a wall you guys are gunna pay for it ... Idiots.. ...",
    "likes": 0
  },
  {
    "commentText": "destroy that wall destroy that wall destroy that wall destroy the wall destroy the wall destroy the wall",
    "likes": 0
  },
  {
    "commentText": "Tito Ortiz at 1 o'clock",
    "likes": 2
  },
  {
    "commentText": "I'm crying from laughter there is a hitman in the background without any sense of emotion while everybody is chanting \"build that wall\"",
    "likes": 217
  },
  {
    "commentText": "Is that hitman in the background?",
    "likes": 0
  },
  {
    "commentText": "BUILD THAT WALL! No more illegals in California",
    "likes": 91
  },
  {
    "commentText": "WOOOOOOOOO!!!!!!",
    "likes": 0
  },
  {
    "commentText": "duck you",
    "likes": 0
  },
  {
    "commentText": "BUILD THAT WALL",
    "likes": 0
  },
  {
    "commentText": "Tito Ortiz in the background??",
    "likes": 6
  },
  {
    "commentText": "oh man...",
    "likes": 0
  },
  {
    "commentText": "Building wall INCOMING",
    "likes": 32
  },
  {
    "commentText": "omg...please No wall...prayer time!!! get your hearts together. get your life right!!!",
    "likes": 10
  },
  {
    "commentText": "BUILD THAT WALL HOMES",
    "likes": 0
  },
  {
    "commentText": "YEAH BABY BUILD THAT WALL\nTRUMP 2016",
    "likes": 10
  },
  {
    "commentText": "theres a fly on his hair XD",
    "likes": 16
  },
  {
    "commentText": "When moneys beat culture 100 - 0.  It should be the opposite when we talking about leading a country",
    "likes": 0
  },
  {
    "commentText": "\"Trump\" hey guys turns out a walls going to be more expensive than we thought so were just going have to build a trench.",
    "likes": 0
  },
  {
    "commentText": "November 9th - We are building it guys :)",
    "likes": 187
  },
  {
    "commentText": "GZ Donald <33333",
    "likes": 0
  },
  {
    "commentText": "Is that Tito Ortiz in the background??! Lmao",
    "likes": 95
  },
  {
    "commentText": "TRUMP IS NOW THE PRESIDENT!  DEPORT THE ILLEGALS NOW!",
    "likes": 0
  },
  {
    "commentText": "NO...you build that wall Donald, lets see you get your hands dirty for once",
    "likes": 5
  },
  {
    "commentText": "Its stupid u ppl want that wall, whats more important.? 1 World or 1 World on War! This is not good ppl plizz do things righy a wall wont do nothing, it will be worst. Im Puertoriquen. Peace out",
    "likes": 0
  },
  {
    "commentText": "yajouj and majouj Mexicans 😂😂😂😂😂😂",
    "likes": 0
  },
  {
    "commentText": "\"Build that War\"? sry I have hearing problems",
    "likes": 0
  },
  {
    "commentText": "I'm being 100% honest I don't like Mexicans so BUILD THAT WALL",
    "likes": 0
  },
  {
    "commentText": "First Qin, then Hadrian, and now Trump.",
    "likes": 0
  },
  {
    "commentText": "ESTUPIDO DONALD TRUMP MEXICANOS VAMOS A LA GUERRA DE 2017!!!",
    "likes": 8
  },
  {
    "commentText": "booooooooooo donald trump no likes you and you have no life",
    "likes": 1
  },
  {
    "commentText": "THE COLLOSAL TITAN WILL DESTROY THE WALL",
    "likes": 0
  },
  {
    "commentText": "Build that wall!",
    "likes": 8
  },
  {
    "commentText": "if you'd like to help Donald Trump build the wall please visit Patriot wall Builders of America on Facebook thank you",
    "likes": 0
  },
  {
    "commentText": "Make Pink Floyd great again.",
    "likes": 0
  },
  {
    "commentText": "Romania should make a wall and put behind it all those gypsyes who are a shame for romanians",
    "likes": 0
  },
  {
    "commentText": "if u build a wall there will be a war in Canada",
    "likes": 0
  },
  {
    "commentText": "How much does a passport cost?",
    "likes": 0
  },
  {
    "commentText": "build it as high as the sky!",
    "likes": 1
  },
  {
    "commentText": "Please allow me know Why Trump supporters support corruption that Trump created?\nAmerica people all know building wall can't block criminals, it is absolutely useless, useless idea is Corruption idea, but why Trump supporters support this corruption idea that Trump created?\nDonald Trump said he would force Mexico to build border wall, 1) Trump can \"force\" Mexico to build border wall because Mexico doesn't have atomic bomb? 2) Trump can \"force\" Mexico to build border wall because building wall need a lot of money. so if he can't get a Penny from Mexico, he will take America people's a lot of money for wall. \n3) how much money did Mexico actually owe America? is that enough for wall? 4) those Mexico gay who support Trump will agree this plan, are they going to build the wall that they ever past through easily? 5) how long is Trump going to finish this wall?\nTrump Supporters think about illegal immigration,\nEB5 can explainswhat is illegal immigration, illegal immigration are poor people, legal immigration are rich people. so that is reason the poor America people long for building wall for the poor immigration. because America people think about poor immigration bring 911 to America. please allow me know if Trump America Supporters can recover from 911, is it possible? \ndo you know Only losers bully the weaker\n** Trump and Trump supporters are saying they are real losers ** please wake up.\nI have known many fake stories about Hillary in media during election , it doesn't make sense because I trust what michelle obama talk about hillary clinton is best for 2016 America president.",
    "likes": 0
  },
  {
    "commentText": "how is Donald Trump it can building a wall",
    "likes": 6
  },
  {
    "commentText": "BUILD THAT WALL!!! BUILD THAT WALL!!! BUILD THAT WALL!!!",
    "likes": 65
  },
  {
    "commentText": "We have to control who lives here",
    "likes": 0
  },
  {
    "commentText": "to the right of trump with the huge head, and red tie...  that is absolutely TITO ORTIZ, the MMA fighter, and who used to date that one porn star.",
    "likes": 1
  },
  {
    "commentText": "is that TITO ORTIZ?!",
    "likes": 4
  },
  {
    "commentText": "a 110 foot tall wall hell yes.",
    "likes": 0
  },
  {
    "commentText": "So according to this we need a wall to secure the border? When will you build the wall on the Northern Border? Will Canada pay for that wall? Or are you just going to keep our borders porous? I mean the Mexicans are coming and taking jobs like janitor, farmer, gardener, fast food worker shitty jobs like that.  You know what jobs those syrup sucking icebacks are taking?  Actor, Musician, Comedian Directors CEOs you know the good jobs.",
    "likes": 2
  },
  {
    "commentText": "this gets me fired up every time ...BUILD THAT WALL !!!!",
    "likes": 26
  },
  {
    "commentText": "the greatest man alive today",
    "likes": 0
  },
  {
    "commentText": "you are the wearst donal trump fack you",
    "likes": 0
  },
  {
    "commentText": "If trump build a wall the people of the United States of America can not go what country you like. Like Paris, Mexico, Canada, Africa, China, Australia or Alaska.",
    "likes": 0
  },
  {
    "commentText": "thirty years ago, Reagan said \"Tear down this wall\"\nToday, Trump says \"Build that wall!\"\n\nTimes sure have changed",
    "likes": 37
  },
  {
    "commentText": "I LIVE IN MEXICO I HATE YOU TRUMP YOU SELFISH PERSON I HATE YOU SO MUCH TRUMP",
    "likes": 0
  },
  {
    "commentText": "grab the pussy grab the pussy",
    "likes": 94
  },
  {
    "commentText": "we are not paying",
    "likes": 0
  },
  {
    "commentText": "Build the wall!!!!",
    "likes": 0
  },
  {
    "commentText": "I want to breed out all the people who think building a wall is a good idea... Did we not learn anything from the Berlin Wall?? It is a hole lot cheaper if we build gun towers along the borders. Then at the same time we create jobs...",
    "likes": 0
  },
  {
    "commentText": "BUILD IT BABY, YEAH",
    "likes": 0
  },
  {
    "commentText": "waste of time and money, ever heard of PLANES.",
    "likes": 0
  },
  {
    "commentText": "You forgot about the planes they can fly over the wall dumbass",
    "likes": 0
  },
  {
    "commentText": "did anyone else think of pink floyd while watching this...",
    "likes": 0
  },
  {
    "commentText": "he's not gonna build no stoopid wall! he's not gonna pay for no stoopid wall! he's not gonna find the time to deport or catch illegals either.",
    "likes": 0
  },
  {
    "commentText": "His BIG MOUTH and EGO will never fit through the front door of the White House! He won't build the wall because he will NOT win the election!",
    "likes": 1
  },
  {
    "commentText": "#Trump 2016",
    "likes": 1
  },
  {
    "commentText": "Do people actually listen to his speeches i mean he is talking to border patrols no other candidate does that and no other candidate has ever had support from them",
    "likes": 0
  },
  {
    "commentText": "Build that wall!",
    "likes": 5
  },
  {
    "commentText": "Build that wall build that wall this is funny comedy when is it going to stop 😂.",
    "likes": 0
  },
  {
    "commentText": "How is he married to his wife again?",
    "likes": 2
  },
  {
    "commentText": "hell yeah BUILD THAT WALL!!",
    "likes": 2
  },
  {
    "commentText": "Making a wall is stupid first of all your going to make a wall that's like 1000 miles wide have fun with that !!!!",
    "likes": 1
  },
  {
    "commentText": "BUILD THAT WALL",
    "likes": 5
  },
  {
    "commentText": "This is so cringe worthy",
    "likes": 0
  },
  {
    "commentText": "BOO TRUMP,TRUMP SUCK, MEXICO RULES",
    "likes": 0
  },
  {
    "commentText": "BUILD THAT WALL! BUILD THAT WALL!",
    "likes": 5
  },
  {
    "commentText": "2:03 kill them all?",
    "likes": 0
  },
  {
    "commentText": "Mexico: \"LMAO, no\"",
    "likes": 0
  },
  {
    "commentText": "i'm all for Trump and his ideologies, but seriously how is the wall going to be built?and why will Mexico pay for it?",
    "likes": 5
  },
  {
    "commentText": "Of course they endorsed you you dumbass. They want your money",
    "likes": 0
  },
  {
    "commentText": "Adolf trump 2016-2017",
    "likes": 2
  },
  {
    "commentText": "did anyone else catch the fly in his hair at the beginning of the video?",
    "likes": 0
  },
  {
    "commentText": "I want to know if Donald trump has or has ever owned or been associated with geo group stock or employee`s or owners or any other corp like it",
    "likes": 0
  },
  {
    "commentText": "\"BUILD THE WALL BUILD THE WALL BUILD THE WALL BUILD THE WALL\"",
    "likes": 1
  },
  {
    "commentText": "we don't need to build a f***ing wall but we sure was hek shouldn't let Donal trump win president bc he knows nothing about how to run america",
    "likes": 6
  },
  {
    "commentText": "guy on the right of trump looks like tito Ortiz lol",
    "likes": 102
  },
  {
    "commentText": "Build that wall",
    "likes": 0
  },
  {
    "commentText": "Donald trump is like a young child. Likes to build stuff, has a big imagination and doesn't know anything about what adults do",
    "likes": 0
  },
  {
    "commentText": "I thought it was already a border between Mexico and America",
    "likes": 0
  },
  {
    "commentText": "Build the wall!",
    "likes": 12
  },
  {
    "commentText": "Fdt",
    "likes": 0
  },
  {
    "commentText": "Hes crazy",
    "likes": 0
  },
  {
    "commentText": "Up like trump",
    "likes": 0
  },
  {
    "commentText": "all u see in the back its white people lol",
    "likes": 2
  },
  {
    "commentText": "We already have a wall, his Name is G. Ochoa",
    "likes": 0
  },
  {
    "commentText": "2:16 Build that wall!",
    "likes": 0
  },
  {
    "commentText": "1:54 We're gonna build a wall, we have no choice",
    "likes": 1
  },
  {
    "commentText": "1:33 If I turned it off I could do that in 2 seconds. I think people would understand...",
    "likes": 0
  },
  {
    "commentText": "Can we just take everyone in the whole world in the US, kick Donald out, build a wall to keep him out? Instead of kicking like legit half of the US, get more people in the US in the payment of a total ass hole (aka Donald trump)",
    "likes": 0
  },
  {
    "commentText": "nooooo we dont want u donald u suck. 😠😠😠😠😠 get out of this country no one wants u. us mexicans should stay here who ever is mexican dont vote for trump we haft to stay here some of us have familys that live here again u suck booooooooooooo",
    "likes": 0
  },
  {
    "commentText": "No, NOT @ DISNEY'S LAND!!!",
    "likes": 0
  },
  {
    "commentText": "As much as I love the Dons hatred of illegal immigration, I think that at the end of the day, a wall is just a wall. Aliens can still find a way around it. \n\nWe need start seeing the act of illegally crossing the border as an act of aggression against the US and authorize the border patrol to use deadly force against anyone attempting to cross the border.",
    "likes": 0
  },
  {
    "commentText": "trump: my father gave me a small loan of 1 million dollars \n\nme: hol  up a small loan?\n\ntrump: why yes meow meow \n\nme:uhhh thats not small bro\n\ntrump:have this man arrested \n\nme:bruh\n\n\n\nif someone reads this make a video about it and reply saying you did",
    "likes": 0
  },
  {
    "commentText": "The Great Wall of China was also build, who would call them crazy today?",
    "likes": 0
  },
  {
    "commentText": "when did he borrowed  duck mouth.",
    "likes": 0
  },
  {
    "commentText": "I Don't Like Hilary Or Trump. First off My mommy says that trump is a doofus and Hilary lies too much",
    "likes": 3
  },
  {
    "commentText": "Let build a golden walls",
    "likes": 5
  },
  {
    "commentText": "C'mon guys... Bush, Jr. couldn't build 700 miles of chainlink fence with $6 billion.  Your wall is a fantasy.",
    "likes": 2
  },
  {
    "commentText": "If we're going to need a wall for anything, it should be between Trump and the White House.",
    "likes": 0
  },
  {
    "commentText": "Don't send Sin Cara back",
    "likes": 0
  },
  {
    "commentText": "And snipers.",
    "likes": 0
  },
  {
    "commentText": "Build a wall with chain guns and land mine bombs and a tank.",
    "likes": 0
  },
  {
    "commentText": "If Trump is elected, Canada will build a wall and make the US pay for it.",
    "likes": 0
  },
  {
    "commentText": "build that wall build that wall! build THAT WALL! BUILD THAT WALL! BUILD THAT WALL!!!!!!!!",
    "likes": 0
  },
  {
    "commentText": "So I legit accidentally clicked on that dislike button.......but I just decided to leave it like it is 😉",
    "likes": 0
  },
  {
    "commentText": "If it works phenomenally well for Israel, it'll work fine for us",
    "likes": 0
  },
  {
    "commentText": "I feel bad for me cause Hillary or trump go be president I witch I can go to south america or Canada.",
    "likes": 0
  },
  {
    "commentText": "Build a wall around trump tower",
    "likes": 56
  },
  {
    "commentText": "build the wall NO MORE RAPISTS AND MURDERERS FROM MEXICO",
    "likes": 1
  },
  {
    "commentText": "watch the f...news let me give you a clue....mmm TUNNELS???",
    "likes": 0
  },
  {
    "commentText": "Bill dar wull? What the hell is Bill dar wull",
    "likes": 0
  },
  {
    "commentText": "TRUMP IS DADDY",
    "likes": 0
  },
  {
    "commentText": "People that r saying BUOLD THAT WALL r racist dicks",
    "likes": 0
  },
  {
    "commentText": "BUILD IT",
    "likes": 0
  },
  {
    "commentText": "Nuremberg.",
    "likes": 0
  },
  {
    "commentText": "Roger Waters would be turning in his grave.... If he were dead :P lol",
    "likes": 2
  },
  {
    "commentText": "Lmao trumps campaign in a nutshell",
    "likes": 4
  },
  {
    "commentText": "I'm Mexican American and I know damn well we need to build that wall",
    "likes": 367
  },
  {
    "commentText": "Imagine if your country becomes so rich that immigrants start coming from all over the world to the extent that they start to outnumber your citizens. People whose true loyalty lies elsewhere will start controlling everything and since democracies is a numbers game, these immigrants will soon takeover the politics and consequently economics of a nation. this is the predicament Americans are facing and I agree with Trump that it has to be stopped. America is not Cuba (I love Cuba) or Mexico or Venezuela or Colombia. America is America and they have the right to protect their identity",
    "likes": 122
  },
  {
    "commentText": "without that wall America will become another Hispanic nation.",
    "likes": 66
  },
  {
    "commentText": "10 feet taller!",
    "likes": 0
  },
  {
    "commentText": "i hate u guys that want to build that wall",
    "likes": 0
  },
  {
    "commentText": "is this copyrigted?",
    "likes": 0
  },
  {
    "commentText": "here's my email address trump@buildawall",
    "likes": 1
  },
  {
    "commentText": "at 0:00 did you see something on his hair? that fly is making babys LIES!!",
    "likes": 0
  },
  {
    "commentText": "Make the illegal Mexicans build the wall",
    "likes": 1
  },
  {
    "commentText": "Oops I MENT DONT BUILD THAT WALL",
    "likes": 0
  },
  {
    "commentText": "DONT THAT WALL",
    "likes": 0
  },
  {
    "commentText": "his idea his money",
    "likes": 2
  },
  {
    "commentText": "racist",
    "likes": 0
  },
  {
    "commentText": "Also THUMBS Down for this vid",
    "likes": 0
  },
  {
    "commentText": "don't vote trump or you Will be wished DEAD my birthday is July 17 I am 10",
    "likes": 0
  },
  {
    "commentText": "is that tito ortiz in the background",
    "likes": 0
  },
  {
    "commentText": "build the wall",
    "likes": 0
  },
  {
    "commentText": "What if aliens sent the atomic blob Mr. Trump?",
    "likes": 0
  },
  {
    "commentText": "BUILD THAT WALL!!!",
    "likes": 0
  },
  {
    "commentText": "Of course we need a wall, the fence we have now has holes in it, and doesn't exist in many places, sure we need a better wall - a big one. Of course, why is this even in question.",
    "likes": 0
  },
  {
    "commentText": "doneld poop",
    "likes": 0
  },
  {
    "commentText": "if you notice he says that the border patrol said that THEY were \"told\" to standby and do nothing let em come in.....let that sink in for a sec. so if that is true then doesnt that mean that building the wall will do any effect at all? bc basically he just said that the managers told them to do nothing and let em come in. so in order to make a diff. they need something about staff and go strict on the border the wall has nothing ro do with the border. but even if you did build a damn wall, we are human beings we will find a way to go over or under or through it >:)",
    "likes": 0
  },
  {
    "commentText": "ну чисто Жириновский гримированный",
    "likes": 0
  },
  {
    "commentText": "Where's Ronald Reagan when you need him...",
    "likes": 0
  },
  {
    "commentText": "That Crazy Idea! If he do! I will Destroy The Wall! WE GONNA DESTROY THE WALL IF HE DO! Who Agree!",
    "likes": 0
  },
  {
    "commentText": "The wall is already done. It was recorded in 1979 by Pink Floyd.",
    "likes": 0
  },
  {
    "commentText": "WE ARE GOING TO BULID THAT WALL WEATHER YOU LIKE IT OR NOT!!!!",
    "likes": 0
  },
  {
    "commentText": "build it!",
    "likes": 2
  },
  {
    "commentText": "Build the whaaaaaaaaaaaaaat?!",
    "likes": 0
  },
  {
    "commentText": "#BUILDTHATWALL",
    "likes": 3
  },
  {
    "commentText": "look at tito ortiz in the backround.. lol.. when he used to walk into the octagon with the Mexican flag.. sell out m.f.",
    "likes": 0
  },
  {
    "commentText": "Build a LASER TOWER. It is more effective and can be remotely controlled.",
    "likes": 0
  },
  {
    "commentText": "Lmfao at this jack ass haha XD",
    "likes": 2
  },
  {
    "commentText": "lol he does have small hands",
    "likes": 0
  },
  {
    "commentText": "dat creepy guy in the suit in the back round doe",
    "likes": 0
  },
  {
    "commentText": "cet homme est malade",
    "likes": 0
  },
  {
    "commentText": "Trump Trump Trump Trump",
    "likes": 0
  },
  {
    "commentText": "He is so dumb that his name should be \"donald 'dumb' dumber\"\nIf he becomes president he doesn't have to build a wall !!... because nobody (not even Mexicans) want to go to the USA anymore and he will put the USA in the biggest recession ever.\nI hope that before November somebody has the guts and puts a needle in this BIG BALLOON of HOT AIR called \"Donald Trump\"",
    "likes": 0
  },
  {
    "commentText": "BUILD THAT WALL ... BUILD THAT WALL ... BUILD THAT WALL\n\nAND KEEP DONALD TRUMP OUT :)",
    "likes": 0
  },
  {
    "commentText": "So Donald I'm just wondering what is the estimated price and what is the walls estimated time frame no no no Donald you Neanderthal not when it will be finished or cash price but how long Will it last and how will it stunt the humans Rights and equality progress",
    "likes": 0
  },
  {
    "commentText": "1989 U.S to Russia \"Tear down that wall\"!! 2016 U.S. \"build a wall\"!, \"build a wall\"!",
    "likes": 0
  },
  {
    "commentText": "So build a wall put fire on it, barbwire what ever you think is going to stop us, but no mater what you put we are MEXICANS and we will always, always find a way around it.",
    "likes": 0
  },
  {
    "commentText": "Let's build a wall around the wall and have the wall pay for it. INCEPTION.",
    "likes": 0
  },
  {
    "commentText": "Hispanics for TRUMP!!! Build that WALL!!!",
    "likes": 22
  },
  {
    "commentText": "That wall is way too high you need to cut it",
    "likes": 0
  },
  {
    "commentText": "Trump: We need to build a wall.\nAttack on titan first opening start.",
    "likes": 3
  },
  {
    "commentText": "this guy is cray cray . u.s. needs mexico as an allie at all time. why? russia , china, iran north korea want to see this country defeated. having us as enemies is a bad choice. the russians will have military bases all over the border. mexico will cut the oil trade with this country. \ni hear many comments about Mexico and bringing drugs. the real question is who consumes them?  superbowl games be filled with drugs behind that 📺",
    "likes": 0
  },
  {
    "commentText": "10 FEET HIGHER!!",
    "likes": 436
  },
  {
    "commentText": "Build that wall!! Or we will start fixing the border our way,,,,  and the gov will fear the people again, , like they should \nIts not the govs country \" it's ours!!",
    "likes": 0
  },
  {
    "commentText": "#fucktrump2016",
    "likes": 1
  },
  {
    "commentText": "does one of you watch AOT? one way to destroy trumps wall: call back titans",
    "likes": 3
  },
  {
    "commentText": "the Mexicans want that wall so Donald Trump wouldn't visit them",
    "likes": 0
  },
  {
    "commentText": "A bunch of idiots and their leader!",
    "likes": 3
  },
  {
    "commentText": "*plays aot theme",
    "likes": 0
  },
  {
    "commentText": "Donald trump taking a bout build a wall he do not want Mexicans people in United States Donald you a dumb ass after Mexicans people knock down wall u have people build that wall come to kill you and family's to",
    "likes": 0
  },
  {
    "commentText": "\"Do not be hard on the man from a strange country who is living among you; for you have had experience of the feelings of one who is far from the land of his birth, because you yourselves were living in Egypt, in a strange land.\"\n\nEXODUS 23:9",
    "likes": 0
  },
  {
    "commentText": "Build that wall baby! Make Mexico pay for it and take its stuff by force if they don't. Manifest Destiny 2.0!",
    "likes": 0
  },
  {
    "commentText": "Build that wall to keep whom out exactly? The Mexicans? What Mexicans? Net Immigration from Mexico has been 0 for the past 6 years or more. For years Mexicans have been fleeing our country, not sneaking in, lmao.",
    "likes": 0
  },
  {
    "commentText": "On behalf of my other fellow canadians and the rest of the world: what a retarded looking like bunch.",
    "likes": 6
  },
  {
    "commentText": "Sheriff Joe also knows about corruption, hopefully he'll also know what it's like to be locked in one of those cells. He's in court today, to see just that. And if Trump is trusting the grand standing Sheriff Joe for advice, he's asking the wrong person. Sheriff Joe is just using the border as an excuse for more money in his funding. More money to be unaccounted for like so much of the money he's received in funding over the years.",
    "likes": 0
  },
  {
    "commentText": "How Trump will start WW3\n\n1. Trump will force MX to pay for the wall\n2. MX Will refuse\n3. Trump as an idiot will attack (my hyposethis)\n4. Russia will aid Mx, and attack back. Mx will help russia\n\netc. Stupid idea iknow",
    "likes": 1
  },
  {
    "commentText": "All you are building is hate hate hate!",
    "likes": 4
  },
  {
    "commentText": "AND WHOS GONNA PAY FOR IT",
    "likes": 11
  },
  {
    "commentText": "Build that wall so Donald trump cannot come to America",
    "likes": 30
  },
  {
    "commentText": "If you build it, they won't come...",
    "likes": 2
  },
  {
    "commentText": "BUILD THAT WALL!!!",
    "likes": 15
  },
  {
    "commentText": "Maybe Tito Ortiz does have a cracked skull after all!!",
    "likes": 2
  },
  {
    "commentText": "do not build the wall",
    "likes": 7
  },
  {
    "commentText": "the Indians should have built a wall",
    "likes": 2
  },
  {
    "commentText": "BUILD THAT GODDAMNED WALL DONALD",
    "likes": 14
  },
  {
    "commentText": "Go back to the Dump where you were born Trump",
    "likes": 10
  },
  {
    "commentText": "BUILD THE WALL",
    "likes": 63
  }
]