[
  {
    "commentText": "Turning the white house into a def comedy jam session.",
    "likes": 0
  },
  {
    "commentText": "Wait a minute, so celebrities such as Gene Simmons,  Stacey Dash,  Kanye West,  Scott Baio,  Jon Voight, Ted Nugent, Dean Cain, Kid Rock,  Loretta Lynn, Jesse James, Stephen Baldwin, Gary Busey,  Lou Ferrigno, Hulk Hogan, etc...can voice their opinion & endorse Donald Trump, but now it's a problem when Taylor Swift voices her opinion & states who she wants to endorse?!?!?!?! GTFOH",
    "likes": 0
  },
  {
    "commentText": "Swifties unite",
    "likes": 0
  },
  {
    "commentText": "I think she was paid off",
    "likes": 0
  },
  {
    "commentText": "The American Music Awards ratings were down by 25% the following day.   hahaha",
    "likes": 0
  },
  {
    "commentText": "NOW we know. taylor swift will go the way of miley cyrus,woopie and the hoes of libtardism",
    "likes": 0
  },
  {
    "commentText": "He belittled her like a pro. Savage move by the president. Taylor Swift will now be looked upon like a 13 year old girl.",
    "likes": 0
  },
  {
    "commentText": "That’s 100 present more then I do now!!!!!!!!!!!!!!!!!!!!",
    "likes": 1
  },
  {
    "commentText": "Boooooooo!!!I voted for Donald Trump.I can't believe what he said about Taylor Swift's music.Well I'M  no longer a fan of Donald Trump.",
    "likes": 0
  },
  {
    "commentText": "That look and smile he gives when the reporter tells him she's getting into politics is priceless. Genius.",
    "likes": 0
  },
  {
    "commentText": "Trump is Savage  😂😂🤣",
    "likes": 1
  },
  {
    "commentText": "Lost RESPECT for Taylor Swift.... INNOCENT UNTIL PROVEN GUILTY!!!!",
    "likes": 0
  },
  {
    "commentText": "Ahhhh.  Taylor hurt Donald's feelings again.   Get a spine you insecure little girl.",
    "likes": 0
  },
  {
    "commentText": "There’s gonna be a 25 % less song coming out soon 🤣",
    "likes": 0
  },
  {
    "commentText": "I love how trump always answer the reporters what comes in his mind just so they get of his face 😂i would do that tbh",
    "likes": 0
  },
  {
    "commentText": "Trump king of insults. He is going to hell.",
    "likes": 0
  },
  {
    "commentText": "He's awesome !",
    "likes": 1
  },
  {
    "commentText": "Lets be honest, Taylor's music sucks. The only song I like of hers was written by someone else. Her looks, like the young Britney Spears, is why people put up with her. That's the cold hard truth.",
    "likes": 0
  },
  {
    "commentText": "He’s being really generous xD just 25% less? Wow haha \n\nTbh she’s always bugged me. But she’s managed to make me dislike her even more. She’s so unbelievably ignorant.... she really did no research.",
    "likes": 0
  },
  {
    "commentText": "Lol   \n25% ... same as his approval rating",
    "likes": 0
  },
  {
    "commentText": "Who gives  a crap what Taylor Swift says anyway?.  These dumbass celebs think because people know who they are that their opinion matters.  It doesn't.  If what they thought actually meant anything Hillary would be President and we would all be screwed.",
    "likes": 0
  },
  {
    "commentText": "look at that sneaky smile as he decides to respond",
    "likes": 0
  },
  {
    "commentText": "I like Trump's leadership 100% as much as I did last year - not a bit!",
    "likes": 0
  },
  {
    "commentText": "Celebrities opening their mouths generally only confirms their ignorance, as was the case this time as well, the left always puts out bills with names which sound good, but are anything but, no different than how they claim \"feminism is just how equality\", and Tay fell for it, hook line and sinker.",
    "likes": 0
  },
  {
    "commentText": "XD",
    "likes": 0
  },
  {
    "commentText": "Who is Taylor Swift?",
    "likes": 0
  },
  {
    "commentText": "She was never country, and she has little talent beyond that.",
    "likes": 0
  },
  {
    "commentText": "I still wouldn't kick tay out of bed",
    "likes": 0
  },
  {
    "commentText": "\"Nobody can think differently than I do\" - every American these days.",
    "likes": 0
  },
  {
    "commentText": "Taylor Swift doesn't lie. trump does. trumps the most dishonest president America has ever had. it's shameful and embarrassing. anybody that believes that trump is honest please go get some counsling. you need help. now lets get this lying ass wipe of a president impeached and MAPA-Make America Proud Again!!!",
    "likes": 0
  },
  {
    "commentText": "I think I like Trump 25% more 😁",
    "likes": 0
  },
  {
    "commentText": "I love how he just doesn’t care and tells it how it is!",
    "likes": 0
  },
  {
    "commentText": "Trump spitting up some bars",
    "likes": 0
  },
  {
    "commentText": "So when Kanye endorses Trump the MAGA Maggots applaud him, but when any celebrity goes against Trump the MAGA Maggots attack them? MAGA MAGGOTS are so confusing",
    "likes": 0
  },
  {
    "commentText": "😂😂😂 Brilliant!!",
    "likes": 0
  },
  {
    "commentText": "I bloody love President Trump. I wish we had a leader like him here on Brexit Island.",
    "likes": 0
  },
  {
    "commentText": "Dumbass, orange, moron, sociopathic, nasty-assed, punk mothafucka.",
    "likes": 0
  },
  {
    "commentText": "So -25% now?",
    "likes": 0
  },
  {
    "commentText": "OMG she’s sooo brave - typical chick...",
    "likes": 0
  },
  {
    "commentText": "That’s ok because the majority of the world like you 100% less now.",
    "likes": 0
  },
  {
    "commentText": "lmfao he’s a joke",
    "likes": 0
  },
  {
    "commentText": "I don't like Taylor Swift at all now and I hope she dies. If she wants to talk about systematic racism, why don't she talk about the racism she experienced when that negro snatched the microphone away from her when she won the best album of the year award just bc he didn't want a white person to win.",
    "likes": 0
  },
  {
    "commentText": "Taylor Swift sucks big time anyway...literally",
    "likes": 0
  },
  {
    "commentText": "He's an idiot",
    "likes": 0
  },
  {
    "commentText": "What a Dumbass",
    "likes": 0
  },
  {
    "commentText": "I  don't  like  her music at all...100% less.",
    "likes": 0
  },
  {
    "commentText": "Taylor Swift is liberal Hollywood trash!",
    "likes": 0
  },
  {
    "commentText": "0:03 ohh trump smells the drama & then that smirk! Haha gotta love this guy!! He is the only true savage of the internet.",
    "likes": 3
  },
  {
    "commentText": "President Trump is a breath of fresh air. You’ve got to love him.",
    "likes": 0
  },
  {
    "commentText": "You're nicer than me. But actually I never was a fan of hers. So no loss for me or our votes.",
    "likes": 0
  },
  {
    "commentText": "Look what you made trump do ...😂",
    "likes": 0
  },
  {
    "commentText": "Gangstaaaaaa!!!!!",
    "likes": 0
  },
  {
    "commentText": "Ouch burn!",
    "likes": 0
  },
  {
    "commentText": "boycott taylor swift🇺🇸🇺🇸🇺🇸",
    "likes": 0
  },
  {
    "commentText": "I liked it less when she went poptry on me now I like it less than less so 50% 😂",
    "likes": 0
  },
  {
    "commentText": "taylor swift dude looks like a dude. Sick looking she/male invert. NEWS FLASH PEOPLE REAL WOMEN HAVE CURVES.",
    "likes": 0
  },
  {
    "commentText": "These celebrities never learn. Never inject yourself into politics.",
    "likes": 0
  },
  {
    "commentText": "I like it 100% less. Always have. Its nothing but mediocre pop garbage.",
    "likes": 1
  },
  {
    "commentText": "If I don't know who she is, neither does he. God's gift to liar",
    "likes": 0
  },
  {
    "commentText": "Who cares what dump thinks",
    "likes": 0
  },
  {
    "commentText": "Boycott everything Taylor swift if she's against the progress trump is making , gold blooded for life",
    "likes": 0
  },
  {
    "commentText": "Nobody will remember or listen to Taylor Swift's insipid  crappy \"music\" in 20 years.",
    "likes": 0
  },
  {
    "commentText": "He talks like shxt",
    "likes": 0
  },
  {
    "commentText": "Torrent Taylor and show her support",
    "likes": 0
  },
  {
    "commentText": "Shake it off, Donald.",
    "likes": 0
  },
  {
    "commentText": "Heh, never liked her music to begin with.",
    "likes": 0
  },
  {
    "commentText": "Who’s Taylor Swift?",
    "likes": 0
  },
  {
    "commentText": "I never liked her or her music to begin with. Add her along with the other retards like gaga, perry and Miley Virus. We'll of course have to come up with a nickname for her too. Taylor Stiff? Taylor miffed? Idk.",
    "likes": 0
  },
  {
    "commentText": "Enraged Trump mercilessly attacks Taylor Swift",
    "likes": 1
  },
  {
    "commentText": "MAGA Winning 👍😃🇺🇸😎🤠",
    "likes": 0
  },
  {
    "commentText": "Мой президент!",
    "likes": 0
  },
  {
    "commentText": "I'm not gonna lie, I like Taylor Swift, but after her tweet... I feel like I like her about 25% less",
    "likes": 1
  },
  {
    "commentText": "TRUMP COME TO EUROPE RIGHT NOW!!!\nWE ARE BEING INVADED!!!",
    "likes": 2
  },
  {
    "commentText": "Bahahahahaha 😂 SLAMMER , HOW LONG BEFORE SWIFT HITS THE GROUND LIKE A SAFE ! MILLIONS OF AMERICANS ARE WIDE AWAKE 🇺🇸 AND UNITED BEHIND PRESIDENT TRUMP",
    "likes": 0
  },
  {
    "commentText": "Love how the leftist media think average people give a f about Taylor Swift’s political opinions",
    "likes": 0
  },
  {
    "commentText": "More like 50% less 🇺🇸KAG🇺🇸",
    "likes": 0
  },
  {
    "commentText": "That was swift",
    "likes": 0
  },
  {
    "commentText": "Now that I have actually seen what Trump said, man does the lame stream media lie.  At the gym all I kept seeing from every TV was a chiron that read \"Trump BLASTS Swift\" ... looks to me like he was laughlingly saying it.  I didn't see a blast there.",
    "likes": 0
  },
  {
    "commentText": "Traylor sucks off demons ever since she crossed over. Suicide train is a comin with one prepaid ticket 😁",
    "likes": 0
  },
  {
    "commentText": "Taylor Swift is very knowledgeable of Marsha Blackburn's voting record.  She enumerated the bills where they disagree.  So Trump is once again spouting nonsense.",
    "likes": 0
  },
  {
    "commentText": "Taylor swift is an idiot.",
    "likes": 1
  },
  {
    "commentText": "Songs lyrics in this century often make no sense.",
    "likes": 0
  },
  {
    "commentText": "You can't trust anybody from Hollywood! They all nasty pedo snakes!",
    "likes": 0
  },
  {
    "commentText": "I like Nat King Cole.",
    "likes": 0
  },
  {
    "commentText": "Millennial stars are extremely short live compare to the last century from 1920's to 1980's.",
    "likes": 1
  },
  {
    "commentText": "Its obvious for T.S coz anyone who are fed up of their fame and power and wants to give it up, all they have to do is upset the President😉😉😉",
    "likes": 0
  },
  {
    "commentText": "Gotta love that grin.",
    "likes": 0
  },
  {
    "commentText": "Of course she’s liberal right, because she just had to be, because she couldn’t break the trend and shed some new light on this political topic but no. Nope, she’s just like the rest. Why even be surprised? It’s safe to assume all celebrities are uneducated liberal nut jobs.",
    "likes": 0
  },
  {
    "commentText": "The good thing about older people is we don’t care if we hurt your feeling. we don’t hold back our words to be popular. We speak the truth while cry babies run to the corner.( the left can’t handle the truth) they rather you tell a lie.because they traded the truth for a lie.",
    "likes": 0
  },
  {
    "commentText": "Send her to California (Where she belongs). Why does she feel the need to announce to the world that she has a mental disorder?",
    "likes": 1
  },
  {
    "commentText": "LOL! I would have said, \"Taylor WHO??\" More perfect answer (sorry Titan12).",
    "likes": 0
  },
  {
    "commentText": "Regardless of who you support PLEASE VOTE if you’re not sure how to get registered, check the recent vid on my channel. Please make your voice heard :)",
    "likes": 0
  },
  {
    "commentText": "Patriots want Trump put in a cage where he belongs",
    "likes": 0
  },
  {
    "commentText": "Trump is so smart. I know because he said so. Smart people tell you they are smart. Thats how you know☺",
    "likes": 0
  },
  {
    "commentText": "Trump will just Shake it off Shake it off !",
    "likes": 0
  },
  {
    "commentText": "Thank you God for a wonderful president",
    "likes": 0
  },
  {
    "commentText": "**REGARDLESS  OF HOW IGNORANT , A PAID RUSSIAN PUPPET THAT IS NOT A JOURNALIST. FOX ENTERTAINMENT WILL NEVER  SEE THE DAY THAT THE US MILITARY WILL ATTACK DEMOCRATS. RUSSIA WILL NOT GET IT'S WAY IN PROMOTING A CIVIL WAR IN AMERICA. WE ARE ALL EQUAL AMERICANS AS MUCH AS YOU RUSSIAN PUPPETS WANT A CIVIL WAR IT WILL NEVER HAPPEN IN AMERICA**",
    "likes": 1
  },
  {
    "commentText": "TAYLOR> 100% SKINY UGLY HOOLYWOOD  WOMAN LIB WHORE",
    "likes": 0
  },
  {
    "commentText": "President Trump you I have respect for you but sometimes you just need to let some things go",
    "likes": 0
  },
  {
    "commentText": "never thought this guy would win. never thought i would enjoy him being president so much. the internet has changed everything.",
    "likes": 0
  },
  {
    "commentText": "Lol",
    "likes": 0
  },
  {
    "commentText": "Agree with GEOTUS 100% 👌🇺🇸💖",
    "likes": 0
  },
  {
    "commentText": "Unfortunately for Taylor the American people like her music about 25% less now too.\nGo ask the Negro Felon League about that.",
    "likes": 0
  },
  {
    "commentText": "Time to go Taylor Swifting again. :)",
    "likes": 0
  },
  {
    "commentText": "I personally don't care trump's opinion. And it's Taylor's opinion about Blackburn. Let me finish, she didn't tell her fans to not vote her. She just told them to educate themselves about it.",
    "likes": 0
  },
  {
    "commentText": "Ha GAY, he liked taylor swift music hahahaha",
    "likes": 0
  },
  {
    "commentText": "The more stupid celebrities join the demagogues on the Left the better. The Milanos and LaBeouf's of the left make them look all the more stupid.",
    "likes": 0
  },
  {
    "commentText": "One day Kanye and Taylor will run against each other for President. I'm voting Kanye.",
    "likes": 0
  },
  {
    "commentText": "And Trump's popularity with Taylor's fanbase just dropped by 25%.\nSomeone really needs to teach Trump a little basic math.",
    "likes": 0
  },
  {
    "commentText": "Remember\nRemember\nThe 6th of\nNovember !\nMAGA!",
    "likes": 0
  },
  {
    "commentText": "Donald has ADHD. Taylor should put a pumpkin in a garbage bag in yard",
    "likes": 0
  },
  {
    "commentText": "Thankfully some Repubs cannot stomach Trumps lies and immorality and lack of family values and his war cowardice. Decent Repubs can't wait to see the back if this disgusting unAmercan creature.",
    "likes": 0
  },
  {
    "commentText": "I LOVE TAYLOR SWIFT!!!",
    "likes": 0
  },
  {
    "commentText": "I like The Donald 25% more...",
    "likes": 0
  },
  {
    "commentText": "...that alpha swagger",
    "likes": 0
  },
  {
    "commentText": "Another brain less twit she should  stay out of politics and stay in her made up world",
    "likes": 0
  },
  {
    "commentText": "Why in the Hell does Taylor Swift political views mean anything? What next ? Is the press going to ask Justin Bieber what he thinks? If it was not so pathetic and stupid for a newsperson to ask this It is funny to watch Donald Trump's humerous response.",
    "likes": 0
  },
  {
    "commentText": "Trump is a clown",
    "likes": 1
  },
  {
    "commentText": "Swift finally caved to the leftist mob... 👽💀",
    "likes": 0
  },
  {
    "commentText": "I still dislike you and Taylor Swift 100%.",
    "likes": 0
  },
  {
    "commentText": "I Knew You Were Trump.",
    "likes": 0
  },
  {
    "commentText": "To the Histrionics…(1) Gay Disease is not Fun!...(2) Disease is not love!...(3) [To be Free] of [Disease & Gay Histrionics] is [Choice].  All for [Choice & Freedom] from Disease (fear & wantoness). Gay is not beautiful. It's anal abuse & perversion. It's \"Artifice\" as well!  All for [Common Sense & Dignity].  Stick with Trump!",
    "likes": 1
  },
  {
    "commentText": "Republicans are idiots.",
    "likes": 0
  },
  {
    "commentText": "THAT IS THE FACE OF A MASTER TROLL LMFAO 0:04",
    "likes": 0
  },
  {
    "commentText": "Never lose your sense of humor Mr. President. We need it now more than ever",
    "likes": 0
  },
  {
    "commentText": "Trump is doing great with the economy,  negotiating with North Korea, and still as funny as he was during the primaries. 9/10 president would vote again.",
    "likes": 0
  },
  {
    "commentText": "Legend",
    "likes": 0
  },
  {
    "commentText": "Another stupid celeb she is",
    "likes": 0
  },
  {
    "commentText": "Love how if a celebrity comes out as Republican you think that's great,but if not you tell them to shut up.can't have it both ways.",
    "likes": 0
  },
  {
    "commentText": "Taylor swift get woke go broke.",
    "likes": 0
  },
  {
    "commentText": "If Taylor swift endorsed Trump, you'd all say how \"woke\" she is.",
    "likes": 0
  },
  {
    "commentText": "I like  trump 125% less 😀😁😂😀😁😂",
    "likes": 0
  },
  {
    "commentText": "ahahahahaha..............this is like when he said that \"the wall just got 10 feet taller\" hahaha",
    "likes": 0
  },
  {
    "commentText": "Looks like Trump just shook it off.",
    "likes": 0
  },
  {
    "commentText": "All of these comments like, \"Haha how can you not love Trump!\"\n\nEvery single person that commented that is 10,000,000% WHITE \nI'm black. So if you're white and hate blacks.. don't speak to me tysm!\n\n\nOof",
    "likes": 0
  },
  {
    "commentText": "Trump and his cult are like the weirdest and most embarrassing group of people on this planet. They cant handle any criticism and lack any self awareness of their own hypocrisy.",
    "likes": 0
  },
  {
    "commentText": "tay tay has 25% more labia than a normal vag",
    "likes": 0
  },
  {
    "commentText": "Taylor who? What branch did she/he serve? 😉",
    "likes": 0
  },
  {
    "commentText": "That’s not at all what she said. She said, “vote for whoever you want based on your values”. I don’t know why this reporter twisted her words.",
    "likes": 0
  },
  {
    "commentText": "45 is such a dumbass..",
    "likes": 0
  },
  {
    "commentText": "Yall still got Roseanne tho! 😆",
    "likes": 0
  },
  {
    "commentText": "😂😂😂😂😂😂  GOAT",
    "likes": 0
  },
  {
    "commentText": "😂",
    "likes": 0
  },
  {
    "commentText": "I wasn’t a Swift fan, but I am now!",
    "likes": 1
  },
  {
    "commentText": "Kanye will just have to say a short sentence and Swift will melt.",
    "likes": 0
  },
  {
    "commentText": "TAYLOR WHO.?",
    "likes": 0
  },
  {
    "commentText": "Taylor Swift.... Are you kidding me.... Lmao... She cant keep her legs together long enough to even make a campaign commercial....",
    "likes": 0
  },
  {
    "commentText": "Unlike Trump, Taylor Swift is self-made. She didn’t need a $400 Million dollar loan from her parents to be where she is at today. \n\n\nP.s I would pay to see Taylor and Ivanka duke it out...",
    "likes": 7
  },
  {
    "commentText": "Apparently she likes you even less.",
    "likes": 0
  },
  {
    "commentText": "Can anyone recall the celebrity nut jobs that said they were going to move out of the country.",
    "likes": 0
  },
  {
    "commentText": "Trumpet!!! You're still a loser.",
    "likes": 0
  },
  {
    "commentText": "Do you remember what happened to the Dixie Chicks when they denounced our troops in the Middle East?  The fans turned their backs on them and they lost a lot of fan support that translated to empty seats at concerts.  Music managers could not understand why they spoke out as anti military to a patriotic crowd.",
    "likes": 0
  },
  {
    "commentText": "Well there went our Aryan Goddess.",
    "likes": 0
  },
  {
    "commentText": "Look what you made him do\nLook what you made him do\nLook what you made him do\nSwift that joke is all on you",
    "likes": 0
  },
  {
    "commentText": "What about the Dixie Chicks?",
    "likes": 1
  },
  {
    "commentText": "Nahhh... I dnt like her music anymore after her 1st album. She’s trying hard 2 b relevant by collaborating w/ other artists but failed n now in politics.",
    "likes": 1
  },
  {
    "commentText": "No shits given",
    "likes": 0
  },
  {
    "commentText": "25% is he talking about his approval rating",
    "likes": 0
  },
  {
    "commentText": "She does not even live in Tennessee anymore. How can she vote here?",
    "likes": 1
  },
  {
    "commentText": "She is just a another Liberal.",
    "likes": 1
  },
  {
    "commentText": "Who listens to that garbage in the first place !? Lol 😝",
    "likes": 0
  },
  {
    "commentText": "Pretty nice, he's not saying it sucks or anything lol.",
    "likes": 0
  },
  {
    "commentText": "I find Taylor Swift to be very strange. Something about her seems extremely fake. I never listen to her music.",
    "likes": 0
  },
  {
    "commentText": "The best answer ever mr president.  I am adding her to growing list of  Celebrities that I refuse to listen to their music or watch their movies or  Shows.",
    "likes": 0
  },
  {
    "commentText": "My president's quick-witted response makes me love him even more.",
    "likes": 0
  },
  {
    "commentText": "Watch out for the Trump curse, Taylor.",
    "likes": 0
  },
  {
    "commentText": "Just talked to chief. He said y’all ain’t it.",
    "likes": 1
  },
  {
    "commentText": "That would make it -25%. Perfect.",
    "likes": 0
  },
  {
    "commentText": "What a sorry excuse for a “leader”",
    "likes": 1
  },
  {
    "commentText": "AND I.M SURE SHE GIVES A S,,,,      LOL",
    "likes": 0
  },
  {
    "commentText": "I love this man",
    "likes": 0
  },
  {
    "commentText": "Taylor Swift is another Celeb believes going against Republicans increase her fame and her music sells.  Well I'm willing to bet that over half of Taylor fans are republicans or conservative leaning. It will be interesting to see where her career goes from here.",
    "likes": 0
  },
  {
    "commentText": "Shots fired",
    "likes": 0
  },
  {
    "commentText": "HAHA I LOVE OUR PRESIDENT.   Some how I can't picture President Trump listening to Taylor Swift.",
    "likes": 0
  },
  {
    "commentText": "Taylor Swift and her thirty one million swifties say suck it Trump you pathological liar 🤥.  We are just shaking off your lies right now but  remember revenge is a dish best served cold.",
    "likes": 0
  },
  {
    "commentText": "Taylor Swift and her thirty one million swifties say suck it Trump you pathological liar 🤥.  We are just shaking off your lies right now but  remember revenge is a dish best served cold.",
    "likes": 2
  },
  {
    "commentText": "lol this is hilarious i love Donald trump",
    "likes": 0
  },
  {
    "commentText": "Swift Speeds Swiftly South of the Swamp... by 25%!",
    "likes": 0
  },
  {
    "commentText": "I'm a Republican and I still like Taylor, She's America's sweet heart and she donates a lot of money to charity, I wish all democrats were like her. I would vote for her to be the President.",
    "likes": 1
  },
  {
    "commentText": "Lol this man !",
    "likes": 0
  },
  {
    "commentText": "What an absurd question but an awesome answer. Bet the soy boy hack who asked it wasn't expecting that answer.",
    "likes": 1
  },
  {
    "commentText": "Taylor Swift didnt tell anyone who they should vote for. She simply stated who she would be voting for personally. Then she said that people should just go vote, right or left. Just vote. That is literally all she said.",
    "likes": 6
  },
  {
    "commentText": "Welcome to Great America of corruption and apathy  where thugs rule and the elite and privilege buy and sell laws and regulations and justice has a price. My Fellow Americans VOTE VOTE VOTE",
    "likes": 0
  },
  {
    "commentText": "lol \ni dont think i have even ever heard one of her songs. But i like her. (Wink,wink)\n  \n\nSorry bout any harassment associated with this post  : P",
    "likes": 0
  },
  {
    "commentText": "The President is up on everything. He even makes time to tweet his supporters . He actually answers tweets.",
    "likes": 0
  },
  {
    "commentText": "Lmao I love my President",
    "likes": 0
  },
  {
    "commentText": "The leader of the morons....  how is your social security doing?   what about that tax cut, you must be rolling in the money.  how is the national debt doing​,....going up or down?   IDIOTS",
    "likes": 1
  },
  {
    "commentText": "Love Taylor Swift! Maybe 5% less...lol As long as she maintains decent behavior and doesn't act all bat sht crazy...then..🍃\n\"To each his own!\"",
    "likes": 0
  },
  {
    "commentText": "Trumpster,  NO ONE asked you dont you have a job to do",
    "likes": 0
  },
  {
    "commentText": "I like her music zero now. Thats the way I roll. TRUMP!",
    "likes": 0
  },
  {
    "commentText": "Good response. Trump didn't go too hard on little Taytay for trying to be a bad girl.",
    "likes": 0
  },
  {
    "commentText": "Right?! I like Taylor Swift less now too... still like her though.",
    "likes": 0
  },
  {
    "commentText": "I like Taylor Swift's music 💯% less now.",
    "likes": 0
  },
  {
    "commentText": "Traitor swift",
    "likes": 0
  },
  {
    "commentText": "Hahahahahahahahahaha",
    "likes": 0
  },
  {
    "commentText": "Does this mean 12 year old girls will be voting democrat?",
    "likes": 0
  },
  {
    "commentText": "I like Trump 25% more.",
    "likes": 2
  },
  {
    "commentText": "Taylor Swifts best days are far beyond her. latest album was complete trash.",
    "likes": 0
  },
  {
    "commentText": "100% don't like stupid ppl. Here comes the Trump curse on her. Ha ha ha",
    "likes": 0
  },
  {
    "commentText": "Trump should use Kid Rock music , Never Met a Motherfucker Quite Like Me !!!!!!!",
    "likes": 0
  },
  {
    "commentText": "Haha. Trump Trash crying that Taylor swift rebuked that trash south rune Marsha Blackburn. In case you snowflakes didn't know it,Trump is a pathological liar. You really must have your nose firmly up Trumps colon not to see that.",
    "likes": 1
  },
  {
    "commentText": "Taylor Swift is a tranny. lol",
    "likes": 0
  },
  {
    "commentText": "Taylor Swift is not very swift!",
    "likes": 1
  },
  {
    "commentText": "fragile ego",
    "likes": 0
  },
  {
    "commentText": "He likes her music -425% now\n\n\n\n\n\n\nEdit:a space",
    "likes": 0
  },
  {
    "commentText": "I am NEVER EVER EVER EVER listening to Taylor Swift again. (Never really listened to her anyway... isn't she that white girl who had her spotlight stolen by that crazy black dude?)",
    "likes": 0
  },
  {
    "commentText": "Hahahaha the president of pettiness",
    "likes": 0
  },
  {
    "commentText": "She is known around Nashville as, \"Out of Tune Taylor\".   The word around here is that her rich daddy purchased her career.",
    "likes": 0
  },
  {
    "commentText": "I didn't like her before she ran her stupid hollywood mouth and I like her even less now.",
    "likes": 0
  },
  {
    "commentText": "this was the greatest clip yet, when he gets that look at the start, the side smile to his buddy, like lets do this.  PRICELESS",
    "likes": 0
  },
  {
    "commentText": "Trump is the best.",
    "likes": 1
  },
  {
    "commentText": "I always hated her music 100%",
    "likes": 0
  },
  {
    "commentText": "Thousands of miles away from USA she's don't have the talent that Candace Owen have i love watching Candace when she speaks pure talent",
    "likes": 0
  },
  {
    "commentText": "Lol I love Trump 😅",
    "likes": 0
  },
  {
    "commentText": "Celebrities are Satanists. We don't need them NOW.",
    "likes": 0
  },
  {
    "commentText": "She goes through dudes like i go through draws. She must be a joy to be with.",
    "likes": 0
  },
  {
    "commentText": "Republicans are so triggered they lost their country aryan goddess.",
    "likes": 1
  },
  {
    "commentText": "Taylor Swift hurt herself trying to figure out how to eat a shrimp. I'm not expecting much from her intellectually and I surely wouldn't form my opinions on politics just because they are some random celebrity.",
    "likes": 0
  },
  {
    "commentText": "And just like that...",
    "likes": 0
  },
  {
    "commentText": "Trump listen to Taylor Swift music? WTF!?   Trump stick to listening to Elvis Presley, The Beatles, Rolling Stones, Queen / Freddie Mercury and Michael Jackson songs.",
    "likes": 0
  },
  {
    "commentText": "Lol 😂 I ❤️President Trump",
    "likes": 1
  },
  {
    "commentText": "you should like it more mr. mason she is the illuminati princess of country music....i dont care.....just sayin",
    "likes": 0
  },
  {
    "commentText": "😂",
    "likes": 0
  },
  {
    "commentText": "Be prepared for the backlash",
    "likes": 0
  },
  {
    "commentText": "Lol trump is hilarious sometimes.",
    "likes": 0
  },
  {
    "commentText": "Taylor Swift isn't in politics, she's an idiot and her platform was that Blackburn voted against the Violence Against Women Act; SHE VOTED FOR IT.",
    "likes": 0
  },
  {
    "commentText": "I love President Trump more every day! He is the best! I won't be listening to Taylor Swift anymore!",
    "likes": 0
  },
  {
    "commentText": "He’s such a funny bastard.. you’ve got to love him",
    "likes": 0
  },
  {
    "commentText": "I'm not spending my money on these celeb's ,  so they can campaign for someone I don't want elected .      by Will",
    "likes": 0
  },
  {
    "commentText": "Democrats have even ruined Taylor Swift. Poor girl.",
    "likes": 1
  },
  {
    "commentText": "You know the Democrats are desperate for votes when they have to crack the whip on Taylor Swift, when most of her fans liked her for NOT getting political, and predictably jumping on the leftist bandwagon. But it doesn't really matter, because the American people who support Trump outnumber the fans of any entertainer. Just ask Jay-Z, Beyonce, LeBron James, and any other Hollywood types who shilled for Hillary. ;-)",
    "likes": 0
  },
  {
    "commentText": "Too little, too late, Taylor Slow",
    "likes": 1
  },
  {
    "commentText": "The only individuals who care what Trump thinks are his mob, with their mob mentality. The mob mentality never cares about truths or facts. Who in their right mind would care one iota what Trump thinks about anything?",
    "likes": 0
  },
  {
    "commentText": "Hollywood just shut up please!",
    "likes": 0
  },
  {
    "commentText": "Politics are ugly. Taylor swift have to be aware that her image on stage will be tarnished when she go politics. Stay neutral or support good agendas for country. No hate.",
    "likes": 0
  },
  {
    "commentText": "Now they got Bad Blood.",
    "likes": 0
  },
  {
    "commentText": "Voting for a democrat (Communist Part) says it all, especially how they acted with Kavanaugh.  In a way I hope the Dems win and start their socialistic country, taking Taylor's money to give it to illegal aliens.",
    "likes": 0
  },
  {
    "commentText": "Trump is the man.",
    "likes": 0
  },
  {
    "commentText": "I am not going to spend my money on these celeb's",
    "likes": 0
  },
  {
    "commentText": "Is anyone really surprised. Democrats are pulling out the stops. They believe this will help in the midterms. I believe this will only hurt her reputation.",
    "likes": 0
  },
  {
    "commentText": "Why",
    "likes": 0
  },
  {
    "commentText": "Trump’s sense of humor is so original.",
    "likes": 0
  },
  {
    "commentText": "Who's Taylor Swift??",
    "likes": 0
  },
  {
    "commentText": "Trump is a master at the way he handles this stuff. It’s a bunch of silly nonsense.  Why should he care what Taylor Swift thinks about politics?",
    "likes": 0
  },
  {
    "commentText": "Lol. I love this guy. Go Trump!",
    "likes": 0
  },
  {
    "commentText": "TAY TAY FOR GITMO!!!",
    "likes": 0
  },
  {
    "commentText": "I never liked her and her music.",
    "likes": 0
  },
  {
    "commentText": "Trump doesn't actually care about the average working class  man. Trump lies and uses us for his agenda.",
    "likes": 2
  },
  {
    "commentText": "OH NO, TEENS INFLUENCING ELECTIONS!! HAHA SHAKE IT OFF",
    "likes": 0
  },
  {
    "commentText": "😂😂😂😂😂😂😂",
    "likes": 0
  },
  {
    "commentText": "Trump 2020 baby!!! MAGA",
    "likes": 0
  },
  {
    "commentText": "25%? More like 100%. I never liked her music especially now!!!",
    "likes": 1
  },
  {
    "commentText": "Doesnt taylor swift realize she started in country music, so 99% conservative Christians got her to fame and now shes forgetting about them, ha tipical hypocritical celebrities",
    "likes": 0
  },
  {
    "commentText": "hahaha savage",
    "likes": 0
  },
  {
    "commentText": "Asking Taylor Swift about politics is like asking  Dianne Feinstein  about leaked documents.  💩",
    "likes": 0
  },
  {
    "commentText": "Goodbye, Taylor.",
    "likes": 0
  },
  {
    "commentText": "The word of god flows through trumps mouth. Jesus now hates you Taylor swiftly going to hell for rebuking trumps america and the holy word of jesus. Burn taylor!!!!! Let's see her tax returns!!!",
    "likes": 0
  },
  {
    "commentText": "She is just simple minded entertainment.\nNo one really cares what they think or say.\nJust sing and dance and look pretty for us.",
    "likes": 0
  },
  {
    "commentText": "I used to love Taylor Swift and her music but Taylor Swift is a cult member she's a sick twisted b** I want nothing to do with her or her music Taylor Swift is now going down she messed it up for herself",
    "likes": 0
  },
  {
    "commentText": "Lol Best president ever!!! Good luck Marsha Blackburn!!",
    "likes": 0
  },
  {
    "commentText": "hahaha!!",
    "likes": 0
  },
  {
    "commentText": "Pop music sucks",
    "likes": 0
  },
  {
    "commentText": "Ah.  Trump and those one liners.",
    "likes": 0
  },
  {
    "commentText": "Republicans now like Kanye West more than Taylor Swift.  Who saw that one coming?",
    "likes": 0
  },
  {
    "commentText": "He's such a nice guyy",
    "likes": 0
  },
  {
    "commentText": "Amen to that mr. President",
    "likes": 0
  },
  {
    "commentText": "Taylor (Snowflake ❄️) Swift 👎🏻",
    "likes": 0
  },
  {
    "commentText": "25% less than 0% is still 0%.",
    "likes": 0
  },
  {
    "commentText": "The look on his face omfg hahaha",
    "likes": 1
  },
  {
    "commentText": "😂😁😀",
    "likes": 0
  },
  {
    "commentText": "29 DAYS away! All American citizens,  it is your duty to vote REPUBLICAN Nov 6 2018, where ever you live, call family friends neighbors relatives, drive them to their polls, help them mail ballots in. Schumer & dems threaten America, favor illegal aliens over citizens, globalism over Americanism!  Vote Red VOTE Republican November 6 2018 where ever you live",
    "likes": 1
  },
  {
    "commentText": "Oh no! Like she or anyone else cares what you think!",
    "likes": 0
  },
  {
    "commentText": "She's just a puppet, her strings got pulled to help bring votes.",
    "likes": 0
  },
  {
    "commentText": "The President on Taylor Swifts comments - 💎😎",
    "likes": 0
  },
  {
    "commentText": "No!!! Not another celebrity. Elvis, he handled politics very cleverly. His response was always ( sir I don't feel comfortable putting my views on that for everyone. We are all different and I\"m an entertainer so please let's just stick to that)",
    "likes": 2
  },
  {
    "commentText": "Lol",
    "likes": 0
  },
  {
    "commentText": "I think i like trump 25% less now",
    "likes": 0
  },
  {
    "commentText": "Wow, the difference on how the Right treats Taylor Swift, and how the Left treats Kanye. Keep up the Great job, Mr. President.",
    "likes": 0
  },
  {
    "commentText": "Who's Taylor Swift",
    "likes": 0
  },
  {
    "commentText": "I like TS music 100% less now.",
    "likes": 0
  },
  {
    "commentText": "based and redpilled",
    "likes": 0
  },
  {
    "commentText": "Who’s Taylor Swift? I watch many reputable political commentators but never heard of her....☝🏻🧐",
    "likes": 0
  },
  {
    "commentText": "PLAN PARENTHOOD      WITH      HOLLYWOOD,           CERTAINLY, ARE EQUALING THE            STUPIDITY OF THE FAKE MEDIA!!!",
    "likes": 0
  },
  {
    "commentText": "She's a snake. Always has been, always will be.",
    "likes": 0
  },
  {
    "commentText": "Comedy Gold 👍👍👍🇦🇺😀",
    "likes": 0
  },
  {
    "commentText": "Neamte you are 100% correct!  New study shows the average Republican scores 46% higher on IQ test and 58% higher on S A T scores,     The Democrat leaders went after there own selves,  yes the Democrats are the ones who had and fought to keep slavery, it was republicans who freed the black race yet because they were so appressed and isolated and denied basic education so then the Democrat party decided after loosing the civil war to target the slaves they were forced to free because they knew how ignorant and naive they were and have targeted them ever since.   If Down Syndrome people where not so awesomely filled with joy and the holly spirit they would target them as well for support, but since Down syndrome people are protected through the Holy Spirit the democrats know the can not use them demonically, so instead they target them as young children for satanic rituals and sacrifices.  DEMOCRATS ARE THE ENEMY OF ALL PEOPLE!!!",
    "likes": 4
  },
  {
    "commentText": "This dude lmao",
    "likes": 0
  },
  {
    "commentText": "Baal, her master gave the order and she sinks to the level. One must always pay back what is owed.\n\nShe chose this day who to serve. The devil is a liar and will not have her back ... the temperature is rising Taylor.",
    "likes": 0
  },
  {
    "commentText": "Hahaha",
    "likes": 0
  },
  {
    "commentText": "Unfortunately we now have to Boycott Hollywood Elite Taylor not so Swift.",
    "likes": 0
  },
  {
    "commentText": "Best President!",
    "likes": 3
  },
  {
    "commentText": "Like Kanye, just with a different view.  Wait a minute....didn't they have a feud a few years ago?",
    "likes": 0
  },
  {
    "commentText": "You could see POTUS's eyes light up as soon as he heard Taylor Swift's name … he played a little for effect and then made a pithy comment. Being able to think on your feet is a very useful skill.",
    "likes": 0
  },
  {
    "commentText": "The Music industry hand picks & chooses the bands that will make headline News & earn them the most money. It has nothing to do with real talent & more importantly...\n\nThe people didn't choose the popular bands, they only made a choice out of what was presented to them",
    "likes": 0
  },
  {
    "commentText": "BOSS!",
    "likes": 0
  },
  {
    "commentText": "Is this seriously our president",
    "likes": 7
  },
  {
    "commentText": "It’s amazing how celebrities go out of their way to cut their livelihood in half.",
    "likes": 6
  },
  {
    "commentText": "This time I actually hope he's lying",
    "likes": 0
  },
  {
    "commentText": "I thought that was pretty funny",
    "likes": 0
  },
  {
    "commentText": "BOSS",
    "likes": 0
  },
  {
    "commentText": "125% less for me...\n\nCan't help notice just how  well swift has done under the patriarchy.",
    "likes": 2
  },
  {
    "commentText": "Are you serious Trump her music oils like nails on a chalkboard!",
    "likes": 0
  },
  {
    "commentText": "I love the way he saunters over to ask what she said",
    "likes": 1
  },
  {
    "commentText": "😂😂😂😂 now that's funny!!!",
    "likes": 0
  },
  {
    "commentText": "🤣 that was awesome",
    "likes": 0
  },
  {
    "commentText": "I wonder what the Jews have on her.",
    "likes": 0
  },
  {
    "commentText": "Not like it's been very good recently anyways. Music just doesn't have what it use to be.",
    "likes": 1
  },
  {
    "commentText": "He Trumped her Swiftly",
    "likes": 0
  },
  {
    "commentText": "I love Trump!!!!!!! He always kills it!! 😁🤣",
    "likes": 11
  },
  {
    "commentText": "God bless Trump. MAGA",
    "likes": 8
  },
  {
    "commentText": "The leftist must put a lot of pressure on Taylor to come out and support Dems.  Her young followers will do just that, follow her.  I use to like her because she didn't conform to the crowd, now she is just a liberal sheep.  I hope her career tanks.",
    "likes": 6
  },
  {
    "commentText": "One fourth less seems... generous.",
    "likes": 0
  },
  {
    "commentText": "Never liked Taylor Swift and her evil music anyway. No one care what she had to say. Red Wave. Watch and see",
    "likes": 0
  },
  {
    "commentText": "What the hell is a Taylor Swift?",
    "likes": 0
  },
  {
    "commentText": "I never really liked Taylor Swifts music. Get help, Taylor.",
    "likes": 0
  },
  {
    "commentText": "I don't like it at all",
    "likes": 0
  },
  {
    "commentText": "Me too!!  Taylor Swift should staying music not Politics!  I love my President",
    "likes": 4
  },
  {
    "commentText": "I never liked Taylor Swift singing. She can’t sing and sucks like CNN.",
    "likes": 0
  },
  {
    "commentText": "Taylor who?",
    "likes": 0
  },
  {
    "commentText": "Drumpf is nuts",
    "likes": 5
  },
  {
    "commentText": "Vote back science. Vote out climate change denials.",
    "likes": 6
  },
  {
    "commentText": "Lololol awesome! 😄",
    "likes": 0
  },
  {
    "commentText": "Hahaha good one Mr President 🇺🇸 🇺🇸👍 👍",
    "likes": 0
  },
  {
    "commentText": "Vote out redudlicans. Now!!",
    "likes": 1
  },
  {
    "commentText": "Well when she didn't say anything 2 years ago for the presidential elections, she only posted a picture of her in line for give her vote, I thought man she is a Trump supporter she just dont want to say anything, and all the attacks that were being made by Kim and Katy I was sure it was because of her supporting Republicans, but today all my joy and conclusions alongside with my heart shattered on the ground...I cant listen to her music anymore, maybe she was waiting for a successful album when the sell rates are really high to announce that she is a democrat. I want to fool myself believing she had no choice but to support them, but yea that would be a lie, she really didn't had to do this...now I am really scared that her next album is going to be on politician and politics...maybe she is running out of ideas for the songs...",
    "likes": 1
  },
  {
    "commentText": "That's 25% more then I like her.",
    "likes": 0
  },
  {
    "commentText": "I guess she has made enough,  selling her soul for money.  You just more than half of your fans.",
    "likes": 5
  },
  {
    "commentText": "I'm the president by 3/5 now check mate drump",
    "likes": 1
  },
  {
    "commentText": "Well spoken.",
    "likes": 0
  },
  {
    "commentText": "BASED and REDPILLED",
    "likes": 1
  },
  {
    "commentText": "LMFAO Thus dude is a professional troll, melting snowflakes with the mere drawing of a breath!",
    "likes": 0
  },
  {
    "commentText": "Like a boss 😂👏",
    "likes": 0
  },
  {
    "commentText": "Next video - \"Taylor Swift's album sales drop by 25 percent.\"",
    "likes": 1
  },
  {
    "commentText": "Boss.",
    "likes": 0
  },
  {
    "commentText": "Does taylor not so swifts  opinion  really  matter  to anyone . I have lived my life so far without her music  so i guess i can carry on the rest of my days  without it as well .s m h . M A G A",
    "likes": 4
  },
  {
    "commentText": "Taylor swift has marbles for brains!!",
    "likes": 0
  },
  {
    "commentText": "Predictable, Right wingers can’t handle a celebrity with a different opinion than them",
    "likes": 0
  },
  {
    "commentText": "Is stead of shake it off she can knock it off",
    "likes": 0
  },
  {
    "commentText": "Taylor = weak minded.",
    "likes": 0
  },
  {
    "commentText": "taylor was the smartest of the smart when we all thought she was a secret gop'er and smart not to say so, but, now, she is like the rest of the uneducated hollyrock trash spouting out her opinion on things that dont have much do with anyone but herself.  she wants to screw all of us by her actions......as if we would do as she says and vote for the party of slavery and chaos. burn them albums",
    "likes": 4
  },
  {
    "commentText": "Everyone knows Swift uses 4chan",
    "likes": 0
  },
  {
    "commentText": "Hail the Troll King!!! Drain the Swamp!",
    "likes": 0
  },
  {
    "commentText": "Taylor cant sing anyway she is another hollowwood child molester",
    "likes": 0
  },
  {
    "commentText": "Always about negotiation. President Trump is a professional. Lots of respect from Brazil.",
    "likes": 0
  },
  {
    "commentText": "Taylor Swift, you know nothing. Congratulations Taylor, you just became a snow flake.",
    "likes": 10
  },
  {
    "commentText": "I love Taylor Swift but calm down she's not political like Alyssa Milano and Whoopi. This is not the first time she endorses democrats there's a video when she was younger and she spoke her support for Democrat women.",
    "likes": 0
  },
  {
    "commentText": "She's a ripoff thief artist",
    "likes": 1
  },
  {
    "commentText": "Kanye will sort her out  lol",
    "likes": 0
  },
  {
    "commentText": "I don't like Taylor Swift but I like that she hates Trump! That is a good thing!",
    "likes": 2
  },
  {
    "commentText": "If Taylor was a Brit she'd be calling for a 2nd Brexit Referendum.",
    "likes": 0
  },
  {
    "commentText": "The reality is if the economy takes a 08 type hit again all the dems will be I told you so, and the trump supporters will flop just like w obama!",
    "likes": 0
  },
  {
    "commentText": "swift sux anyways",
    "likes": 0
  },
  {
    "commentText": "I was hoping Swift would be smart enough to stay out of politics. She also believes the whole blacks are victims of systemic racism garbage. Oh well.",
    "likes": 0
  },
  {
    "commentText": "Ok. Now that’s funny.",
    "likes": 0
  },
  {
    "commentText": "Taylor Swift enriched her self thanks to Capitalism and now she’s a socialist! Lol!",
    "likes": 2
  },
  {
    "commentText": "Trump>Hollywood",
    "likes": 3
  },
  {
    "commentText": "Never liked Taylor Swift's music but respected her for remaining neutral. Respect GONE!",
    "likes": 6
  },
  {
    "commentText": "HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAAAAAAAAAAAAAAAAAAAAAA!!",
    "likes": 0
  },
  {
    "commentText": "Savage , love ❤️",
    "likes": 3
  },
  {
    "commentText": "Honestly thought she was a bad country music singer and then she transitioned to pop and I just didn't care",
    "likes": 1
  },
  {
    "commentText": "Can TaylorSwift team up with Chuck Schumer.....chuck her Swiftly off a cliff 😂",
    "likes": 6
  },
  {
    "commentText": "Taylor had the choice of joining the liberal mob or be attacked by them.",
    "likes": 5
  },
  {
    "commentText": "Taylor who?",
    "likes": 4
  },
  {
    "commentText": "The blue wave likes her a kazillion % more....watch out on election day...play her songs!",
    "likes": 0
  },
  {
    "commentText": "I honestly forgot who Taylor Swift was.",
    "likes": 2
  },
  {
    "commentText": "Country music is conservative fan based.  She might have a problem with future record sales.",
    "likes": 5
  },
  {
    "commentText": "LMAO, reporters are truly desperate leeches, will come up with the most ridiculous questions to ask.\nNobody cares who Taylor Swift chooses to support. She's an entertainer, nothing more.",
    "likes": 0
  },
  {
    "commentText": "Lol so he is a Taylor swift fan 😂",
    "likes": 0
  },
  {
    "commentText": "Hahaha he is such a joker",
    "likes": 3
  },
  {
    "commentText": "The way trump deals with all this bullshit is just incredible God protect and bless him.",
    "likes": 56
  },
  {
    "commentText": "I love how Trump just says what he means",
    "likes": 158
  },
  {
    "commentText": "who is Taylor swift?",
    "likes": 1
  },
  {
    "commentText": "Don’t really care about the stick lady or her music.",
    "likes": 7
  },
  {
    "commentText": "AWESOME! Trump is king of trolling",
    "likes": 24
  },
  {
    "commentText": "OMG did  Trump just assault Swift?",
    "likes": 1
  },
  {
    "commentText": "Taylor swift was terrific when she started but the illuminati turned her into an evil Witch.   Too bad.",
    "likes": 2
  },
  {
    "commentText": "Please. Sign the paper work so I can prove I can reenlist.",
    "likes": 0
  },
  {
    "commentText": "Her career is over now",
    "likes": 12
  },
  {
    "commentText": "Trump went for a quarter...\nWhere The people will go a dollar...",
    "likes": 2
  },
  {
    "commentText": "Burning my T swift CD’s!",
    "likes": 11
  },
  {
    "commentText": "Gun to my head I couldn't name one song she sings",
    "likes": 15
  },
  {
    "commentText": "I'm disappointed in swift, too bad shes a media hypocrite",
    "likes": 7
  },
  {
    "commentText": "Taylor Swift just got Trumped",
    "likes": 5
  },
  {
    "commentText": "that smirk when he loves the question",
    "likes": 18
  },
  {
    "commentText": "I'm calling it now next concert Taylor gets hit with quarters",
    "likes": 5
  },
  {
    "commentText": "Taylor Swift is a tranny.",
    "likes": 2
  },
  {
    "commentText": "🤣",
    "likes": 4
  },
  {
    "commentText": "Another Ignorant, Stupid Musician thinking they’re politicians! Fan advice for Swift, “Shut Up and Sing” as you just ostracized 75% of fanbase!  Dumb move Taylor",
    "likes": 1
  },
  {
    "commentText": "Taylor who?",
    "likes": 23
  },
  {
    "commentText": "me too. singers, celebrities need to shut their traps",
    "likes": 12
  },
  {
    "commentText": "Best thing trump can do for the republicans is shut up for the next 29 days",
    "likes": 0
  },
  {
    "commentText": "😂 😂",
    "likes": 5
  },
  {
    "commentText": "It's the money.  And Poor Taylor is no exception.",
    "likes": 3
  },
  {
    "commentText": "It's the money.  And Poor Taylor is no exception.",
    "likes": 2
  },
  {
    "commentText": "UNITE",
    "likes": 1
  },
  {
    "commentText": "Wonder if Taylor knows 12yr olds can't vote?",
    "likes": 9
  },
  {
    "commentText": "Lol a quarter troll",
    "likes": 145
  },
  {
    "commentText": "President Trump, you are nicer than I am!  I like her music 75 percent less than I did previously!",
    "likes": 69
  },
  {
    "commentText": "How anyone can not Love The Donald ! Sane Americans You Have the very BEST President EVER",
    "likes": 151
  },
  {
    "commentText": "Oh no someone didn't agree with poor old prez",
    "likes": 8
  },
  {
    "commentText": "It's so cliche to be a liberal celebrity. I'm a contrarian. I would be like Kanye and be pro-trump just to stick it to them lol.",
    "likes": 50
  },
  {
    "commentText": "TAYLOR'S  BRAIN IS NOT TOO SWIFT",
    "likes": 7
  },
  {
    "commentText": "Trump just can't help himself from engaging in pettiness! America's moron!",
    "likes": 1
  },
  {
    "commentText": "Oh yeah......that's all the Demonratz need is Taylor Swift. That'll bury them for good. She's should stick to her music. She's WAY out of her league!",
    "likes": 3
  },
  {
    "commentText": "Can't touch me 🖕 \nBrilliant 👏👏👏👏👏",
    "likes": 1
  },
  {
    "commentText": "I love the way he smiles.",
    "likes": 67
  },
  {
    "commentText": "Best USA president ever hands down",
    "likes": 49
  },
  {
    "commentText": "Master troll 🤣🤣🤣🤣",
    "likes": 17
  },
  {
    "commentText": "He should have just kept walking but only uses platform to insult others and promote REPUBLICONS",
    "likes": 0
  },
  {
    "commentText": "The Dixie Chics have a new member?",
    "likes": 17
  },
  {
    "commentText": "It's a great answer.",
    "likes": 65
  },
  {
    "commentText": "Proud, newly minted Swiftee, right here.  Just like the Dixie Chicks took flak, but had it right about the B.S. Iraq war, Taylors got this right.",
    "likes": 0
  },
  {
    "commentText": "Lol, he is great!",
    "likes": 28
  },
  {
    "commentText": "A supposed pat on the buttocks has some kind of glory undoubtedly and is just what the Democrats need.",
    "likes": 3
  },
  {
    "commentText": "I use to like her music, like yesterday, admired how she runs her whole operation, but now will not buy her music",
    "likes": 24
  },
  {
    "commentText": "Savage.😎",
    "likes": 2
  },
  {
    "commentText": "The delusion is strong in this thread.",
    "likes": 0
  },
  {
    "commentText": "Lol don’t don’t u have to b 18 to vote 😂😂😂😂poor Taylor her fans can’t vote😭😭love my Trump 🙌🏼2020",
    "likes": 35
  },
  {
    "commentText": "Swift was ordered by her illuminati cult masters and handlers to get political.",
    "likes": 167
  },
  {
    "commentText": "Taylor...a dumb Sagittarius",
    "likes": 0
  },
  {
    "commentText": "Imagine having millions of dollars but still being so upset about Kanye upstaging you several years ago that you just have to get back at him by supporting the opposing party.  Get help, Taylor.",
    "likes": 39
  },
  {
    "commentText": "The true resistance to the globalists are those who vote repbulican",
    "likes": 38
  },
  {
    "commentText": "Taylor S. 👎",
    "likes": 7
  },
  {
    "commentText": "Someone shoved Swift's head in that bucket of crap and she feel for it. Some women are qullible. That's why all the shopping channels on t.v. are geared toward women only.",
    "likes": 19
  },
  {
    "commentText": "not surprising she is taking that stance.  her shoulders are significantly wider than her hips.  do a search for taylor swift transinvestigation.",
    "likes": 15
  },
  {
    "commentText": "So what? So Taylor Swift is just one more celebrity without a 🧠. I always knew she was a Democrat but she never aired it",
    "likes": 87
  },
  {
    "commentText": "Why do you care?",
    "likes": 0
  },
  {
    "commentText": "I really feel so sorry for entertainers who have to side with the Democrats/Leftists for fear of not working again, or loosing gigs. Hopefully the people of California will do the right thing by voting Democrats out of office, so they can once again taste the fruits of freedom, and say what they really feel.",
    "likes": 40
  },
  {
    "commentText": "Look what you made me do, look what you made me do vote Republican.",
    "likes": 61
  },
  {
    "commentText": "LOL, That's very amusing cause TS has the \" OFFICIAL SEAL OF THE KKK  \" tattooed on her butt (ask Kanye ) ! We know you here in Tenn. ! Small towns REMEMBER ! REMEMBER YOUR LITTLE BROTHER ? ! WHAT YOU DID ! ! ! YOU'RE JUST ANOTHER TWISTED LEFTIE HIPPOCRATE ! ! !",
    "likes": 1
  },
  {
    "commentText": "Does the red demon really listen to music?",
    "likes": 0
  },
  {
    "commentText": "Taylor swift the SJW? Does she know you can't be country and hate your country? Trump 2020!",
    "likes": 7
  },
  {
    "commentText": "Taylor, \n\n       look what you made him do.",
    "likes": 0
  },
  {
    "commentText": "Artists goes political at the very moment they’re done - it’s a PR stunt.. just sayin’...",
    "likes": 85
  },
  {
    "commentText": "Oh BTW Marsha Blackburn is the hottest woman over the age of 60 I've EVER seen 100% truth.",
    "likes": 20
  },
  {
    "commentText": "He's the most dishonest president ever in American history",
    "likes": 0
  },
  {
    "commentText": "4chan has to get on making a meme with Donald Trump dancing to Taylor Swift music in the Oval Office....",
    "likes": 0
  },
  {
    "commentText": "Taylor vs Kanye II",
    "likes": 4
  },
  {
    "commentText": "What is this all about?",
    "likes": 1
  },
  {
    "commentText": "it honestly seems like Trump has regained a lot of his cognitive ability. There was about a year period after Comey's firing that he was just off the wall nuts, but  now he seems to be more confident, relaxed, and coherent. And this is coming from a Democrat. Makes me a little bit more at ease.",
    "likes": 0
  },
  {
    "commentText": "I never liked her music either... just not my style.",
    "likes": 36
  },
  {
    "commentText": "Obama couldn't come up with this sort of wit without running it by his advisors. 😂",
    "likes": 69
  },
  {
    "commentText": "Celebtards are out of touch and deranged!",
    "likes": 221
  },
  {
    "commentText": "Trump was being too generous.  I like her music about 75% less now.",
    "likes": 182
  },
  {
    "commentText": "Taylor Swift should go pound some salt up her arse!! Salty ignorant Illuminati puppet!\nIt doesn’t even make sense what Taylor said about Marsha Blackburn. Marsha has done a lot for women and wants to push a Trump America first policy. What’s wrong with that Taylor, you want Socialism? What an idiot!",
    "likes": 7
  },
  {
    "commentText": "At least Swift isn't overly political like the rest of the clueless paid celebrities. I will never take advice from a celebrity.",
    "likes": 13
  },
  {
    "commentText": "Taylor Swift music is ok not that good",
    "likes": 6
  },
  {
    "commentText": "I'm not good at mathematics. How can you like something 25% less than 0?",
    "likes": 31
  },
  {
    "commentText": "LOL! 25% less...perfect answer.",
    "likes": 477
  },
  {
    "commentText": "awwww poor tyrant cant handle not being liked 😢😭😢😭",
    "likes": 4
  },
  {
    "commentText": "Greatest President of all time! The man! President Trump!",
    "likes": 145
  },
  {
    "commentText": "Haha what a beauty! 🇺🇸😊🇺🇸",
    "likes": 77
  },
  {
    "commentText": "She just broke her fans heart ! It was refreshing to not have a star flapping her gums. Now she can be put on the shelf with the others .",
    "likes": 219
  },
  {
    "commentText": "Lol 😂 i like Trump more and more everyday.",
    "likes": 385
  },
  {
    "commentText": "I never really liked Taylor Swifts music anyways😂 Not one sht given",
    "likes": 246
  },
  {
    "commentText": "Hahahaha.  Awesome.  Trump has a great sense of humor.  Love it.",
    "likes": 241
  },
  {
    "commentText": "Comrade Putin climaxes deep inside Trumps fat ass",
    "likes": 0
  },
  {
    "commentText": "Sucks anyway.",
    "likes": 24
  },
  {
    "commentText": "Love Taylor Swift! I’m sure she’ll shake it off.😎",
    "likes": 9
  },
  {
    "commentText": "😂",
    "likes": 15
  },
  {
    "commentText": "I honestly love him",
    "likes": 147
  }
]