[
  {
    "commentText": "Good thing I live in the lone star state, you can legally gun someone down during night time hours for theft or vandalism.",
    "likes": 0
  },
  {
    "commentText": "What's getting me is there is videos of these people and zero arrest ? You can't explain that",
    "likes": 0
  },
  {
    "commentText": "Fake ass. Probably did it himself.",
    "likes": 0
  },
  {
    "commentText": "Make liberals cry again! MLCA!\nMAGA!",
    "likes": 0
  },
  {
    "commentText": "There are too many assholes in this country with their political views. My wife and I have seen the haters with destruction of our property because of an allegiance to a football team. Pussies all. No confrontation like computer sissies. I guess it has always been this way to some extent. Just be civil and talk and air your differences. I hate the guy who sucker punches. Would never do that.  Stand up and be a man for Christ sake.",
    "likes": 0
  },
  {
    "commentText": "If the liberals didn't have double standards they wouldn't have any standards at all!",
    "likes": 0
  },
  {
    "commentText": "I was behind a young guy in an old pickup with trump stickers that was being chased/harassed by another car. I took a guess at what was happening, and then KNEW what was happening when the guy held a flag out of his window, while the car was 2\" off his bumper blaring their horn. They turned, and i kept going. I then instantly turned around and floored it to catch up and help him, but they were gone. Truly disgusting people, libtards are.",
    "likes": 0
  },
  {
    "commentText": "Leftists aching for war. Be careful what you wish for mofo's.",
    "likes": 0
  },
  {
    "commentText": "Liberals causing destruction.    I am a Republican living in Liberal Las Vegas, and stuff like this is why I won't put politic sticker's on my car.  Liberals don't know how to be civil.",
    "likes": 0
  },
  {
    "commentText": "**DUMB REPUBLICANS, LIKE TRUMP, SHOULD BE SEEN AND NOT HEARD, THE REPUBLICAN STRATEGIES ARE FALLING APART** THE TAX MAN IS COMING FOR YOU",
    "likes": 1
  },
  {
    "commentText": "These are soros paid antifa assholes",
    "likes": 0
  },
  {
    "commentText": "liberal demon rat bastards, 2nd amendment  an right of self defense  shoot the pig bastards.",
    "likes": 0
  },
  {
    "commentText": "He probably did it himself, probably had lemon law issues that the dealer would not fix.",
    "likes": 0
  },
  {
    "commentText": "Liberals are vying for extinction.",
    "likes": 0
  },
  {
    "commentText": "A \"you are being filmed\" bumper sticker perhaps.",
    "likes": 0
  },
  {
    "commentText": "Vote the criminal terrorist demonrats out of office - every last one.",
    "likes": 0
  },
  {
    "commentText": "But, But, But those Tea Partiers are soooo dangerous.",
    "likes": 0
  },
  {
    "commentText": "It's like the left wants to start a civil war. Disgusting attitudes.",
    "likes": 0
  },
  {
    "commentText": "This would happen in parts of Cleveland too.",
    "likes": 0
  },
  {
    "commentText": "That's a shame",
    "likes": 0
  },
  {
    "commentText": "That's a shame. The guys work truck.",
    "likes": 0
  },
  {
    "commentText": "Yay 👏🏻👏🏻👏🏻 liberals are spazzing out, which means they are really triggered. 💦💦❄️",
    "likes": 0
  },
  {
    "commentText": "Two things: 1)  This is exactly why my wife and I refuse to put political stickers on our vehicles.  2)  Knowing that people on the left can react like deranged children regarding any support or affirmation of Trump, I believe that reflects in the polling data as well.  2016 polls showed Hillary with a 98% chance to win the presidency.  Why?  Was it because people were afraid to profess their support for Trump in public for fear of retaliation?  My guess is yes.",
    "likes": 0
  },
  {
    "commentText": "As opposed to putting a Trump sticker on your bumper, put a Lefty on it instead.",
    "likes": 0
  },
  {
    "commentText": "Arson self inflicted",
    "likes": 0
  },
  {
    "commentText": "I want a MAGA that says ...Make Aliens Go Away",
    "likes": 0
  },
  {
    "commentText": "Wow that's scary just for a sticker there is a lot of vandalisms out there they take it out on a vehicle and the vehicles don't do anything that is devastated I blame the township for the damaged that could happen to anyone. This is an interesting world",
    "likes": 0
  },
  {
    "commentText": "It is not a liberal thing to burn another's possession over ideology however, it is most definitely how, democrats follow the orders of their master, the international left.",
    "likes": 0
  },
  {
    "commentText": "Civil War is coming...Arm yourselves and practice,practice....a d practice some more....",
    "likes": 0
  },
  {
    "commentText": "lol, fake news.  He probably torched it himself.  Professional victimhood is the new conservative platform.",
    "likes": 0
  },
  {
    "commentText": "If you think b4 doing things can b avoided. No, u have 2 b big4mouth and show everybody. There u go ...",
    "likes": 0
  },
  {
    "commentText": "Cops you want your extra revenue? No need for speed traps! Just put out a pro trump bait car! You will catch people that deserve fines and jail time.",
    "likes": 1
  },
  {
    "commentText": "There should be cameras somewhere, search all buildings and if there is, have the police get those tapes...... Bingo.......",
    "likes": 0
  },
  {
    "commentText": "Sick bastereds.",
    "likes": 0
  },
  {
    "commentText": "Well the saying liar liar truck on fire is apparently true. We all reminder the fire that broke on on the floor of the Trump Tower where he keeps his pants. Sarah shows he knows this because she never wears pants during her press conferences.",
    "likes": 0
  },
  {
    "commentText": "Most truck owners support trump  bicycles don't have liberal stickers eh",
    "likes": 0
  },
  {
    "commentText": "Maybe you shouldn’t be so open about being a dickhead and a racist",
    "likes": 0
  },
  {
    "commentText": "Leftists are so thoroughly indoctrinated that they think that if a victim of a crime is an ideological enemy, and the perpetrator a comrade, then the true victim must be the perpetrator, and the true evildoer the one who suffered the injury.",
    "likes": 0
  },
  {
    "commentText": "False Flag!",
    "likes": 1
  },
  {
    "commentText": "Check the cameras and find whoever did it. Not representative of a whole group.",
    "likes": 0
  },
  {
    "commentText": "lol - man says whatever - fox has no idea who man is - LOLOLOLOL",
    "likes": 0
  },
  {
    "commentText": "More real than that idiot Joey salads \nLet’s start a go fund me for his deductible",
    "likes": 1
  },
  {
    "commentText": "Trump is gonna buy this dude a truck so fast.",
    "likes": 0
  },
  {
    "commentText": "Progressives are America's version of Nazis. Think about it for a second. Progressives claim to be saving the world from racism, sexism etc. The Nazis claimed to be saving Germany from the Jews. In both cases it was about destroying who they didn't like under the guise of a virtuous crusade to save the world. Its not about ridding the world of all things bad as they claim, its about hatred and oppression.",
    "likes": 1
  },
  {
    "commentText": "This is how the far-left terrorism begins. First  the attacks with fires and gradually  the armed confrontation to a greater or lesser extent.",
    "likes": 0
  },
  {
    "commentText": "Red Tsunami will baptize the Libtards in November. 🇺🇸",
    "likes": 0
  },
  {
    "commentText": "I don't  know what to call this anymore",
    "likes": 0
  },
  {
    "commentText": "We have to get out and vote Republican,These libtards are Nutso",
    "likes": 0
  },
  {
    "commentText": "Still waiting 4 pay back time shyt",
    "likes": 0
  },
  {
    "commentText": "Ive actually joked around putting trump stickers and merchandise on and in my car and driving to nyc and parking it, i hate my car and the loan haha,guess it can work.",
    "likes": 0
  },
  {
    "commentText": "Another projection when Hillary said Deplorables. Her mob of “everybody gets a trophy kids” fight for her and Soros.",
    "likes": 0
  },
  {
    "commentText": "Awe, poor little sissy cries because his truck was torched.. wait till Prince Michael arrives and burned your entire nation to the ground. Your days are numbered.",
    "likes": 0
  },
  {
    "commentText": "Sorry but I only show my support for Trump when I vote or tell people. I'm not going to decorate my house or truck or body. Because I don't have to I simply vote.",
    "likes": 1
  },
  {
    "commentText": "This is WAR👀??? Left Terrorists!!!",
    "likes": 1
  },
  {
    "commentText": "What was a Brownshirt doing around a bar? I thought they’re vehemently against beer.",
    "likes": 0
  },
  {
    "commentText": "Fake news, republicans are fake and love to lie. He probably got his friends or family to do it so he can come up with this story and get an insurance claim because you all are that pathetic. LOSERS!!",
    "likes": 0
  },
  {
    "commentText": "I have a Trump sticker on my bumper and a shotgun in the back seat. Try me",
    "likes": 0
  },
  {
    "commentText": "Still a better tactic than the republicans decision to shoot everything",
    "likes": 0
  },
  {
    "commentText": "My bro went out to talk politics 1.5 yrs ago he was pro trump and was found dead on a bench",
    "likes": 0
  },
  {
    "commentText": "But... but... I thought we were supposed to be the Nazis???",
    "likes": 0
  },
  {
    "commentText": "I took my Trump sticker off my car after someone slashed my tires at a Walmart.",
    "likes": 0
  },
  {
    "commentText": "I wonder if CNN cares to show this story? Probably not.",
    "likes": 0
  },
  {
    "commentText": "Im italian ...the person that did this would be found with a trump tattoo on his/her forehead",
    "likes": 0
  },
  {
    "commentText": "Turns out he torched his own vehicle.",
    "likes": 0
  },
  {
    "commentText": "Sounds like an insurance scam. Probably find the tools in his garage.",
    "likes": 0
  },
  {
    "commentText": "He did that himself!",
    "likes": 0
  },
  {
    "commentText": "Whoever did that better go hide. Cowardly brain dead liberals are gonna get a butt whooping.",
    "likes": 0
  },
  {
    "commentText": "This is sick. I walk around with Trump stickers all over me. Does this mean some crazy lib is gonna set me on fire?!?!",
    "likes": 0
  },
  {
    "commentText": "Liberals got butthurt and decided to make him cry over his truck.",
    "likes": 0
  },
  {
    "commentText": "The biggest problem is when the leftists attack,  you can't just end them. It needs to be made legal to gun down crazed mobs. After a couple \"protest marches\" the left likes to operate get annihilated,  they will learn some civility.",
    "likes": 0
  },
  {
    "commentText": "If he does get caught, all he has to do is deny it. That's what Trump does, Remember? \"It's all fake news anyway people.\"  Atleast, that's what you all tell me everytime Trump gets caught in lies and infidelity.",
    "likes": 0
  },
  {
    "commentText": "GooD Continue This ! Make More Trucks Burn.... Democrats will shipped to Canada",
    "likes": 0
  },
  {
    "commentText": "good trumpanzie is a dead trumpanzie",
    "likes": 0
  },
  {
    "commentText": "THIS WAS DONE BY PEOPLE THAT SAY TRUMP VOTERS ARE NAZIS, THEIR RABID DEPLORABLES, AND THAT DEMOCRATS ARE PASSIONATE , CONSIDERATE, AND CIVIL! BUT ITS ALWAYS TRUMP SUPPORTERS THAT ARE ATTACKED!!!",
    "likes": 0
  },
  {
    "commentText": "Dispatched said what?",
    "likes": 0
  },
  {
    "commentText": "Was that a positive and negative connection on his bumper? Maybe he has some crazy wiring that shorted?",
    "likes": 0
  },
  {
    "commentText": "Sorry John. I wore a shirt in the place I once lived. Tent city 130 darthmouth st. Boston Ma. Before the election beat up by my peace and loving Islamic pals. Then a month later attacked and slashed across my white face. Diversity it said on the plaque as I moved in. That’s diversity. And now I’m the guilty one because I do in fact have ISLAMAPHOPIA",
    "likes": 0
  },
  {
    "commentText": "Libtards.....",
    "likes": 0
  },
  {
    "commentText": "Conservatives burning their own stuff and blaming it on liberals. Typical.",
    "likes": 0
  },
  {
    "commentText": "Demarodent’s",
    "likes": 0
  },
  {
    "commentText": "Insurance fraud",
    "likes": 0
  },
  {
    "commentText": "It’s inevitable, when unhinged leaders call for unrest to the masses, a few unhinged people will head the call.\n\nNow, when shootings and murders start.\n\nYou Americans need to watch the media and Leftist politicians reaction.\n\nIf it’s condoned..... take up arms, because the war has started.",
    "likes": 0
  },
  {
    "commentText": "The demonic Left. .......out in the open for all to see.",
    "likes": 0
  },
  {
    "commentText": "people suck something fierce",
    "likes": 0
  },
  {
    "commentText": "I bet the owner just wanted a new truck and did it himself. Check his basement for the \"missing tools\". Pretty good story though.",
    "likes": 0
  },
  {
    "commentText": "Mr. Trump will get wind of this!",
    "likes": 0
  },
  {
    "commentText": "Look for liberal cars and put Pro-Trump stickers on them. Watch the chaos ensue.",
    "likes": 0
  },
  {
    "commentText": "How about a TRUMP sticker and a COEXIST sticker together! lol Yeah, we'll \"Make Liberals Cry Again\" come November 6th.",
    "likes": 0
  },
  {
    "commentText": "No tellin the actual motivation. Trump is just a good excuse to be criminal right now. Criminal was prolly jelly of his job or manliness.",
    "likes": 0
  },
  {
    "commentText": "Too bad it wasn’t a FORD...\nTrumpNation!🇺🇸",
    "likes": 1
  },
  {
    "commentText": "I don't think we're getting the full story. Maybe he pissed someone off in the bar.",
    "likes": 0
  },
  {
    "commentText": "Just another example these Left Wingers are crazy.  They want people to convert to their reasoning",
    "likes": 0
  },
  {
    "commentText": "How triggered can you get it was just a sticker.",
    "likes": 0
  },
  {
    "commentText": "It was an obese gal in a black leotard.",
    "likes": 0
  },
  {
    "commentText": "The Tolerant Left",
    "likes": 0
  },
  {
    "commentText": "The bar has no oita to do with this. Its the mentality of the leftist mob that is absolutely frightening .",
    "likes": 0
  },
  {
    "commentText": "This is why some shop keepers put Antifa posters in Windows - just to avoid getting vandalised and hurt.  The liberals run a protection racket.",
    "likes": 0
  },
  {
    "commentText": "BAIT",
    "likes": 0
  },
  {
    "commentText": "It's getting closer to a full out war  in the near future years ahead folks, now we're at the level of burning people's property because they support the President of the USA? Before that, we were on the level of physical and verbal attacks, from liberals towards All Conservatives, because the democrat slave masters ORDERED their minions to act this way towards All Trump supporters & republicans!! Smh, one can see how much worse and worse this is getting, and where it's leading us All towards! There is only one side that is causing All this evil, hate, division and violence! That is the democrat party & radical liberals of the left, because they can't handle REJECTION, FAILURE, Losing,  FACTS, Life & NOT having power over All people! Hopefully they remain out of power for a very long time, our freedoms, lives, safety and childrens future depend on it! KAG, RED TSUNAMI 2018🇺🇸TRUMP🇺🇸",
    "likes": 0
  },
  {
    "commentText": "This is what when Trump and Fox spread their hatred.",
    "likes": 0
  },
  {
    "commentText": "Anchor lady is hot",
    "likes": 0
  },
  {
    "commentText": "Laura, come out of your JewFlorida bubble. Gonna be brave and put a sticker on her old car?",
    "likes": 0
  },
  {
    "commentText": "Nice one ☺😊😀😁😂 for or a sticker..? Ho...",
    "likes": 0
  },
  {
    "commentText": "I have that exact bumper magnet.",
    "likes": 1
  },
  {
    "commentText": "Democrats are acting more and more like Nazis.",
    "likes": 0
  },
  {
    "commentText": "But remember this isn't a mob.",
    "likes": 0
  },
  {
    "commentText": "Yea so many quiet people voting red in the midterms. Dems are screwed. Hey Dems and Libs. Bring your BS down South and see how many of you go home to tell the story. Enough is enough!!",
    "likes": 0
  },
  {
    "commentText": "Soooo.....let me see if I understand this correctly.A Republican wisely decided to call an Uber to go home.Someone sets his truck a blaze.....and NO ONE saw it burning....??????",
    "likes": 0
  },
  {
    "commentText": "NEO-fascist leftist elitists embedded in the Democrat-rat Party are racist, sexist, bigoted, divisive, intolerant and violent. They are filled with hatred, malice and poisonous bile.\n\nIf Democrats become the majority in Congress again, the United States will be completely and totally destroyed.",
    "likes": 1
  },
  {
    "commentText": "This is bullshit! MAGA! Vote at the mid-terms!",
    "likes": 0
  },
  {
    "commentText": "Muh tolerant liberals.",
    "likes": 1
  },
  {
    "commentText": "Domestic terrorism. Pure and simple.",
    "likes": 0
  },
  {
    "commentText": "Here in Indiana my stickers started alot of random conversations generally with old people that would rant at me about Hillary being a crook 😊 so far positive reactions..alot of smiles especially for the anti Hillary sticker 😄",
    "likes": 0
  },
  {
    "commentText": "I keyed a car that had Obama sticker",
    "likes": 0
  },
  {
    "commentText": "Wow. I live outside Portland and I carry cause of Antifa and I’m prepared to use my firearm if they come at me first. I have thought about not putting any pro Trump stickers on my car cause I think this would happen to me too. Oregon is so bad and so intolerant. So much different than Montana. My gosh.",
    "likes": 0
  },
  {
    "commentText": "Bars generally have really good security cameras, should be easy to identify them liberal crims.",
    "likes": 0
  },
  {
    "commentText": "Fake news. I bet his truck broke down and it's just an insurance scam. Prove me wrong.",
    "likes": 0
  },
  {
    "commentText": "Pretty messed up",
    "likes": 0
  },
  {
    "commentText": "FELONY! HOPE HE HAD FULL COVERAGE & GETS A NEW TRUCK!! HE SURE TRIGGERED A CRY BABY!! To many cameras they will be caught then cry in jail.Its evident they are controlled by fear they must know MAGA is 2020!",
    "likes": 1
  },
  {
    "commentText": "Trump 2020!!!",
    "likes": 0
  },
  {
    "commentText": "No guys this is only “civil” protest. Only republican can be an angry mod. Can’t wait to vote. Because I am letting mob rule. Govern this country",
    "likes": 0
  },
  {
    "commentText": "Did people forget antifa derailed a train?",
    "likes": 0
  },
  {
    "commentText": "This liberals need to all he arrested every single one we are not safe in America with these domestic terrorists afoot the federal government has an obligation to protect me from threats foreign and domestic.... that mean terrorists for the democratic party",
    "likes": 0
  },
  {
    "commentText": "Hell ya,,  bring the heat,,,lol",
    "likes": 1
  },
  {
    "commentText": "I can't wait till all these liberals are hunted down in the streets like Jews, re-open the train lines to Auschwitz",
    "likes": 0
  },
  {
    "commentText": "Start a gofundme",
    "likes": 0
  },
  {
    "commentText": "You can't be accomplice to the destruction of American democracy,and expect no punishment.The ones who burned his truck were patriots.",
    "likes": 0
  },
  {
    "commentText": "Abolish STUPIDITY. \nAbolish DEMONcrats.",
    "likes": 1
  },
  {
    "commentText": "Just go to war get it over and done with, democrats need wiping out !",
    "likes": 1
  },
  {
    "commentText": "It begins",
    "likes": 0
  },
  {
    "commentText": "Buy him a brand new truck Laura, MAGA stickers and all.",
    "likes": 0
  },
  {
    "commentText": "THE LIBERAL MOB MUST BE STOPPED! VOTE RED!",
    "likes": 2
  },
  {
    "commentText": "You know what, this is going to help us in the long term. It's going to cause people to come to the Conservative and GOP side.",
    "likes": 0
  },
  {
    "commentText": "Hillary/Democrats should be arrested for inciting violence.",
    "likes": 3
  },
  {
    "commentText": "This is not the first time this has happened. In 2016, a guy with a Trump bumper sticker had his car tourched while he was fishing with his son.",
    "likes": 4
  },
  {
    "commentText": "I wonder if there's video surveillance",
    "likes": 0
  },
  {
    "commentText": "Democrats firebomed black churches 50 years ago. Their tactics dont change",
    "likes": 14
  },
  {
    "commentText": "Liberals are animals.",
    "likes": 2
  },
  {
    "commentText": "Wouldn't it be awesome if Trump bought him a brand new boss ass truck?",
    "likes": 0
  },
  {
    "commentText": "I like to beat the crap out if trumpians, not their toys...",
    "likes": 0
  },
  {
    "commentText": "Liberals are the least tolerant people of free speech.",
    "likes": 5
  },
  {
    "commentText": "Man I feel really bad for this guy . I hope he is taken care of.",
    "likes": 0
  },
  {
    "commentText": "I'm surprised she didn't say they were trying to shut free-speech up.",
    "likes": 1
  },
  {
    "commentText": "Good one.\nThe message dullards ,, is..\n‘You’re not welcome ‘\nGet used to the mob\n\nIf Republicans stick around after November, I shall invest in security systems and the like..\nThey will need those...\nNo reason a DECENT person shouldn’t capitalize once in a while",
    "likes": 0
  },
  {
    "commentText": "Aight.... Guess its time to be hittin the ol dusty trail....",
    "likes": 0
  },
  {
    "commentText": "Lets not harass people for their political views, guys, thats wrong. But lets face it, it was a truck and trucks deserve to burn anyways.",
    "likes": 0
  },
  {
    "commentText": "Well done",
    "likes": 0
  },
  {
    "commentText": "I'd like to see the surveillance video !",
    "likes": 0
  },
  {
    "commentText": "Not surprised 😮 soon it will be houses with pro Trump signs in the yard. Will have to meet in bathrooms to talk about how we really feel like citizens of soviet communist countries 😢😢😢",
    "likes": 1
  },
  {
    "commentText": "If we can keep those illegals voters away from the poll then Trump will be a shoe in for 2020. Something needs to be done now to stop the illegal votes.  Funny how the left always talk about Russia interfering with the elections but they don't say a word about the illegal votes for Hillary.",
    "likes": 4
  },
  {
    "commentText": "This is a hate crime.   Committed by the party of \"Love, Tolerance, and Diversity\"!!!",
    "likes": 8
  },
  {
    "commentText": "So they are terrorist now..  now more trump then ever",
    "likes": 0
  },
  {
    "commentText": "lies. he did it himself for insurance",
    "likes": 0
  },
  {
    "commentText": "Rule #1....NEVER post your political leanings on your vehicle.",
    "likes": 0
  },
  {
    "commentText": "Tolerant leftie cnts.",
    "likes": 0
  },
  {
    "commentText": "Just the beginning, folks. This is the New Normal for the Demorats, who are desperate, violent, and soulless.\nBe careful out there!!",
    "likes": 1
  },
  {
    "commentText": "Maybe his truck wasn’t worthy",
    "likes": 0
  },
  {
    "commentText": "This is the problem I have with Laura, she seems more interested in been liked and making jokes. I was surprised she didn't ask if the person who did it had been identified, if the police were investigating and hoping the person goes to jail. She didn't seem angry by it and this is part of the problem on the Right. No sufficient righteous indignation till it happens to you personally and its just wrong. This attacks against Trump supporter are more rampant than the media portrays and he media seems cool with it.",
    "likes": 0
  },
  {
    "commentText": "I have those stickers on my Abrams, just left the bar with an uber 4 nights in a row. No burns!",
    "likes": 0
  },
  {
    "commentText": "Democrats are finished now. Civilised people won't tolerate this behaviour.",
    "likes": 0
  },
  {
    "commentText": "Lol let me catch one of you pencil neck liberals even looking at my truck, your neck is broken, body tossed in the river, no witnesses. Try a real one.",
    "likes": 1
  },
  {
    "commentText": "The left wants a civil war. This is becoming more & more common.",
    "likes": 1
  },
  {
    "commentText": "Yup, someone disagrees with you, you torch their truck and beat them. So patriotic, so progressive! Worthless PoS....",
    "likes": 6
  },
  {
    "commentText": "I'd LOVE to have a pro-Trump sticker on my Jeep. This is why I don't.",
    "likes": 0
  },
  {
    "commentText": "Sounds more like an unsurance scam to me",
    "likes": 0
  },
  {
    "commentText": "I doubt this will make\nCNN\n(CUCK NEWS NETWORK)",
    "likes": 0
  },
  {
    "commentText": "The Democrat party should officially be labeled a terrorist organization under the law. Not even kidding. It's to that point.",
    "likes": 1
  },
  {
    "commentText": "Terrorism\nPlain & Simple",
    "likes": 0
  },
  {
    "commentText": "What do you expect? From weak coward leftists.",
    "likes": 2
  },
  {
    "commentText": "Good thing he parked far from everybody else.",
    "likes": 0
  },
  {
    "commentText": "I wear my Trump gear and conceal carry.🇺🇸",
    "likes": 0
  },
  {
    "commentText": "NISSAN with MAGA stickers. LOL",
    "likes": 0
  },
  {
    "commentText": "And it was a Nissan...can't win.",
    "likes": 0
  },
  {
    "commentText": "Yep, a real Trumpster: I had 4 beer in 1 hour and a half then i was supposed to go home. F... innocent .",
    "likes": 0
  },
  {
    "commentText": "tipical libtardstan...",
    "likes": 3
  },
  {
    "commentText": "The need to start putting these protesters in jail and no fine or bond for six months they would stop getting in the road and starting fires it’s time for them to GET CIVIL or GET TIME",
    "likes": 0
  },
  {
    "commentText": "Words can be scary stuff they dropped a lit match running away from the scary words to get to a safe space!Not even halloween,pretty scary stuff!MAGA or run away run away!",
    "likes": 0
  },
  {
    "commentText": "Blood & Soil JEWS will not replace us. Good people on both sides. MAGA TO DETH AND BEYOND 1000 YEAR  TRUMP REICH!",
    "likes": 0
  },
  {
    "commentText": "When you have a bad president heros will rise if if in such a small act. Everything helps",
    "likes": 0
  },
  {
    "commentText": "Though I can't stand Trump. Destroying a persons truck because he a Trump supporter? Un-called for. This is Trump's idea of making \"America Great Again\"? Not seeing the \"America Great Again\" part. If anything, he is dividing us. Making us \"Not Great No More\"",
    "likes": 0
  },
  {
    "commentText": "The Dems MOB keeps on terrorizing good Americans at restaurants, gasoline stations and bars. Next month, VOTE Republicans to block the Dems, the party of crime and mob rule, from taking power. Don't hand matches to an arson. Vote Republicans to Make Liberals Kry Again. President Trump should meet this man and make clear that the crimes and mob rule of the Dems is TOTALLY unacceptable.",
    "likes": 0
  },
  {
    "commentText": "Well, that would be the gauntlet thrown down, wouldn't it? See a DNC sticker...\nBe interesting to see what they would do to a wrap job!",
    "likes": 0
  },
  {
    "commentText": "Put a pro gay sticker and pro Trump sticker on a truck. Watch the left run in circles confused.",
    "likes": 4
  },
  {
    "commentText": "And WHY should people vote for Democrats?",
    "likes": 1
  },
  {
    "commentText": "Jesus man",
    "likes": 0
  },
  {
    "commentText": "More evidence libs are violent and unhinged.",
    "likes": 2
  },
  {
    "commentText": "the left went violent? Imagine my shock",
    "likes": 0
  },
  {
    "commentText": "You need to get about 500 of those stickers and go to the university and put them on all of the reserved parking spot cars.",
    "likes": 0
  },
  {
    "commentText": "Domestic terrorism",
    "likes": 1
  },
  {
    "commentText": "I don't want war, I don't want violence, I do not get all worked up by the non stop news of leftist crime, but what I am experiencing personally, year after year, leads me to believe that a civil war is a very real necessity to stop this systemic corrupt criminality and No Rule of Law.\n\nIt's out of control, and unless the judicial branch begins to truly enforce the law, it is inevitable that people will be forced to take the law into their own hands.\n\nI'm tired of the lies, the slander, the corruption, the theft, all of it.  \n\nEveryone is tired of it, it has to stop, and it will, one way or another.",
    "likes": 0
  },
  {
    "commentText": "We all know who is behind all of this crap. george soros!\nWe need to shut him down before he pushes us into a civil war!",
    "likes": 1
  },
  {
    "commentText": "Burning down a car just because you don’t like a bumper sticker on it’s just pure mental illness and outrageous.",
    "likes": 0
  },
  {
    "commentText": "If we still burned witches Hellary would be surrounded by people with weenies and marshmallows :D.",
    "likes": 0
  },
  {
    "commentText": "Trump 2020!!!!!!!!!!!!",
    "likes": 2
  },
  {
    "commentText": "Wow holy madness wtf!",
    "likes": 0
  },
  {
    "commentText": "well well i have a Trump sticker on my car BUT be weary I am Locked and Loaded.",
    "likes": 2
  },
  {
    "commentText": "Import trucks like this one will be going up in price because of Trumps tariffs.",
    "likes": 2
  },
  {
    "commentText": "I’m hoping this doesn’t come back as a hoax or something...",
    "likes": 0
  },
  {
    "commentText": "Is this a fake hate crime? I know the left is more prone to those type of attacks. But that doesn't mean someone would never do something like that. Anyway that's why I do put on any bumper stickers on my car.",
    "likes": 0
  },
  {
    "commentText": "It's simply pathetic, leftist coward",
    "likes": 0
  },
  {
    "commentText": "I want one of those Make liberals cry again stickers too!  Where did you get it???",
    "likes": 0
  },
  {
    "commentText": "Horse face Ingraham = TRANNY.",
    "likes": 1
  },
  {
    "commentText": "Wow",
    "likes": 0
  },
  {
    "commentText": "Oregon's governor Kate Brown received $2 million from creepy billionaire George Soro for her reelection.",
    "likes": 1
  },
  {
    "commentText": "But CNN says it was an imaginary truck burning! We aren't really seeing this... There's no violent mob protesters, it's normal legal protesting with Pathological Terroristic Sociopathic Demonrats the loving nieces and nephew of antie Mad Max... Don't you feel better now knowing that it's ok and these imaginary events will continue till the demonrat thug party gets back in power. Just ask Hillary, she promised it will most certainly continue till demonrat thugs are controlling every aspect of our lives once again! I feel better already as I stand in line for my next free taxpayer funded democratic electro shock🤯treatment...",
    "likes": 4
  },
  {
    "commentText": "Great.....let me guess, car insurance goes up for conservatives.",
    "likes": 1
  },
  {
    "commentText": "People are insane!! I hope they catch the fool and throw their dumbass in jail😡",
    "likes": 0
  },
  {
    "commentText": "This is a TRUE hate crime. And terrorism. WhereTF is the real investigation we would get if he had Obama stickers",
    "likes": 0
  },
  {
    "commentText": "Liberal tolerance.",
    "likes": 0
  },
  {
    "commentText": "I would crawl across broken glass to get to the polls",
    "likes": 8
  },
  {
    "commentText": "More reason to vote R on Nov 6",
    "likes": 7
  },
  {
    "commentText": "Had my jeep vandalized in one week after i put TRUMP 2020 sticker on it. DemonKKKrats are the party of crime and domestic terrorism.",
    "likes": 18
  },
  {
    "commentText": "This man will get a free truck and the antithug who did this will be in jail can't they think of consequences",
    "likes": 0
  },
  {
    "commentText": "That’s the Left for ya. The violent intolerant group they claim to be fighting is always them.",
    "likes": 1
  },
  {
    "commentText": "I would love to know the true story on this. It would be epic lol.",
    "likes": 0
  },
  {
    "commentText": "An actual vandalism case that can be confirmed by the bar, Uber, and his family as well as the police. Not like those backwards swastikas drawn on black churches haha.",
    "likes": 1
  },
  {
    "commentText": "Make Liberals Cry Again\n\nTrump2020🇺🇸",
    "likes": 6
  },
  {
    "commentText": "My truck was vandalized also my paint got ruined but I just got more stickers and got a trailer hitch with a flag",
    "likes": 11
  },
  {
    "commentText": "Prove it. Uhmmmm at a bar, bet they stole it then didn’t want to get caught with fingerprints so they torched it. I highly doubt ppl were like ohhhh look bumper stickers.. let’s torch it. Gtfoh!!",
    "likes": 1
  },
  {
    "commentText": "LIBS claim copyright to \"tolerance\".. HAHAHA",
    "likes": 0
  },
  {
    "commentText": "Police should be doing sting operations to catch these ppl. Put an undercover cop in a mall with a MAGA hat. The 1st amendment is under assault.",
    "likes": 10
  },
  {
    "commentText": "Find the guy who did it and tie his ass to a tree and lite him on fire.",
    "likes": 1
  },
  {
    "commentText": "That’s the tolerant left for you",
    "likes": 0
  },
  {
    "commentText": "Leftists are truly disgusting. This shows how low they'll go to get their way. How despicable.",
    "likes": 0
  },
  {
    "commentText": "They're only capable of cowardly acts bc they're pussies",
    "likes": 0
  },
  {
    "commentText": "this is why the blood of liberals will be running through the streets like a fine red wine once they push patriots past the point of no return",
    "likes": 9
  },
  {
    "commentText": "Put it on my older car 😂",
    "likes": 0
  },
  {
    "commentText": "The moron probably set him or herself ablaze afterwards trying to get away.",
    "likes": 0
  },
  {
    "commentText": "I can’t even wear my MAGA hat in California 😡",
    "likes": 2
  },
  {
    "commentText": "Everyone throw eggs all over cars with liberal / communist bumper stickers.",
    "likes": 12
  },
  {
    "commentText": "get a new truck with trump painted on the side!!!",
    "likes": 0
  },
  {
    "commentText": "I just added this video to a playlist I my You Tube channel titled \"This is The \"Tolerant\" Left\". It has become one of my longest playlists.",
    "likes": 0
  },
  {
    "commentText": "This is a result of the media brainwashing the populatuon to think a certain way. Even if everyone's 401ks went to 500 percent and the unemployment rate dropped to zero; people would still run to their tv's and turn on CNN to get their opinion because they only have enough IQ points to walk upright and cannot possibly form their own opinions.",
    "likes": 1
  },
  {
    "commentText": "The truck didn't support Trump. I guess Democrats are too afraid of confrontation to stand up to anyone. This is why as a life long independent I can't vote Democrat, I don't like people that do things like this.",
    "likes": 22
  },
  {
    "commentText": "Normal from Obama supporters to do this.",
    "likes": 0
  },
  {
    "commentText": "im in Los Angeles,ShittyFORNIA and i was flipped off by an old liberal couple cuz of my TRUMP sticker",
    "likes": 0
  },
  {
    "commentText": "This IS Hillary Clinton's America: Let THAT sink in.",
    "likes": 25
  },
  {
    "commentText": "Where is the freedom of speech when u need it?",
    "likes": 0
  },
  {
    "commentText": "liberals sure want a civil war and to get shot in quantity..",
    "likes": 0
  },
  {
    "commentText": "I work in Berkeley..my truck would be burned to thr ground...No question.",
    "likes": 0
  },
  {
    "commentText": "Lock these criminal up",
    "likes": 1
  },
  {
    "commentText": "Buy an American made truck with the insurance money!",
    "likes": 7
  },
  {
    "commentText": "I believe it, the Left is infested with violent, crybaby Fascists.",
    "likes": 0
  },
  {
    "commentText": "Well it's about that time to put the high voltage Trump sign back on the lawn.",
    "likes": 0
  },
  {
    "commentText": "Businesses have to pretend to support the left or they get their windows broken. It won't be long before leftist mobs occupy voting stations to enforce correct voting.",
    "likes": 4
  },
  {
    "commentText": "Fucker drives a nissan. Get a real truck!",
    "likes": 0
  },
  {
    "commentText": "when u cant afford the payments slap on president trump bumper sticker  genius",
    "likes": 2
  },
  {
    "commentText": "Rookies , the owner survived . 🔫",
    "likes": 0
  },
  {
    "commentText": "Screw it.  I'm getting some Armerican flags to sport on my vehichle.",
    "likes": 0
  },
  {
    "commentText": "That's terrorism.",
    "likes": 0
  },
  {
    "commentText": "heck maybe his wife saw him flirting in the bar,and torched it,..\nmaybe he did it himself because hes losing his ass in payments on an over priced vehicle,\nmy grandfather told me dont believe anything you hear,and only half of what you see..\ngreat try though.!",
    "likes": 0
  },
  {
    "commentText": "Democrats are so much used to food stamps lazy don’t want to work they are scared food stamps are going away",
    "likes": 0
  },
  {
    "commentText": "Funny how the name Trump didn’t burn. You can’t stop the Trump!!!!",
    "likes": 58
  },
  {
    "commentText": "Find, and arrest them.",
    "likes": 0
  },
  {
    "commentText": "Proof it \nYou cant claim anything without proof\nLike 3 million illegal voters\nAny religion\nClimate change doesnt happen\nFlat earth\nTriggle down economics\nObama wasnt a American\nThe creepy orange president is a self made billionair we dont have proof he's a real billionaire",
    "likes": 0
  },
  {
    "commentText": "F this clown and his Nissan Titan truck covered in Trump stickers while FORD just announced massive layoffs due to BILLION dollar+ loss under Trump tariffs. Cant make this sh*t up.",
    "likes": 1
  },
  {
    "commentText": "I don't believe this asshole for a second. Someone torched his truck & he decided to be a \"victim\". More phoney fake news from the Trumpwads.",
    "likes": 0
  },
  {
    "commentText": "my god its the magnet guy, some one give him some head hair and a goatee",
    "likes": 0
  },
  {
    "commentText": "The Fascist left is looking for a fight they will surely lose.  Keep it up.",
    "likes": 3
  },
  {
    "commentText": "Dang...I’m in Washington state...I wonder what town he was in? Oh, never mind...",
    "likes": 3
  },
  {
    "commentText": "I like the irony of them putting a pic of the Portland skyline behind him....",
    "likes": 0
  },
  {
    "commentText": "They're trying to scare republicans not to vote but they really don't know us.  It just encourages us.",
    "likes": 46
  },
  {
    "commentText": "Hope you have good car insurance. Then if the person gets caught they make her pay fully.",
    "likes": 2
  },
  {
    "commentText": "Politically motivated actions like this aimed to intimidate is a textbook definition of terrorism. Liberals have basically become a giant domestic terrorist group and the leaders are calling for this stuff. Time to pump lead into these motherfuckers.",
    "likes": 1
  },
  {
    "commentText": "you have to defend your property ....the police won't...\ncan't leave it at a bar....",
    "likes": 2
  },
  {
    "commentText": "Solution: put Trump stickers on known lefties cars.",
    "likes": 49
  },
  {
    "commentText": "Truck was torched because someone didn't like him or fake news.",
    "likes": 0
  },
  {
    "commentText": "Does insurance cover damage caused by crazy leftists?",
    "likes": 0
  },
  {
    "commentText": "BOYCOTT PORTLAND OREGON",
    "likes": 3
  },
  {
    "commentText": "I have my car vandalized for having Trump bumper sticker. I live in California",
    "likes": 5
  },
  {
    "commentText": "This really PISSES me the F off! POS Liberal Trash! When Obama ran they had all their POS Obama signs up all over the place and no one bothered them, but a Trump supporter can't put a sticker on their truck! F*ckin' Liberal POS! I'm sick of these MFs! F*ckin' Fascists!",
    "likes": 0
  },
  {
    "commentText": "insurance fraud.",
    "likes": 2
  },
  {
    "commentText": "This disgusts me that people are doing this to our fellow Americans",
    "likes": 1
  },
  {
    "commentText": "The scum who do things  like this are the same ones who call US deplorables.",
    "likes": 0
  },
  {
    "commentText": "THEY ARE ABOUT TO BE ROUNDED UP BY MILITARY, I'VE GOT SOME MILITARY FRIENDS TALKING ABOUT POSSIBLE MILITARY TRIBUNALS FOR DOMESTIC TERRORISM.......THEY'RE GOING TO EITHER HANG OR SHOOT THE GUILTY\nTHEY'VE ALREADY GOT LOADS OF INFO ON ANTIFA, THIS IS GOING TO BE HILLARIOUS,",
    "likes": 5
  },
  {
    "commentText": "The people who hate on Trump supporters are just as bad as him. Pathetic country man.",
    "likes": 0
  },
  {
    "commentText": "Lol",
    "likes": 0
  },
  {
    "commentText": "Looks like a mobs handy work to me..",
    "likes": 0
  },
  {
    "commentText": "The party of love and tolerance has become the party of hate and violence. Do we really need people like this in power?",
    "likes": 15
  },
  {
    "commentText": "i hope Trump gets this man a new vehicle just to stick it to those lunatics",
    "likes": 2
  },
  {
    "commentText": "No one believes anything about this \nYour embarrassing yourselves",
    "likes": 1
  },
  {
    "commentText": "I believe him. The Democrats have gone insane!",
    "likes": 60
  },
  {
    "commentText": "lol what do you expect in this idiocracy",
    "likes": 0
  },
  {
    "commentText": "Woah, liberals are really low these days...🤔😔 I feel bad for the guy, I don't agree with Trump 100% but liberals took it too far",
    "likes": 28
  },
  {
    "commentText": "I hope he had full coverage.",
    "likes": 2
  },
  {
    "commentText": "Why did he have a picture of his bumper?!?",
    "likes": 2
  },
  {
    "commentText": "Fake News by Trolls",
    "likes": 0
  },
  {
    "commentText": "This is exactly why I don't put Trump stickers on my truck.",
    "likes": 22
  },
  {
    "commentText": "This is insane.Sorry for you truck.Hope they catch them.",
    "likes": 4
  },
  {
    "commentText": "It is all a big misunderstanding,  the individuals were waxing the truck and while using a high speed buffer it suddenly caught fire. \nSee a logical explanation that  will pass the smell test with the main stream press.",
    "likes": 1
  },
  {
    "commentText": "LOL good",
    "likes": 0
  },
  {
    "commentText": "Antifa does this more than people think in portland, they slash tires,break windows,etc...",
    "likes": 46
  },
  {
    "commentText": "I’m always skeptical of these incidents. I’m not at all surprised if it’s true. The Communist Pigs are violent and destructive so I don’t put anything past them. It’s also possible that this guy is using the current political environment to commit insurance fraud and get a new truck. We’ll see!!!",
    "likes": 2
  },
  {
    "commentText": "If he's Pro-Trump then he might as well burn his own car. Hopefully you get a new one with your stock market profits",
    "likes": 1
  },
  {
    "commentText": "Total Trump derangement syndrome.",
    "likes": 0
  },
  {
    "commentText": "If Democrats really want another civil war, bring it. They will lose badly.",
    "likes": 28
  },
  {
    "commentText": "The Left has become very violent and cruel.",
    "likes": 29
  },
  {
    "commentText": "I live in California, going to vote for Republicans but not telling anyone. I don’t want my house set on fire tomorrow, the liberals are nuts.",
    "likes": 11
  },
  {
    "commentText": "Winter is coming...are y'all ready for another civil war. Better be because they're asking for a fight. Wwg1wga.",
    "likes": 16
  },
  {
    "commentText": "Yeah, Trump-stickered vehicles are far more flammable than the non-stickered variety. It’s just a proven fact that if you put the word “Trump” on anything, it goes bankrupt or burns.",
    "likes": 2
  },
  {
    "commentText": "Typical Washington State loonies!!!!!",
    "likes": 2
  },
  {
    "commentText": "makes me want to bring one of my cars to Portland with Trump all over it and sit with a sniper rifle wait for them to start doing things to put a few holes in some people",
    "likes": 15
  },
  {
    "commentText": "Not driving American truck ?",
    "likes": 1
  },
  {
    "commentText": "Just imagine what the left will do when they get their asses kicked on Nov 6th.",
    "likes": 10
  },
  {
    "commentText": "I heard from a certain Fox host that Trump stickers are super absorbent.",
    "likes": 0
  },
  {
    "commentText": "looks like he just got a new truck",
    "likes": 2
  },
  {
    "commentText": "😅Make Liberals cry again😅😅",
    "likes": 232
  },
  {
    "commentText": "Hillary says Republicans & Trump supporters are responsible for the lack of civility....clearly. Maybe Antifa can direct traffic for her motorcade",
    "likes": 20
  },
  {
    "commentText": "That is so pathetic. I feel so terrible for this guy.  Very sad!",
    "likes": 3
  },
  {
    "commentText": "There's that famous liberal tolerance!",
    "likes": 119
  },
  {
    "commentText": "Does Geico offer Leftist mob insurance?",
    "likes": 16
  },
  {
    "commentText": "Hope that catch that Alt-fascist liberals democrap.",
    "likes": 42
  },
  {
    "commentText": "It was the make liberals cry again that did it. People need dash cams. Catch the perps in the act like the guy that kicked the pro-life woman and lost his job because she recorded everything.",
    "likes": 7
  },
  {
    "commentText": "People need to seriously grow the hell up!!",
    "likes": 6
  },
  {
    "commentText": "LIES / VIOLENCE 2020 - Democratic Dream Ticket",
    "likes": 21
  },
  {
    "commentText": "WATCH MARK DICE ON YOUTUBE! VERY FUNNY!😂😂",
    "likes": 0
  },
  {
    "commentText": "I can see a leftist event getting mowed down to trigger the justifiable violence phase of their failing coup. False flag or not, they can not be seen as the aggressors. I hope everyone is ready, because this is surely in the realm of possibility.",
    "likes": 9
  },
  {
    "commentText": "Too bad he wasn’t in it",
    "likes": 0
  },
  {
    "commentText": "They were sure to steal his tools. That's honestly the lowest you can go. Taking something someone used to make money. They're pathetic.",
    "likes": 52
  },
  {
    "commentText": "I HAVE A TRUMP STICKER AND I AM NOT AFRAID",
    "likes": 41
  },
  {
    "commentText": "WTF? Laura hopes the insurance covers the truck … Ok, how about I hope there is video surveillance of the perpetrator and the useless PoS gets arrested and sent to prison. But that's just me ...",
    "likes": 139
  },
  {
    "commentText": "Is it real??? there must be some another issue.... That's just beyond my wildest imagination... wow",
    "likes": 0
  },
  {
    "commentText": "Vote in the mid terms!  The left needs to be shut down.",
    "likes": 196
  },
  {
    "commentText": "aw..let me play the world's smallest violin....IF I HAD ONE!",
    "likes": 0
  },
  {
    "commentText": "Vote in November for republicans. Stop the lunacy!",
    "likes": 14
  },
  {
    "commentText": "Hopefully the person who did this will be found & prosecuted to the fullest extent of the law.",
    "likes": 232
  },
  {
    "commentText": "I do not display any political stickers or decals on my vehicle nor do I wear political advertising on a t-shirt or a hat. Why ask for trouble...……….",
    "likes": 5
  },
  {
    "commentText": "If I didn’t have to worry about my car getting trashed, I would definitely deck it out with stickers...",
    "likes": 29
  },
  {
    "commentText": "Too bad he wasn't in it.",
    "likes": 0
  },
  {
    "commentText": "California is no different...",
    "likes": 21
  },
  {
    "commentText": "Lol. Believe me, I hate antifa faggots and the intolerant left, but this just sounds ridiculous. You gotta do a LOT more than just have the bumper stickers to get someone torching your vehicle. No one no matter how insanely liberal someone is they're not gonna do that. Dude gotta have enemies somewhere, or insurance fraud lmao. Maybe if this happened during an Antifa riot or something I'd believe it.",
    "likes": 0
  },
  {
    "commentText": "This is why I am afraid to show my support on my vehicle. I don't want my car destroyed.",
    "likes": 107
  },
  {
    "commentText": "I'm voting...\n\nOh yeah....I'm there already",
    "likes": 92
  },
  {
    "commentText": "Democrat's also burnt down a black church ...during the election. \nDemocrat's really are fascist's.",
    "likes": 170
  },
  {
    "commentText": "Insurance fraud.",
    "likes": 7
  },
  {
    "commentText": "The DEMOFASCIOPATHS are running scared!",
    "likes": 74
  },
  {
    "commentText": "Time to set some cars with BETO bumper stickers on fire.",
    "likes": 5
  },
  {
    "commentText": "Hope had full coverage with GAP.",
    "likes": 3
  },
  {
    "commentText": "Liberals are SOFT",
    "likes": 24
  },
  {
    "commentText": "Thumbs up if this isn't a surprise to you",
    "likes": 10
  }
]