[
  {
    "commentText": "To flake Conservatism is losing to the democrats over and over",
    "likes": 0
  },
  {
    "commentText": "To flake Conservatism is losing to the democrats over and over",
    "likes": 0
  },
  {
    "commentText": "Good riddance by Felicia aka Jeff flake",
    "likes": 0
  },
  {
    "commentText": "Take a knee Jeff.",
    "likes": 0
  },
  {
    "commentText": "At least trump saves us from Hillary... GOP been kinda a failure for so many years.  I don't think rubio and Cruz could have beaten hillary",
    "likes": 0
  },
  {
    "commentText": "We've NEVER had descent politics because for the most part, you are all a bunch of liars! At least Trump tells it like it is. I'll take that over your lying ass any day.  You're a traitor to your party and your country. You need replaced by a true Republican, a patriot!  TRAITOR!",
    "likes": 0
  },
  {
    "commentText": "The faux \"republican\" aka McCain syndrome speaks again. Conservative values and decency...hmmmmmmm. From day one of Trump winning the election half this country turned into vile toxic rabid crybaby animals and not one of them has ever shown ANY decency towards the Right. I like my President being honest and real, not a politician like Flake thinks HE is. Change Parties Flake, you're too cuckold to stand up for Americans against the Hate Group called democrats.",
    "likes": 0
  },
  {
    "commentText": "Chief Justice Roberts has requested the 10th Circuit to review multiple ethics complaints made against Kavanaugh. McCullen claimed the scandal would soon be forgotten and Trump made a public and fulsome apology to Kavanaugh's family for …! What? If any complaints are upheld Kavanaugh is in big trouble. Will Trump and McCullen then resign in abject disgrace? Yeah, right! \n\nThe on-going SCOTUS debacle originated in 2016 when McConnell blocked Obama's constitutional right to nominate for the vacant SCOTUS position. That disgraceful situation deteriorated until we now have Justice Kavanaugh, who may soon be declared by his peers to be unfit even to be a Judge. This is all down to the corrupt McConnell, who is unfit even to be a Senator!",
    "likes": 0
  },
  {
    "commentText": "This guy is spineless he shouldn't even be a senator he's a joke and a disgrace to his own state. Go Trump 2020",
    "likes": 0
  },
  {
    "commentText": "Flake is a sour grapes kind of loser. Hope he stays out of politics.",
    "likes": 0
  },
  {
    "commentText": "Flake said nothing wrong. Why shouldn't anyone run against Donald Trump in the 2020 election. The presidency is up for grabs for any candidate. Just because you support Trump doesn't mean you can't run against him.",
    "likes": 0
  },
  {
    "commentText": "Flakey why don't you challenge him? Oh you cant, you'll lose big time!..Jealous much? I thought so!",
    "likes": 0
  },
  {
    "commentText": "Who you Flakey boy? Traitor",
    "likes": 0
  },
  {
    "commentText": "FLAKE ??? HAHAHAHA ! IS HE FOR REAL ??",
    "likes": 0
  },
  {
    "commentText": "I HOPE FLAKE DROPS DEAD FROM A NEW DIEASE HE GETS FROM BEING AN ARROGANT ASSHOLE , WE CAN NAME IT ASSHOLEITITUS",
    "likes": 0
  },
  {
    "commentText": "Only flakes of a backbone left in this coward. Some say... he is nowadays afraid to ride elevators... hmmm ... scumbag",
    "likes": 1
  },
  {
    "commentText": "Flakes name tells you all you need to know. Case closed",
    "likes": 0
  },
  {
    "commentText": "Jeff flake, like john mccain, is an embarrassment for an arizona represenative. The last example being he(along with the dems), had decided already that Kavanaugh was guilty.....the normal process EVERY AMERICAN IS ENTITLED TO being bypassed by all them! How unprofessional, illegal, and anti-american. Shame on them.",
    "likes": 0
  },
  {
    "commentText": "He will not have this job soon!",
    "likes": 0
  },
  {
    "commentText": "I hope Hillary Gets Locked Up\nWho's With Me?",
    "likes": 0
  },
  {
    "commentText": "Jeff you have no balls you should start looking for them",
    "likes": 0
  },
  {
    "commentText": "So he wants to separate the party and the vote. Loser!",
    "likes": 0
  },
  {
    "commentText": "Flack is the interior of the proster the viral organ from which feses is expeled",
    "likes": 0
  },
  {
    "commentText": "They don't call him flakd for nothing...❄❄❄",
    "likes": 0
  },
  {
    "commentText": "Flake is a Flake. Trump will win again in 2020",
    "likes": 0
  },
  {
    "commentText": "Snowflake, why don't you try running against Trump in the primaries? 😂",
    "likes": 0
  },
  {
    "commentText": "Hummm , can my one tell me why some loser Republican has to run against president Trump? By the way , could be good to see that clown running against president Trump to run for president, wht is his name again?  Love America and Americans MAGA in November 2018 then MAGA 2020.",
    "likes": 0
  },
  {
    "commentText": "O say can you see by the dawn's early light, NO , TRUMP VOTERS ARE TOO STUPID TO SEE",
    "likes": 0
  },
  {
    "commentText": "That dude is a flake",
    "likes": 0
  },
  {
    "commentText": "flake sucks someone impeach him or vote him out",
    "likes": 0
  },
  {
    "commentText": "Go away Flacky Flake we're tired of your failed ass her in Arizona hurry up and retire you worthless hack!",
    "likes": 0
  },
  {
    "commentText": "Trump will be gone by 2020.  Go Mueller!",
    "likes": 0
  },
  {
    "commentText": "Say goodbye and shut Up!",
    "likes": 0
  },
  {
    "commentText": "Sure wouldn't be flakey",
    "likes": 0
  },
  {
    "commentText": "Jeff Flake is the standard bearer of conservatism, then John Songbird McCain is the paragon of heroism. Flake is a failed Democrat in a purple state, who could not convince a three year old to eat his peas.",
    "likes": 0
  },
  {
    "commentText": "I hope that freak flake runs. What a traitorous piece of crap. Flake off.haw haw haw. Freaking idioy",
    "likes": 0
  },
  {
    "commentText": "JEFF, \n\nPLEASE!!!\nChallenge PRESIDENT TRUMP!!!\n\nYou couldn't handle those two barking chi Hua Huas in the elevator, HOW are you going to handle PRESIDENT TRUMP?\nJust curious..",
    "likes": 0
  },
  {
    "commentText": "Flake doesn't belong in politics. He isn't a leader.",
    "likes": 0
  },
  {
    "commentText": "Laura Ingraham is a shape-shifting Reptilian alien. It's true. Oh yes, it's true.",
    "likes": 0
  },
  {
    "commentText": "Ben Sasse, Lindsey Graham, Mitt Romney, John Kasich, Cory Gardner, Mike Lee, Dean Heller,  just a few who represent the large portion of the Republican Party who is looking for someone that isn’t Trump. This faction does exist despite the Pro-Trump conservatives aggressive denial of their prominence.",
    "likes": 2
  },
  {
    "commentText": "Jeff Snowflake",
    "likes": 0
  },
  {
    "commentText": "The Flake is on his way out, he is going into the private sector...so obviously he is speaking for his new masters.",
    "likes": 1
  },
  {
    "commentText": "Love and Respect our Awesome President TRUMP!!!! Women for TRUMP2020!!!!",
    "likes": 0
  },
  {
    "commentText": "**DUMB REPUBLICANS, LIKE TRUMP, SHOULD BE SEEN AND NOT HEARD, THE REPUBLICAN STRATEGIES ARE FALLING APART**",
    "likes": 2
  },
  {
    "commentText": "IT WON'T BE JEFF FLAKE...HE IS NEITHER CONSERVATIVE, NOR DECENT...  HE'S A LOSER...A SORE LOSER.  BUM... EVERYONE IS SOOOOOOOOOOOOOOOOOO  GLAD HE'S GONE.",
    "likes": 1
  },
  {
    "commentText": "What a jerk.",
    "likes": 0
  },
  {
    "commentText": "ABCBT 2020 = ANy Body Can Beat Trump in 2020.",
    "likes": 0
  },
  {
    "commentText": "If Flake had it his way. Protesters would be running this country.",
    "likes": 0
  },
  {
    "commentText": "Go away FLAKE.",
    "likes": 0
  },
  {
    "commentText": "The only trick left in the bag for donnie is the pity card. People will feel sorry for the sucker for his utter incompetence. They will accept the fact that he was never presidential material and perhaps feel sorry for him, ceteris paribus. But, they will never elect him to another term.",
    "likes": 0
  },
  {
    "commentText": "When he asked for a 7th FBI investigation a reporter asked him \" would you have that if you were running for re-election?\". His answer \" oh no\". And then laughed.",
    "likes": 0
  },
  {
    "commentText": "This one has to be the biggest spineless coward to step in the Capitol building in my lifetime.",
    "likes": 0
  },
  {
    "commentText": "Flake, YOU don't know what Conservatism is, how can you suggest that other's learn what it means? You don't believe in innocent until proven guilty! Flake is the replacement for McCain! A RINO wolf in sheep's clothing! Vote HIM OUT!",
    "likes": 0
  },
  {
    "commentText": "SNOW FLAKE .....  just MELT it OUT!!!!!!!!!!",
    "likes": 0
  },
  {
    "commentText": "Flake needs to go he is weak I will never vote for him again",
    "likes": 0
  },
  {
    "commentText": "I think democrat Alfred E. Neuman will run against trump.",
    "likes": 0
  },
  {
    "commentText": "As Harland Dorrinson said: “Hang in there, Melania. Black is white, up is down, and Republicans are defenders of Medicare.”",
    "likes": 0
  },
  {
    "commentText": "I live in Arizona, FLAKE IS A F***ING DISCRACE for us!!!! The ONLY good thing this IDIOT did was to vote for Kavanaugh and resign his seat for Martha McSally (fingers crossed)....",
    "likes": 0
  },
  {
    "commentText": "your nose is indecent. you fluke",
    "likes": 0
  },
  {
    "commentText": "What a weak A Hole.... snow flake who looks like he has the flue combined with diarrhea",
    "likes": 0
  },
  {
    "commentText": "How disappointed his family must be to know that he is an absolute coward without any spine. Not a good roll model. His poor kids, knowing their old man has a huge yellow streak running down the middle of his back.",
    "likes": 0
  },
  {
    "commentText": "Go back to your illegal non tax paying Mexicans in Arizona.",
    "likes": 0
  },
  {
    "commentText": "Straighten your nose first before you try to straighten todays politics.",
    "likes": 0
  },
  {
    "commentText": "Flake, you're a RINO just like your buddy McStain...and you're done here. Have a nice life living back in your state where your name is MUD.",
    "likes": 1
  },
  {
    "commentText": "Laura ingraham stop sucking up to trump. His china policies aren't working stupid trade wars",
    "likes": 0
  },
  {
    "commentText": "I agree we need to restore decency in our political system and u do that by getting rid of TRAITOR trump",
    "likes": 0
  },
  {
    "commentText": "92% of Republicans are supporting this president is a result of cowardice and because they suck up to trump by having no spine",
    "likes": 0
  },
  {
    "commentText": "laura ingraham forget to mention trumps disastrous approval rating",
    "likes": 0
  },
  {
    "commentText": "Total WIMP!!",
    "likes": 0
  },
  {
    "commentText": "Sorry  Flake you  are yssup bacwards",
    "likes": 0
  },
  {
    "commentText": "Flake is a disgrace to the CONSTITUTION.\nWhat a babbling dope.",
    "likes": 0
  },
  {
    "commentText": "Flake is a mobocrat in sheep's clothing. He's about as conservative as Aunty Maxipad.",
    "likes": 0
  },
  {
    "commentText": "Flake is a Democrat",
    "likes": 1
  },
  {
    "commentText": "Even Hillary Clinton can beat Jeff Flake!",
    "likes": 1
  },
  {
    "commentText": "I just threw away a pair of stinky shoes. I now realize it wasn't the shoes after hearing and watching a few seconds of (THE FLAKE). He just leaves a revolting stink when seen or heard. DON JR 2024!!!",
    "likes": 2
  },
  {
    "commentText": "hey Flake why don't you run ....",
    "likes": 0
  },
  {
    "commentText": "Fliggity Flake!!!! What a fake!!!!",
    "likes": 0
  },
  {
    "commentText": "Why don't you run against him jeff?",
    "likes": 1
  },
  {
    "commentText": "Flake you voted for Justice Kavanaugh thank you. Now step down and keep your biased opinions to yourself .",
    "likes": 0
  },
  {
    "commentText": "He should decamp to the left demonrats party, he's not part of us a sell out.",
    "likes": 0
  },
  {
    "commentText": "flake the democrat",
    "likes": 1
  },
  {
    "commentText": "I think somebody punched him in the nose some time ago.",
    "likes": 0
  },
  {
    "commentText": "Bring it on! They would get rekt!",
    "likes": 0
  },
  {
    "commentText": "Hey jeff shhhhh",
    "likes": 0
  },
  {
    "commentText": "in 2020 Trump, Don Jr and Jared will be challenged in jail by other large Primates. Can't wait.",
    "likes": 1
  },
  {
    "commentText": "Dang Rino flake!",
    "likes": 0
  },
  {
    "commentText": "There is a reason his last name is flake even his ancestors know who he is. If I was him I'd start with a new last name he learned it from somewhere. Maybe spending too much time with Obama and Hillary.",
    "likes": 1
  },
  {
    "commentText": "Good thing Flake is retiring!",
    "likes": 0
  },
  {
    "commentText": "Please put that pathetic worm back under the rock from which he crawled and don’t give him air time.",
    "likes": 0
  },
  {
    "commentText": "Maybe he should run against Trump, you know, put his values to the test.\nLmao",
    "likes": 0
  },
  {
    "commentText": "Flake: RINO, what a pos!",
    "likes": 0
  },
  {
    "commentText": "Flake is a rhino and a back stabber .",
    "likes": 0
  },
  {
    "commentText": "Ingraham 'that means the whole party is a fraud'. Wow! Ingraham finally said something true! The GOP has surrendered its traditional values and its claim to be the party of morality and decency and devolved into the party of Trump. Turning a blind eye to all the lying, spitefulness, corruption, chaotic hypocrisy just to cling to power. Ingraham and Hannity and all their Fox buddies don't care about the direction the GOP is going in, they don't care that Lincoln and Reagan are spinning in their graves,  the just care about their personal brands and making money from their relentless pro-Trump spin. CNN do the same thing from the other direction. But the center they all spin around is Trump. Self-serving politics reported on by self-serving hacks.",
    "likes": 1
  },
  {
    "commentText": "Jeff Flake, go ahead run against Trump in the primary Trump will turn you into his breakfast Flakes dump milk on you devour you and the unusable remains of you will end up in the sewer which could be all of you.",
    "likes": 0
  },
  {
    "commentText": "Flake needs that nose straightening.",
    "likes": 0
  },
  {
    "commentText": "Straighten your nose out, flake, and get back with us in about a hundred years idiot.",
    "likes": 2
  },
  {
    "commentText": "Jake Flake what a joke hasn't been the same since the elevator incident and the anti room on the hearing. Unbelievable how week you have to be to instantly turn after 1 incident. I know he's a republican but i seriously cann't take this stupid Left party anymore all their lies and corruption",
    "likes": 0
  },
  {
    "commentText": "Jeff Flake is a total idiot and scared of his own shadow, glad he is not seeking reelection, do not see how he survived this long.",
    "likes": 0
  },
  {
    "commentText": "Run against Trump, flake. Put your money where your mouth is. Or maybe you don't have the stones for it?",
    "likes": 1
  },
  {
    "commentText": "Ingrahams redicule is all too typical of her ...making millions spewing hate",
    "likes": 0
  },
  {
    "commentText": "So if he is the minority in his party and has a low approval rating his opinion is not worth considering? That is what I got from this segment. What a prick. As though we shouldn't except better from our presidents. It isn't like you can't play hardball while not being overtly inflammatory.",
    "likes": 0
  },
  {
    "commentText": "Everybody wearing black?",
    "likes": 0
  },
  {
    "commentText": "Flake needs to be voted out.",
    "likes": 0
  },
  {
    "commentText": "Flake is a pos",
    "likes": 0
  },
  {
    "commentText": "Not going to happen,",
    "likes": 0
  },
  {
    "commentText": "Flake we need a leader. There is no decency in politics. If anything Trump is returning us to decency by fighting for it. You give respect you get it in return.",
    "likes": 0
  },
  {
    "commentText": "Donald Trump is not too conservative and definitely not decent, that much is true. Could the Republican Party use a strong, decent conservative for the run in 2020? Sure. Do they need Jeff Flake to explain this to them? Oh hell no!!",
    "likes": 1
  },
  {
    "commentText": "RINO scum.",
    "likes": 0
  },
  {
    "commentText": "Jeff Flake is so pathetic in his attempts to distance himself from Trump, considering he votes with him like 86% of the time",
    "likes": 0
  },
  {
    "commentText": "Yes ingraham, your party is a fraud.",
    "likes": 1
  },
  {
    "commentText": "Flakey  puf   another   beaten up by wife  cuk",
    "likes": 0
  },
  {
    "commentText": "Just give it up Flakey Flake. 🇺🇸💪",
    "likes": 0
  },
  {
    "commentText": "They hate flake because they're turning blue.",
    "likes": 0
  },
  {
    "commentText": "Flake got CONNED BY TWO DISHONEST ACTIVISTS FINANCED BY SOROS !  FLAKEY HERE reacted to IMMOTION & needs to get into a shelter for the emotionally disadvantaged!",
    "likes": 0
  },
  {
    "commentText": "A Flake Rally would be BORING!!",
    "likes": 0
  },
  {
    "commentText": "God bless President Trump \nWWG1WGA.",
    "likes": 0
  },
  {
    "commentText": "Flake is a Democrat dress as a Republican, because idiot like this that POTUS cannot pass anything . The best a real publican could challenge the seat of Flaky Crust.",
    "likes": 0
  },
  {
    "commentText": "FLAKE IS A POS!!! NEEDS HIS MOUTH SEWN SHUT! JUST SAYING OLD ONE LEGGED JOSEPH T RETIRED NAVY",
    "likes": 0
  },
  {
    "commentText": "Jeff Flake is an asshat...that's why his nose is crooked. The people of his own State hate him, which is why he's dropping out. Who cares what this creep has to say. Mitt Romney, Evan McMullin and Jeff Flake: the Never-Trump Power Team! lolol Just get the hell out Jeff, before you embarrass yourself any further.",
    "likes": 0
  },
  {
    "commentText": "Trying to get that CNN job ehhh flakey",
    "likes": 0
  },
  {
    "commentText": "\"Snow\" Flake!  someone should break his nose again and adjust it... so he can smell his own bullshit...",
    "likes": 1
  },
  {
    "commentText": "It won't be Flake running, he stands by his name...lol",
    "likes": 0
  },
  {
    "commentText": "Jeff “tired of winning” Flake \nJeff “low energy” Flake\nJeff “the flake” Flake\nJeff “low T” Flake",
    "likes": 0
  },
  {
    "commentText": "I am amazed at how Flake's move vis-a-vis the Kavanaugh investigation turned out to help Kavanaugh and Trump.  I truly believed this dimwit traitor actually INTENDED to hurt Kavanaugh and Trump.  He is just a smarmy weasel.",
    "likes": 0
  },
  {
    "commentText": "He's a deluded buffoon if he thinks anyone respects his flaky ass.",
    "likes": 0
  },
  {
    "commentText": "Flake is an indecent buffoon.",
    "likes": 0
  },
  {
    "commentText": "Flake's nose is so crooked because he had it up Obama's ass for 8 years!",
    "likes": 0
  },
  {
    "commentText": "Why would anyone want to challenge one of the most successful Presidents in US history? I bet Democrats don't even want to challenge Trump in 2020, because once you lose an election the only way you can run a second time is if your last name is Clinton. You think Kamala Harris or Corey Booker want to be known as losers?",
    "likes": 0
  },
  {
    "commentText": "Flake needs to disappear from the spot light for the rest of eternity. Way too stupid.",
    "likes": 0
  },
  {
    "commentText": "Jeff Flake needs to be reminded about conservatism.",
    "likes": 0
  },
  {
    "commentText": "Jeff Flake is a RINO. What a loser. Arizona deserves better than that piece of 💩",
    "likes": 0
  },
  {
    "commentText": "\"92% of Republicans are supportive of the president\".\nWhere the F** you get your facts from? What will you report after the mid-terms? \" Republicans support the president but not congress\"? No, that is called a referendum against the president.\nCan FOX actually present real news? I have tin foil but I also have a sack of potatoes I plan to bake.",
    "likes": 1
  },
  {
    "commentText": "We will literally lose 100% if Trump is not the Republican Nominee in 2020.",
    "likes": 0
  },
  {
    "commentText": "Flake is a trader",
    "likes": 0
  },
  {
    "commentText": "Conservatism is Trump you flaky RINO",
    "likes": 0
  },
  {
    "commentText": "Snowflake ❄️",
    "likes": 0
  },
  {
    "commentText": "IT WONT BE YOU FLAKE",
    "likes": 0
  },
  {
    "commentText": "Snow Flake!",
    "likes": 0
  },
  {
    "commentText": "His last name fits him to a T👍",
    "likes": 0
  },
  {
    "commentText": "Flake is the only fraud here. No wonder he's not running for office",
    "likes": 0
  },
  {
    "commentText": "John Kasich has been asked if he would by Chris Matthews. Will be interesting to see who would attempt it.",
    "likes": 0
  },
  {
    "commentText": "flake the democrat",
    "likes": 0
  },
  {
    "commentText": "Flake got bullied by couple of paid psycho activists.  Bye bye flake",
    "likes": 0
  },
  {
    "commentText": "If FLAKE doesn’t have enough 🔴🔴’s to STAND with his PARTY... He should STEP DOWN!",
    "likes": 0
  },
  {
    "commentText": "Who would think a guy named flake would be a you know I can't find the  word a a a a a a  FLAKE",
    "likes": 0
  },
  {
    "commentText": "Cowering RINO!",
    "likes": 0
  },
  {
    "commentText": "I can hardly bare to look at Flake. The spineless, crawling cockroach.",
    "likes": 0
  },
  {
    "commentText": "Trump is destroying the new world order and those who want it, can't stand him.",
    "likes": 0
  },
  {
    "commentText": "Get him out of his seat. Flake will melt",
    "likes": 0
  },
  {
    "commentText": "Flake is a chick",
    "likes": 0
  },
  {
    "commentText": "He's like a spy for them dems. A true R.I.N.O. (Republican in name only)",
    "likes": 0
  },
  {
    "commentText": "If ANYONE runs against trump in 2020 they can kiss their political career, party funding, and k street retirement plan goodbye. Trump has exposed clowns like Fairy Flake and they can’t stand it. Trump is the face and voice of the right now. Good riddins Fairy Flake, your scum!",
    "likes": 0
  },
  {
    "commentText": "How has this got more likes than dislikes utube playing funny business again because all the comments hate flake",
    "likes": 0
  },
  {
    "commentText": "Snow flake",
    "likes": 0
  },
  {
    "commentText": "Flakes Name suit him perfectly.",
    "likes": 0
  },
  {
    "commentText": "Maybe he thinks we need to give a little to the liberals and then we'll all be united.  That's delusional.  He gave them the FBI investigation.  Nothing but 100% liberal will be enough for them.",
    "likes": 0
  },
  {
    "commentText": "flakes is a looser good riddance",
    "likes": 0
  },
  {
    "commentText": "Jeff Flake looks like he is becoming a Democrat.",
    "likes": 0
  },
  {
    "commentText": "Aaa yes, jake the snow flake   Lol",
    "likes": 0
  },
  {
    "commentText": "Flake has the RIGHT TAG - FLAKE!!!",
    "likes": 0
  },
  {
    "commentText": "Flake Flakk or Flakk Flake?",
    "likes": 0
  },
  {
    "commentText": "REMEMBER TO VOTE OUT EVERY DEMON RAT CRIME FAMILY IN NOVEMBER !!",
    "likes": 0
  },
  {
    "commentText": "Time to shut up and go away.",
    "likes": 0
  },
  {
    "commentText": "Flake is a loser. Who cares who runs against trump because anyone with half a brain knows 2020 is trump's that election is over he needs to think about 2024 and even then the people will vote for who ever trump asks the people to vote for in 2024.",
    "likes": 0
  },
  {
    "commentText": "Bent nose looking weirdo.",
    "likes": 0
  },
  {
    "commentText": "Flake is a flake and a RINO. \nHe’s the bad conservatives of which he speaks!",
    "likes": 0
  },
  {
    "commentText": "what a stupid moron, who voted for this soy boy ?? Cmon flake, gfy spine less pos",
    "likes": 0
  },
  {
    "commentText": "Flake needs to just go away he is a sad sad Republican",
    "likes": 0
  },
  {
    "commentText": "Flake sucks, AZ needs to step in a outs this clown.",
    "likes": 0
  },
  {
    "commentText": "Trump has governed the most conservatively in my lifetime.",
    "likes": 0
  },
  {
    "commentText": "its no wonder that his nose is broke... i bet it felt real good to bust that nose.",
    "likes": 0
  },
  {
    "commentText": "Traitor scum",
    "likes": 0
  },
  {
    "commentText": "Him being in office is now considered past tense.",
    "likes": 0
  },
  {
    "commentText": "Flake is a deep state dope. He's so far off path and turned in the wrong dierection, that his nose it trying to correct him.",
    "likes": 0
  },
  {
    "commentText": "He earned his name.",
    "likes": 0
  },
  {
    "commentText": "Haha... u need a silent weak politician like him, surely not conservatives",
    "likes": 1
  },
  {
    "commentText": "Would that worthless flake know ANYTHING about conservatism?",
    "likes": 0
  },
  {
    "commentText": "He's a Rino !! He just clashed with POTUS !",
    "likes": 0
  },
  {
    "commentText": "I hope Flake challenges Trump in 2020.  I would love the opportunity to vote against Flake.",
    "likes": 0
  },
  {
    "commentText": "Your Fired Flake!! Your a traitor!!! You just landed in the Left’s Plantation!!",
    "likes": 0
  },
  {
    "commentText": "Who? You Mr. Flake? Then we'd have a coward in there. I'm sure we could find some bones in your big old closet to rattle.",
    "likes": 0
  },
  {
    "commentText": "ZERO chance of that happening as Trump is the GOP and the base wouldn't support anyone else 😄",
    "likes": 0
  },
  {
    "commentText": "BYE FLAKE! don’t let the door hit ya on the way out! you will not be missed. \nMAGA👍🏻🇺🇸🤓",
    "likes": 0
  },
  {
    "commentText": "Pull your lip over your head and swallow asshole.",
    "likes": 0
  },
  {
    "commentText": "Trump will win in 2020",
    "likes": 0
  },
  {
    "commentText": "Flake wouldn’t make a pimple on Trump’s rear!",
    "likes": 0
  },
  {
    "commentText": "Flake.... you run!",
    "likes": 0
  },
  {
    "commentText": "Mr. Flake, \n\nDo us a favor and sack it mate.  You were already backed into a corner by the democrats, you validated their behavior, and now you have the nerve to say something like that? Please just get up and walk away.... your own home state could care less about you. You've already proven where you stand. Watching enemies like this just reminds me of the 8 years the republicans could not stand for anything....",
    "likes": 0
  },
  {
    "commentText": "Flake did the right thing by voting for kavanaugh but other then that he's a worm and a loser",
    "likes": 1
  },
  {
    "commentText": "Flake is DEPLORABLE!!",
    "likes": 1
  },
  {
    "commentText": "well if the dems keep being paid thuggi€$ for g€0Rge S°R0$ ☆○●\nThen they will hand it to him on a silver platter.\nwink great job 👁",
    "likes": 1
  },
  {
    "commentText": "An I hope it is you Mr. Flake.",
    "likes": 0
  },
  {
    "commentText": "So big deal , Jeff Flake is jealous of President Trump ...",
    "likes": 0
  },
  {
    "commentText": "Snowflake reminds me of Deputy dog",
    "likes": 0
  },
  {
    "commentText": "Give it up, Flake. You are a failure as a politician.\nNO ONE WILL BEAT TRUMP.\nYou're a real dumbass",
    "likes": 0
  },
  {
    "commentText": "He likes losing",
    "likes": 0
  },
  {
    "commentText": "If someone does run against Trump, whoever they may be, I'll bet they are not a \"Flake\"!!",
    "likes": 0
  },
  {
    "commentText": "This guy certainly lives up to his name. He is a flake in every sense of the word.",
    "likes": 0
  },
  {
    "commentText": "POS SOB",
    "likes": 0
  },
  {
    "commentText": "Flake wouldn't know what Conservatism was if it hit him in his crooked nose!  Politics isn't beanbag, shut your whiney mouth, take your toys, and go back to Snowflake, AZ.",
    "likes": 0
  },
  {
    "commentText": "Jeff Fake!",
    "likes": 0
  },
  {
    "commentText": "Nope.   Dumbass.        Flake needs to Go Away",
    "likes": 0
  },
  {
    "commentText": "We have the president we want. Sit down and shut up.",
    "likes": 0
  },
  {
    "commentText": "I 💓 Trump!!!",
    "likes": 0
  },
  {
    "commentText": "FLAKE IS JUST ANOTHER GOP FLAKE",
    "likes": 1
  },
  {
    "commentText": "too soon??/  all that McDonalds ... its going to ketchup Donny!!   get it,... catch up... ketchup.... thought I would explain that for his base!!",
    "likes": 0
  },
  {
    "commentText": "Soros must be paying that traitor well",
    "likes": 0
  },
  {
    "commentText": "I hope Flake grows a pair some day but its doubtful,once a beta male always a beta male.",
    "likes": 0
  },
  {
    "commentText": "Is his first name Snow!🤪",
    "likes": 0
  },
  {
    "commentText": "Ingraham is correct. The whole party is a fraud.",
    "likes": 1
  },
  {
    "commentText": "Flake is a flake",
    "likes": 0
  },
  {
    "commentText": "the only one I want to challenge Donny in 2020 is his maker!!",
    "likes": 0
  },
  {
    "commentText": "Tough talk from a balless sissy guy. Yeah right!",
    "likes": 0
  },
  {
    "commentText": "What a flake",
    "likes": 0
  },
  {
    "commentText": "\" We need a change this 4.2 gdp is awful ! We must as Americans end this amazing economy yours truly \"Flake\" 😂",
    "likes": 0
  },
  {
    "commentText": "Sir Flake of Snowflake, White Knight of the snowflakes",
    "likes": 0
  },
  {
    "commentText": "Your last name says it all FLAKE",
    "likes": 0
  },
  {
    "commentText": "He does not impress me, no backbone.",
    "likes": 0
  },
  {
    "commentText": "Flake is a flake\nPeriod",
    "likes": 0
  },
  {
    "commentText": "Flake, you can kiss my ass😙",
    "likes": 0
  },
  {
    "commentText": "Arizona has the worst Politicians. With John McStain and this Flaky Flake",
    "likes": 0
  },
  {
    "commentText": "I don't want to be \"decent\" I want to win jackoff  >:U",
    "likes": 0
  },
  {
    "commentText": "POS flake f**k off",
    "likes": 0
  },
  {
    "commentText": "Flake the republican-Democrat, is his home next door to Waters.",
    "likes": 0
  },
  {
    "commentText": "Flake is the afterbirth of a rotten bastard rat. He is almost as low as John Mc worm food",
    "likes": 0
  },
  {
    "commentText": "Trump/Kanye2020. 💪🐸👌",
    "likes": 1
  },
  {
    "commentText": "Trump is the only president in a long time who has CONSERVED anything.",
    "likes": 0
  },
  {
    "commentText": "He is just taking off his demonrat mask.",
    "likes": 0
  },
  {
    "commentText": "Send Flake to my house I will straighten his nose out",
    "likes": 0
  },
  {
    "commentText": "Hey Flake. GO FY!",
    "likes": 0
  },
  {
    "commentText": "He's a flake.",
    "likes": 0
  },
  {
    "commentText": "Flake fix your nose",
    "likes": 0
  },
  {
    "commentText": "Go for it, Flakey.\n\n\nYou'll get spanked worse than Jeb Bush did though.",
    "likes": 0
  },
  {
    "commentText": "Are you kidding me!!! This guy.",
    "likes": 0
  },
  {
    "commentText": "Flake is a jerk..bought out.  No need to get his opinion on any level.",
    "likes": 0
  },
  {
    "commentText": "Dumbass.",
    "likes": 0
  },
  {
    "commentText": "Donald Trump is the new look of the Republican party, it was about time. Get used to it Jeff.",
    "likes": 0
  },
  {
    "commentText": "Yeah me too...but it won't be you, you spineless weasel.",
    "likes": 1
  },
  {
    "commentText": "Wow fox does not like anyone who say anything bad about trump jesus",
    "likes": 0
  },
  {
    "commentText": "Flake, bitter to the end.",
    "likes": 1
  },
  {
    "commentText": "He will have to wait for twelve years until President Trump and President Pence finish their terms.😏",
    "likes": 1
  },
  {
    "commentText": "\"FLAKE OFF\" Jeff. Heard he is not up for reelection. Then Flake needs to go quietly.",
    "likes": 1
  },
  {
    "commentText": "OMG Flake. You are a LOSER!",
    "likes": 0
  },
  {
    "commentText": "Globalists have no space in America bc we don’t need the globe",
    "likes": 1
  },
  {
    "commentText": "Flake is delusional",
    "likes": 1
  },
  {
    "commentText": "Wow! That one Laura chik boy she sure can run that mouth of hers tho! What state is she a candidate for the U S Senate in? Prolly none because her mouth is unelectable!! LOL",
    "likes": 0
  },
  {
    "commentText": "If Trump came out tomorrow and said how great Flake is, the comments here would do nothing but praise the man. I bet you’re all loving Kanye West, right now. He can say MF in the Oval Office, that’s cool. Another Great Again day for America. Time to clap, like it’s North Korea.",
    "likes": 2
  },
  {
    "commentText": "Why does Flake constantly look like he's 2 seconds away from crying?",
    "likes": 0
  },
  {
    "commentText": "Flake is weak sit down and shut up.",
    "likes": 0
  },
  {
    "commentText": "When Democrats go high' they start shitting on the sidewalks and asking for clean needles. Democrats just use people. You think Kenya West would have voice if he supported the democrats? The reason Kenya West has a voice. He's supporting Trump. If your black and hispanic? Either you hate Trump or Love Trump there is interest about your choice in the media. Kenya would be lost in the jungle of Democrats voters and supporters if he didn't support Trump. Don't let Democrats and Republicans use you like a free product.",
    "likes": 0
  },
  {
    "commentText": "Flake(R) talking about conservatism is a joke.",
    "likes": 1
  },
  {
    "commentText": "Even a college Grad could beat Trump in the next Election!, but, He will be long gone before that!,,,",
    "likes": 1
  },
  {
    "commentText": "Why dont flake run against president trump? Wanna see flake be humiliated.",
    "likes": 1
  },
  {
    "commentText": "If Jeff Flake ran for re-election, he would have gotten a primary challenger and Trump would have thrown his weight behind that person. Jeff Flake needs to carry his own balls and not let women carry them for him.",
    "likes": 0
  },
  {
    "commentText": "Flake is a FOOL, failed politician for sure!!!",
    "likes": 2
  },
  {
    "commentText": "Haha won't be you flake.\n Oh best move to urha Arizona doesn't want your stupid ass.\n Your a rino butt plug.",
    "likes": 0
  },
  {
    "commentText": "Flake is an idiot.. keeps yapping nonsense",
    "likes": 1
  },
  {
    "commentText": "Duh, the Democrats will have a candidate........who will lose",
    "likes": 1
  },
  {
    "commentText": "\"Flake off, loser!\" Why doesn't HE run against him then? What a whiny wus! Thanks for voting for Kavanagh, Jeff. (Even though you didn't have to.)",
    "likes": 0
  },
  {
    "commentText": "Flake is a disgrace to Arizonans",
    "likes": 90
  },
  {
    "commentText": "Flake is a flake . Traiter .",
    "likes": 1
  },
  {
    "commentText": "Flake is a self centered asshole!",
    "likes": 0
  },
  {
    "commentText": "Flake is a Flake !!!",
    "likes": 1
  },
  {
    "commentText": "Flake is such a fool!",
    "likes": 1
  },
  {
    "commentText": "Flaky... Do you wanna run against him 🤔 So can we look into your paper work 🤓",
    "likes": 0
  },
  {
    "commentText": "Why give this creep air time!",
    "likes": 1
  },
  {
    "commentText": "Flake is the Benedict Arnold of the Republican Party.  F.O.A.D. traitor.",
    "likes": 1
  },
  {
    "commentText": "Thats a laugh the Democrats havent been decent for over 50 years",
    "likes": 1
  },
  {
    "commentText": "Jeff Flake is not a Conservative. Good riddance soyboy! Don't let the door hit you in the a$$.",
    "likes": 1
  },
  {
    "commentText": "Oh, SOMEBODY needs a reminder about conservatism, Flake and it's NOT President Trump, you slimy, self-serving, ball less, back-stabbing little pustule.",
    "likes": 1
  },
  {
    "commentText": "TRUMP2020",
    "likes": 0
  },
  {
    "commentText": "Jeff Snowflake needs to be reminded that he is LOSING! HE IS TIRED OF WINNING! A SECRET DEMOCRAT! VOTE THIS MAN OUT OF OFFICE!",
    "likes": 1
  },
  {
    "commentText": "Jeff Flake should be a democrat.",
    "likes": 0
  },
  {
    "commentText": "What conservativism means????  OMG.  What a clueless RINO",
    "likes": 0
  },
  {
    "commentText": "Jeff Flake is 5 of the 7 dwarves. When he retires there will be party with him and without him.",
    "likes": 0
  },
  {
    "commentText": "18% approval rating is TERRIBLE",
    "likes": 0
  },
  {
    "commentText": "The incumbent always wins you dumbass",
    "likes": 0
  },
  {
    "commentText": "Flake is a flake. Weak little boy. Go away.",
    "likes": 1
  },
  {
    "commentText": "And Flake we all know you are not qualified. Trump would chew you. And spit you out !",
    "likes": 1
  },
  {
    "commentText": "Vote Flake out",
    "likes": 0
  },
  {
    "commentText": "Jeff Flake, can go and FLAKE OFF.",
    "likes": 1
  },
  {
    "commentText": "And I just want to say... Fox what are you doing?  Laura Ingraham is a HUGE talent and you sideline her to little segments...  We need MORE of Laura Ingraham!!!!",
    "likes": 0
  },
  {
    "commentText": "Flake needs to flake off",
    "likes": 1
  },
  {
    "commentText": "Nobody stands a chance flake",
    "likes": 1
  },
  {
    "commentText": "Jeff Flake, what a disgrace; Trump is playing 4D chess. Get on his level.",
    "likes": 0
  },
  {
    "commentText": "Look up flake in the dictionary and youll see his picture. 😂",
    "likes": 1
  },
  {
    "commentText": "Horrible terrible RINO.. We need more capable conservatives to step forward and replace these corrupt establishment lackies who live in the left's hip pocket.",
    "likes": 1
  },
  {
    "commentText": "His name says it all...this is the one that needs replacing...",
    "likes": 0
  },
  {
    "commentText": "Jeff your a pos",
    "likes": 0
  },
  {
    "commentText": "Talk about aptly named. Flake, the genuine flake.",
    "likes": 1
  },
  {
    "commentText": "Seriously;?  Flake? Jeff Flake? Like Snow Flake.....Lol. ROTFLMAO",
    "likes": 0
  },
  {
    "commentText": "Jeff Flake needs to come out of the closet and let everyone know he is really a democrat.",
    "likes": 1
  },
  {
    "commentText": "Traitor",
    "likes": 0
  },
  {
    "commentText": "WE THE PEOPLE would like an encore on President Trump,  thank you very much.\n\nHope it won't be you, flake.",
    "likes": 0
  },
  {
    "commentText": "Senator fake it won’t be you. I’m a Democrat but the Democrats don’t deserve my vote I’m voting for republican all down the ballot in order to move the black agenda! Kanye don’t represent us but trump reach his hands out and a lot of Uncle Tom Democratic blacks voting Democrats but last time I check I’m American so this election I’m going outside the 📦 ! This year I’m a republican",
    "likes": 0
  },
  {
    "commentText": "He has the perfect name flake.",
    "likes": 1
  },
  {
    "commentText": "He looks like he's got a broken nose - I wonder why!!! What a despicable RINO.",
    "likes": 0
  },
  {
    "commentText": "Grow a spine you closet Democrat cuck.",
    "likes": 0
  },
  {
    "commentText": "Go ah head...make our day.",
    "likes": 0
  },
  {
    "commentText": "Somewhere a village is missing an idiot",
    "likes": 1
  },
  {
    "commentText": "Wow, this scumbag is really going deep into the swamp. Must be trying to set up his next job.",
    "likes": 1
  },
  {
    "commentText": "Trump 2020.\nFlake spews. Kinda like fake news. Lol",
    "likes": 1
  },
  {
    "commentText": "I hope Jeff Flake goes away and we never see him again!!!",
    "likes": 1
  },
  {
    "commentText": "Weak and pathetic fake flake I'm so sick to see this loser filthy guy",
    "likes": 0
  },
  {
    "commentText": "He's a Democrat McCain died Democrats put him in when does he come up for election he'll lose big time",
    "likes": 0
  },
  {
    "commentText": "Fake ass",
    "likes": 0
  },
  {
    "commentText": "Flake has always been a snake in the grass",
    "likes": 1
  },
  {
    "commentText": "Fuckin nose is like a dagger 🗡 shut tf up SnowFlake ❄️",
    "likes": 0
  },
  {
    "commentText": "Please go away Jeff.",
    "likes": 2
  },
  {
    "commentText": "WOW Martha is such a   hot beautiful gorgeous mama  ;))",
    "likes": 1
  },
  {
    "commentText": "Flake is a snow flake .  Ask Dan Peña",
    "likes": 0
  },
  {
    "commentText": "FART!!!!!",
    "likes": 0
  },
  {
    "commentText": "Flake needs his face rearranged",
    "likes": 1
  },
  {
    "commentText": "I hope somebody puts a bullet in Flake's head!",
    "likes": 0
  },
  {
    "commentText": "Keep dreaming Flake",
    "likes": 1
  },
  {
    "commentText": "Holder is a rhino! Flake is a good name for him. He is flaky + anti USA.",
    "likes": 1
  },
  {
    "commentText": "Republicans spit on flake",
    "likes": 1
  },
  {
    "commentText": "Flake you are a POS good riddance......run for president my ass you can’t even get re-elected",
    "likes": 0
  },
  {
    "commentText": "Nobody can run against President Trump in 2020. That's obvious, whether you like it or not.",
    "likes": 0
  },
  {
    "commentText": "Jeff Flake had his testicles removed a long time ago.",
    "likes": 1
  },
  {
    "commentText": "The Idiot Trump will be long gone before 2020.",
    "likes": 1
  },
  {
    "commentText": "I hope KLANTIFA straightens out Flakes nostrils for him.",
    "likes": 1
  },
  {
    "commentText": "I hope Flake gets Aids.",
    "likes": 0
  },
  {
    "commentText": "Jeff Corn Flake gives Corn Flakes a Bad Name",
    "likes": 0
  },
  {
    "commentText": "His last name explains it all! Need I say more?",
    "likes": 1
  },
  {
    "commentText": "YOUR PARTY IS A FRAUD. \nTRUMP IS NOT A FISCAL CONSERVATIVE, HE IS A NEO CON/NEO LIB",
    "likes": 1
  },
  {
    "commentText": "Fk u flake",
    "likes": 0
  },
  {
    "commentText": "Photo your vote the dems will cheat",
    "likes": 1
  },
  {
    "commentText": "Putin's Asymmetric Assault on Democracy in Russia and Europe: Implications for US National Security - A Minority Staff Report Prepared for the use of the Committee on Foreign Relations - US Senate, 115th Congress, 2nd Session, January 10, 2018\n\nWhile consolidating his grip on power at home, Mr. Putin oversaw an opportunistic expansion of malign influence operations abroad, targeting vulnerable states on Russia’s periphery, as well as countries in Western institutions like the European Union (EU) and the North Atlantic Treaty Organization (NATO). The Kremlin has substantially increased its investments in propaganda outlets beyond Russia’s borders, funded and supported nongovernmental organizations and political parties that advanced Mr. Putin’s antiEU and anti-NATO agenda, nationalized mafia groups to help launder money and commit other crimes for the state abroad, and used its near-monopoly over energy supplies in some countries to exert influence and spread corruption.\n\nIn semi-consolidated democracies and transitional governments on Russia’s periphery, the Kremlin most aggressively targets states that seek to integrate with the EU and NATO or present an opportunity to weaken those institutions from within. For example, as Georgia and Ukraine moved closer to these institutions, the Russian government attacked them with cyberwarfare, disinformation campaigns, and military force. When the Kremlin’s attempt to politically influence Montenegro’s election failed, its security services allegedly tried to launch a coup. In Serbia, the Kremlin exploits cultural connections and leverages its near monopoly on energy supplies to attempt to slow down or derail the country’s Western integration efforts. And though they are in the EU and NATO, countries like Hungary and Bulgaria face acute challenges from the Russian government, which exerts significant influence in politics, business, and the energy sector. Despite some efforts to counter Russian malign influence, these countries remain significantly vulnerable to the Kremlin’s corrupt agenda.\n\nIn consolidated democracies within the EU and NATO, the Russian government seeks to undermine support for sanctions against Russia, interfere in elections through overt or covert support of sympathetic political parties and the spread of disinformation, and sow discord and confusion by exacerbating existing social and political divisions through disinformation and cultivated ideological groups. This group of countries has developed several effective countermeasures that both deter Russian government behavior and build societal resilience. As it crafts its response, the United States should look to these lessons learned:\n\nThe United Kingdom has made a point to publicly chastise the Russian government for its meddling in democracies, and moved to strengthen cybersecurity and electoral processes.\n\nGermany pre-empted Kremlin interference in its national election with a strong warning of consequences, an agreement among political parties not to use bots or paid trolls, and close cyber cooperation between the government and political campaigns.\n\nSpain has led Europe in cracking down on Russia-based organized crime groups that use the country as an operational base and node for money laundering and other crimes.\n\nFrance has fostered strong cooperation between government, political, and media actors to blunt the impact of the Kremlin’s cyber-hacking and smear campaigns.\n\nThe Nordic states have largely adopted a ‘‘whole of society’’ approach against Mr. Putin’s malign influence operations, involving the government, civil society, the media, and the private sector, with an emphasis on teaching critical thinking and media literacy.\n\nThe Baltic states have kept their publics well-informed of the malicious activities of Russia’s security services, strengthened defenses against cyberattacks and disinformation, and diversified energy supplies to reduce dependence on Russia.",
    "likes": 1
  },
  {
    "commentText": "I would love to vote republican again, conservative policies and philosophies make sense to me...If we could separate the nutbags and the con-men that have taken over, I would vote republican in a second!  Anti-science...anti-investment in anything that doesnt provide a short term gain....and anti-human rights by dictating ridiculous social policies (like checking whats in your pants before getting married, or telling a woman what she can or cannot do to HER body).  Separate that nonsense from the mainstream party, and return to respecting INTELLIGENCE, and I (and many others like me) will come right back",
    "likes": 1
  },
  {
    "commentText": "Jeff flake has a face that needs regular panel beating",
    "likes": 1
  },
  {
    "commentText": "They can challenge all they want, they're not gonna win! Lol  The democrats are a big joke too!!!!",
    "likes": 0
  },
  {
    "commentText": "Now it all makes sense",
    "likes": 0
  },
  {
    "commentText": "Senator Flake, im still waiting a call back from you after writing you 6 times. Your hatred for President Trump has blinded you. No one will oppose him in a Primary. You really think the people want another establishment candidate in? Besides that would b the end of the republican party.",
    "likes": 1
  },
  {
    "commentText": "The Media is going to run against him again in #2020",
    "likes": 0
  },
  {
    "commentText": "Oh, come on, Flaky Flake! You are an idiot traitor. In your demented mind, what you mean by being \"decent\" is being a reprobate Democrat toe sucker. Stop lying you know what being decent is since you think Marxist, criminal, lying Democrats are the ones who are decent.",
    "likes": 0
  },
  {
    "commentText": "Seriously, don't even give snowFlake the attention. His words have absolutely NO value whatsoever.  He's nothing more than a 💩.",
    "likes": 0
  },
  {
    "commentText": "Jeff Flake is a moron",
    "likes": 1
  },
  {
    "commentText": "I am a Republican who is ashamed of our party. The Republicans are spineless cowards afraid of getting rid of this fat orange traitor who needs to be locked up with the traitors at fake Fox news",
    "likes": 1
  },
  {
    "commentText": "RHINO FLAKE",
    "likes": 1
  },
  {
    "commentText": "Such an idiot😡😡🤬🤬",
    "likes": 0
  },
  {
    "commentText": "I hope the good people of Arizona burn his house to the ground.",
    "likes": 0
  },
  {
    "commentText": "Flake shut up go away",
    "likes": 0
  },
  {
    "commentText": "Why does he call his self a republican? He’s a liberal",
    "likes": 0
  },
  {
    "commentText": "And i hope you get voted out your next term",
    "likes": 0
  },
  {
    "commentText": "republican party was pronounced dead,flake,remember?trump saved the whole dam mess,dummy.gave you the playbook to success.but your to busy suckin on titties.get back in the shallows,let the men take care of this one.dummy.or traitor?",
    "likes": 0
  },
  {
    "commentText": "Flake is a fake republican just like that other one from AZ that finally resigned with some help.",
    "likes": 1
  },
  {
    "commentText": "How do you all feel being told what to think everyday by trump and fox news?",
    "likes": 0
  },
  {
    "commentText": "Flake, I hope you rot at Gitmo because you are a traitor to this country.",
    "likes": 1
  },
  {
    "commentText": "Flake is a Beta,cuck crooked nose dipshit.",
    "likes": 1
  },
  {
    "commentText": "Flake 2020",
    "likes": 0
  },
  {
    "commentText": "Flake go live under a rock.",
    "likes": 1
  },
  {
    "commentText": "He represents the dandruff flakes",
    "likes": 0
  },
  {
    "commentText": "I figured this man for a simple coward after I saw the sickening display of him allowing himself to be accosted by some inbred screaming lunatic, but now I see him unequivocally as a complete yellow bellied sniveling coward",
    "likes": 0
  },
  {
    "commentText": "Hillary shouldn't even be allowed to speak on behalf of Democrats anymore",
    "likes": 1
  },
  {
    "commentText": "How did he get his nose broke?  Fight?",
    "likes": 0
  },
  {
    "commentText": "This guy is a national emberassment.",
    "likes": 2
  },
  {
    "commentText": "Flake is a nobody",
    "likes": 1
  },
  {
    "commentText": "No thanks!\n\nNext twit please",
    "likes": 0
  },
  {
    "commentText": "18% that pretty high rating it about 10% . Hopefully he will leave politics",
    "likes": 0
  },
  {
    "commentText": "Obviously Flakes been back slapped in the face.",
    "likes": 3
  },
  {
    "commentText": "Hillary needs to be held accountable for her crimes.  Flake and put in prison for a few",
    "likes": 1
  },
  {
    "commentText": "Why don't you try it Flake???\nYour so smart and full of good ideas according to yourself. What's stopping You? Oh, you realize your brand of repubican ass kissing is washed up and you wouldn't garner but 1% of the vote.",
    "likes": 1
  },
  {
    "commentText": "It's a good thing you're not running for reelection, you moron.  I never want to see your ugly face again.",
    "likes": 1
  },
  {
    "commentText": "Yeah Jeff Flake to has no balls that's why he won't run he's going to flake out does anybody give a s*** with this piece of garbage thanks no ignore this piece of s*** he's a flake he's a passion flakie",
    "likes": 0
  },
  {
    "commentText": "Total asshole. In 2020 Trump will be back stronger than ever.",
    "likes": 0
  },
  {
    "commentText": "Flake is no conservative.",
    "likes": 1
  },
  {
    "commentText": "oh f*ck off flake bye bye",
    "likes": 0
  },
  {
    "commentText": "Kanye makes more sense then Flake.  Nobody wants Flake, even his constituents have seen him for what he is.  Another swamp creature... The people in Arizona don’t like swamp creatures... see ya Flakey",
    "likes": 1
  },
  {
    "commentText": "Jeff Flake is a flake",
    "likes": 1
  },
  {
    "commentText": "Flake Mama's Boy ! TRUMP 2020 .",
    "likes": 1
  },
  {
    "commentText": "Flake is a closet dem",
    "likes": 1
  },
  {
    "commentText": "If you can’t make it, Flake it...",
    "likes": 0
  },
  {
    "commentText": "Sociopath",
    "likes": 0
  },
  {
    "commentText": "Thank goodness Jeff snowFLAKE is leaving the Senate ✌🏻",
    "likes": 1
  },
  {
    "commentText": "What is he even talking about?! I can't wait to see who TRUMP dumps on. Seriously 😂😂😂",
    "likes": 1
  },
  {
    "commentText": "Republicans actually voted for this clown?",
    "likes": 1
  },
  {
    "commentText": "FLAKE is paid for, he's a crook! Investigate him, he's dirty!",
    "likes": 1
  },
  {
    "commentText": "Jeff flake your a dumbass man so go away out",
    "likes": 0
  },
  {
    "commentText": "Innocent until proven guilty isn't decent, Jeff? Please, tell us what conservatism really is, Mr. FLAKE...",
    "likes": 0
  },
  {
    "commentText": "America needs to be reminded what makes America Great Again. Not Flake",
    "likes": 2
  },
  {
    "commentText": "You don't stand a chance against trump ... Flake ..  Trump is the only reason republicans won and the reason republicans will continue to win ... You flake are a loser ... Bye... Trump 2020",
    "likes": 0
  },
  {
    "commentText": "Jeff Flake is a clueless idiot. Inept politicians like him are the REASON Trump was elected!",
    "likes": 1
  },
  {
    "commentText": "So to be a traitor is a real conservative, Flake?? This makes me so angry and I don't ever want to see his face again. He KNOWS what his friend McCain was involved in the middle east and making millions by being a traitor.\n\nHe and his friend McCain  also gave sacred Apache land to a lobbying mining company. What's worse they hid it in a thousand page bill to fund the Pentagon. POS. \nI could go on but how dare he complain about our president and say POTUS is not a true conservative? \nFlake is despicable and good riddance to someone who would rather see our country fail than to work with a man cleaning out Washington's swamp. Telling.",
    "likes": 5
  },
  {
    "commentText": "\"Decent\" is waaay down on our list you piece of garbage! We're trying to get our country back.\nDeep Staters and Swamp RINOs are the ones calling for decency.",
    "likes": 0
  },
  {
    "commentText": "RINO",
    "likes": 1
  },
  {
    "commentText": "Flakey Flake should run in 2020. We need the laughs.",
    "likes": 1
  },
  {
    "commentText": "I hope that Jeff Flake gets a good case of the shitz.",
    "likes": 0
  },
  {
    "commentText": "God please ....lots of people hate Trump...Lots hate Laura too. Whats new....slow news day Fox bitches?",
    "likes": 0
  },
  {
    "commentText": "I am so tired of these career politicians. We as Americans need to demand senators and represenatives have term limits just like the president does. I think that is a constitutional amendment most Americans would agree is fair. First of all it would reduce the likelihood of corrupt politicians, second it would reduce the need for retirement benefits for these elected officials and lastly it would allow for more people to participate in our government by reducing the amount of time elected officials can stay in positions of power.",
    "likes": 8
  },
  {
    "commentText": "Get lost Flake!",
    "likes": 1
  },
  {
    "commentText": "He is part of the problem.",
    "likes": 1
  },
  {
    "commentText": "Trump is not a republican I respect. Flake - I don’t like his policy beliefs, but he is an honorable opponent. Not like the majority. At least he says what he thinks. Everyone else is saying what’s convenient. If everyone is in lockstep then some of them are lying. We, as a country are just not that homogenous.",
    "likes": 1
  },
  {
    "commentText": "I don't think Jeff Flake hates Donald Trump or anyone for that matter.  Hate is not a solution.  We need dialogue in this country, between Democrats and Republicans, between us, we can be different but we are still Americans.  To make America great again, we need to love one another.  President Trump has been the best president we have had in decades.  It is mind boggling how much he has accomplished in just 2 years, wow.  Thank you potus",
    "likes": 1
  },
  {
    "commentText": "flake you are a whoosie.",
    "likes": 1
  },
  {
    "commentText": "The memory of him just standing there in that elevator as that slattern was wagging her finger at him and screaming still sickens me.",
    "likes": 0
  },
  {
    "commentText": "Ha. I was hoping Flake fell into a poorly maintained, dull bladed, running,  wood chipper.",
    "likes": 0
  },
  {
    "commentText": "Jeff is an embarrassment.",
    "likes": 0
  },
  {
    "commentText": "R\nH\nI\nN\nO",
    "likes": 0
  },
  {
    "commentText": "I think he's referring to abrasive speaking when it's totally not necessary, rough or insulting at time for lack of \"charm or etiquette,  even diplomaticallythe \". Let's face it, Obama was a charmer, a speaker of such diplomatically and eloquent in his talks but, basically that's all he was good at. So, if u ask me, I'd rather put up with obnoxious rants and BEAUTIFUL language and get stuff done for America's best interest. Trump cares for our Liberties, our pursuit of happiness and protection of border invaders. Florida running Governor Guillum is to abolish ICE, Medical for everyone, higher taxes on companies, legal weed and what ever else the Global cabal wants because he's endorsed by Obama so he can be the first ever black governor of FloriDUH, Bernie, Soros and the Puerto Rico president.",
    "likes": 1
  },
  {
    "commentText": "Flake should register Democrat and run against Trump.  Do it Flake lol",
    "likes": 1
  },
  {
    "commentText": "Such a beta scum bag. FOX LOVES showing liberals. It's all they show really. Flake is full blown lib swamp creature. His R means nothing.",
    "likes": 0
  },
  {
    "commentText": "This man needs to be kicked out of office",
    "likes": 0
  },
  {
    "commentText": "Jeff flake FAILURE",
    "likes": 1
  },
  {
    "commentText": "Try it Flake. God made Trump President. You battle God and you hate Trump.",
    "likes": 0
  },
  {
    "commentText": "And I thought he was pretty dumb",
    "likes": 0
  },
  {
    "commentText": "Flake is dumber than I thought!  Can’t have it both ways,stooge.",
    "likes": 0
  },
  {
    "commentText": "**  FLAKE IS A FLAKE. *",
    "likes": 0
  },
  {
    "commentText": "Coming from the guy that thought he could grow a pair.",
    "likes": 1
  },
  {
    "commentText": "Flake needs a fist in the mouth. He’s a typical unethical politician of the highest order.",
    "likes": 1
  },
  {
    "commentText": "FLAKE  IS A COMPLETE SPINELESS COWARD ,A DISGUSTING WEAK ,SHAMELESS MORON , OR A TYPICAL DEMOCRAT",
    "likes": 0
  },
  {
    "commentText": "I think he needs to get a back bone... simple... he has the right name",
    "likes": 1
  },
  {
    "commentText": "Ingraham:  GDP growth of 4.2% for one quarter does mean much.  Did you check the stock market results the last few days?  Doubt we'll see GDP growth anywhere near that rate for the rest of Trump's term in office.  \n\nAnd, he figured out NAFTA faster than anyone else? Really?  I'm not sure what we got out of the new deal except perhaps a little more business for auto manufacturers and a slight increase in dairy exports to Canada.\n\n As for putting China back on their heels faster.  All I see is a tit-for-tat tariff war with China.  Let's not give Orange Head any credit for accomplishing anything in that war until there is a new trade agreement in place that is truly beneficial to the U.S..",
    "likes": 0
  },
  {
    "commentText": "Low energy Flake. Name says it all. Like a lost Snow Flake.",
    "likes": 125
  },
  {
    "commentText": "When your own voters kinda hate your guts...",
    "likes": 0
  },
  {
    "commentText": "Jeff Flake wouldn't know conservativism if it bit him on the ass!",
    "likes": 0
  },
  {
    "commentText": "I hope someone punches Jeff Flake in the face",
    "likes": 0
  },
  {
    "commentText": "You can tell which Republicans have been bought off by the left",
    "likes": 1
  },
  {
    "commentText": "Flake is a good last name for him.",
    "likes": 1
  },
  {
    "commentText": "Flake is a FLAKE",
    "likes": 2
  },
  {
    "commentText": "Jeff fake is a turd",
    "likes": 0
  },
  {
    "commentText": "Why don’t you get your sore a*s out and try it yourself Jeff?  I would love to enjoy seeing you being crushed under the Trump train.",
    "likes": 2
  },
  {
    "commentText": "I hope Carly Fiorina challenges him",
    "likes": 0
  },
  {
    "commentText": "FLAKE IS A FAKE, AND A SCUMBAG.",
    "likes": 0
  },
  {
    "commentText": "Jeff Flake always looks like he's passing a kidney stone and is constipated simultanisly..",
    "likes": 5
  },
  {
    "commentText": "Jeff Flake is as useful to America as rubber lips are to a woodpecker.",
    "likes": 30
  },
  {
    "commentText": "Sure won't be Flake the RINO! No one will challenge the guy who undid Obama's nightmare economic policies and brought America 🇺🇸 back!",
    "likes": 1
  },
  {
    "commentText": "I knew he was CRAT when I saw his nose pointing left. What a dead give away!",
    "likes": 1
  },
  {
    "commentText": "Ye it's kanye",
    "likes": 0
  },
  {
    "commentText": "Trump is the greatest president since Abe Lincoln, you would have to be a satan-worshiping communist to want him out of office!",
    "likes": 7
  },
  {
    "commentText": "Jeffery, we have a conservative in the whitehouse... His name is Donald J. Trump and Jeffy, we real Americans, we voted for him you idiot!!",
    "likes": 1
  },
  {
    "commentText": "Yeah right go run against President Trump and embarrass yourself Flake. Give me a break!",
    "likes": 2
  },
  {
    "commentText": "Jeff Flake (D-AZ)\nThere fixed it for you",
    "likes": 4
  },
  {
    "commentText": "I wonder who spread Jeff Flake's nose across his face.",
    "likes": 1
  },
  {
    "commentText": "stupid a",
    "likes": 0
  },
  {
    "commentText": "Jeff why don't you challenge him? Put your ass on the line see what happens to you!",
    "likes": 1
  },
  {
    "commentText": "I can see cnn giving him a job after he ends his failed political term",
    "likes": 1
  },
  {
    "commentText": "Flake is the weak, feminist, cuckold, beta male that the democrats wants to turn every guy into around the world.  Stay strong & virile my brothers, the women in your life will thank you for it..MAGA!!!...",
    "likes": 0
  },
  {
    "commentText": ".     F^ck Flake. He needs to take his RINO arse and just go away. He has already quit because the people of Arizona are on to his party bait and switch BS. It's standard party policy not to challenge a sitting president running for re-election.",
    "likes": 0
  },
  {
    "commentText": "Flake isn't a conservative and he isn't decent. He is for open borders, and making the middle class pay for it. Just another globalist hack.",
    "likes": 5
  },
  {
    "commentText": "Senator Flake: R-I-N-O..! Any questions?",
    "likes": 0
  },
  {
    "commentText": "Président Donald Trump 2020 👍",
    "likes": 184
  },
  {
    "commentText": "This guy is an absolute loser hahaha omg he sucks at life and his job",
    "likes": 0
  },
  {
    "commentText": "Jeff is Flakey . Trump is the greatest .",
    "likes": 1
  },
  {
    "commentText": "This guy has a cheek to talk of Decency! The Looser's only success was ...\"How to be the best Failure!\" Its not just his Nose thats twisted. His mind is as well. Who the Hell voted for this Chump? His only moment of fame, was to Stop the Senate vote! A complete Cretin. He has the traits of a Demoncrat. I guess he was one of Thieving Obama's left-over \"Spies\".",
    "likes": 1
  },
  {
    "commentText": "Unbelievable......Flake needs to go home and look in the mirror...he would see someone who is not honest. He is not a Republican! And yes...he is a globalist",
    "likes": 1
  },
  {
    "commentText": "It doesn't matter who runs on the Republican ticket.  The Democrats will win, and win big.",
    "likes": 0
  },
  {
    "commentText": "no flake, snowflake,  the fake ..go flake yourself",
    "likes": 0
  },
  {
    "commentText": "I'm lds, flake is lds. I'm embarrassed. Please go away flake.",
    "likes": 0
  },
  {
    "commentText": "What in the hell is Arizona doing. can't decide between a female combat veteran and a bisexual, atheist, pro abortion. Socialist???...Beam me up...",
    "likes": 0
  },
  {
    "commentText": "....wow I knew it was bad at fox but wow...that is some dangerous news man. They are really feeding their veiwers hate man. So unprofessional...geez",
    "likes": 0
  },
  {
    "commentText": "Trump will win",
    "likes": 1
  },
  {
    "commentText": "Flake is a Flake. He needs to go.",
    "likes": 1
  },
  {
    "commentText": "If any Republican politician runs against President Trump in 2020 they will be made a total laughing stock. President Trump is our pick for Republican president you Flake fool.",
    "likes": 1
  },
  {
    "commentText": "Flake is a douchebag...",
    "likes": 0
  },
  {
    "commentText": "Flake is a loser",
    "likes": 0
  },
  {
    "commentText": "I hope Jeff flake drops dead",
    "likes": 0
  },
  {
    "commentText": "Democrats are out of gas they have nothing to run on and after the way they've acted these last two years I doubt any sane voter would trust them or their globalist allies",
    "likes": 1
  },
  {
    "commentText": "Meanwhile, how many abortions has Donald Trump paid for during his lustrous sexual campaigns? Maybe the answer is in the \"vault.\" Any guesses out there? 20, 30, 50, 100's. After all, abortions are far cheaper than child support, right Donald?  You're so \"pro-life, right Donald?",
    "likes": 0
  },
  {
    "commentText": "Oh...go Flake off...",
    "likes": 1
  },
  {
    "commentText": "Jeff Cornflake hates Trump, why because is globalist.",
    "likes": 1
  },
  {
    "commentText": "Phuck Flake.",
    "likes": 0
  },
  {
    "commentText": "General Patton Is like Trump - An American Hero",
    "likes": 1
  },
  {
    "commentText": "JEFF FLAKE IS IRRELEVANT",
    "likes": 1
  },
  {
    "commentText": "Jeff flake you are A f*cking failure and a hater,  disgraceful tired want to be politician.",
    "likes": 0
  },
  {
    "commentText": "Ugh this B! Yes 92% of Republicans are with Trump. However - 32% of Americans are Republican.",
    "likes": 0
  },
  {
    "commentText": "Yeah, we don't like fake Flake.",
    "likes": 1
  },
  {
    "commentText": "How can Jeff Flake be a \"conservative\" when he's an open borders Republican? He's not conserving anything. He'll put this country further & further into debt.\n\nDemocrats are ruthless & Republicans will never win again if they put people like Flake as the heads of their party. If you fight back against the smears, you win. If you cower to the Democrats, you'll keep losing over & over again like McCain & Romney. They played softball & Democrats ran them over. This is why Flake can't win reelection.",
    "likes": 1
  },
  {
    "commentText": "And THAT,  Flake,  is why you had to retire, because you can't get elected dog catcher in Arizona.",
    "likes": 1
  },
  {
    "commentText": "Heck! Flake is pretty much insinuating the president is not decent?? I would rather have someone that tells it as it is than a flake republican. This president gets things done. His heart is genuine unlike many politicians with empty promises. He will drain the swamp that almost put the country in jeopardy.",
    "likes": 3
  },
  {
    "commentText": "So do we! Because there is nothing like watching a Trump take down you POS!",
    "likes": 0
  },
  {
    "commentText": "why dont YOU run mr flake? Oh, that's right NO ONE wants YOU to lead them, loser. did a crying, lying woman change your mind again?",
    "likes": 0
  },
  {
    "commentText": "Never Trump'er Fake Flake gets kicked out of Arizona. True Conservatives don't vote RINO's. Adios Senor Flake.",
    "likes": 1
  },
  {
    "commentText": "Go burn in hell, Flake, you foul scum.",
    "likes": 0
  },
  {
    "commentText": "I hope Flake moves to Siberia.",
    "likes": 1
  },
  {
    "commentText": "18% Approval Rate Bawhahahah",
    "likes": 3
  },
  {
    "commentText": "Jeff flake doesn't like winning Trump was a Manhattan democrat and now he is center left he is Republican in name only. But most people are center but we have to claim conservative and Republican title because the left are racist against white people and are hate mobs",
    "likes": 0
  },
  {
    "commentText": "Flake is a parasite, a bought and paid for globalist and an enemy of the United States.",
    "likes": 1
  },
  {
    "commentText": "Vote this asshole out",
    "likes": 0
  },
  {
    "commentText": "F**K Flake",
    "likes": 0
  },
  {
    "commentText": "Flaky should do everyone a big favor and disappear.",
    "likes": 1
  },
  {
    "commentText": "I'm glad this asshole's soon to be gone. I'd prefer Sinema, though I'd prefer McSally get his seat.",
    "likes": 0
  },
  {
    "commentText": "What a disgusting person this fake flake. President trump has done a amazing job in his 1st 2 years, like him or not, he is the best president ever !!!",
    "likes": 1
  },
  {
    "commentText": "Flake is fake",
    "likes": 1
  },
  {
    "commentText": "Jeff Flake just hates trump! Jeff's last name fits him to the, cause that's what he is ..he is a FLAKE!! and he has no back bone.",
    "likes": 1
  },
  {
    "commentText": "Trump will absolutely annihilate anyone that opposes him",
    "likes": 1
  },
  {
    "commentText": "Flake is hinting he will run in 2020 , saw  right through .",
    "likes": 0
  },
  {
    "commentText": "Jeff Flake is exactly what his name states.....a flake.",
    "likes": 1
  },
  {
    "commentText": "George Bush conservatives, aka a Democrat.",
    "likes": 0
  },
  {
    "commentText": "Just go away.",
    "likes": 1
  },
  {
    "commentText": "Jeff Flake what a joke!His face is good for a good punch!",
    "likes": 1
  },
  {
    "commentText": "Nobody likes your gay Arizona creep.",
    "likes": 0
  },
  {
    "commentText": "Flake in Arizona wants no wall. Mexico really wants the wall.\nTheir citizens are being killed by illegal guns smuggled south. \nFACT..",
    "likes": 0
  },
  {
    "commentText": "Arizona is all LGBTQ.",
    "likes": 0
  },
  {
    "commentText": "Jeff Flake is a failed politician. Trump is the best president ever!!",
    "likes": 3
  },
  {
    "commentText": "I HOPE SOMEONE GIVES SOME BRAINS TO FUZZBALL FLAKE.... WHAT AN IDIOT!  ENJOY YOUR RETIREMENT, FUZZBALL FLAKE!",
    "likes": 1
  },
  {
    "commentText": "Jeff Flake makes John McCain still look alive..Just Sayin' !!",
    "likes": 5
  },
  {
    "commentText": "Yeah let's throw away all that... SUCCESS. beat it, fruit, we have no more use for you after the SCOTUS vote.  Thanks for aye vote now fade away",
    "likes": 0
  },
  {
    "commentText": "🙄🙄🙄🙄",
    "likes": 0
  },
  {
    "commentText": "F!#* Flake! \nU run against him",
    "likes": 0
  },
  {
    "commentText": "Flake is an asshole. End of story.",
    "likes": 0
  },
  {
    "commentText": "Flake off Jeff!",
    "likes": 0
  },
  {
    "commentText": "Jeff flake is a spineless chump... can't stand this guy",
    "likes": 1
  },
  {
    "commentText": "Jackass",
    "likes": 0
  },
  {
    "commentText": "Why do we even have to listen to him? He is completely out of touch and disgraced himself at Kavanaugh's confirmation hearings. No one is more aptly named than FLAKE.  He is irrevelent, even if he eventually voted yes for Kavanaugh.",
    "likes": 0
  },
  {
    "commentText": "\"Flake The Fake\"!!!!!!!",
    "likes": 1
  },
  {
    "commentText": "Anyone with fake promises can do that!!! Where's the mother fucker Wall he promised during his hate Campaign? Why Hillary is not in jail???\nISIS? Don't make me go there!!!",
    "likes": 0
  },
  {
    "commentText": "Flakes conservatism is to follow the democrats lead. Why would someone from the republican fight with trump when they are winning. Ahhhh i get it in order to divide the republican voters when they hit each other.",
    "likes": 0
  },
  {
    "commentText": "First he was praised for the SCOTUS vote not he is a traitor and a globalist? Make up your mind bots.....",
    "likes": 0
  },
  {
    "commentText": "This guy is pathetic.",
    "likes": 0
  },
  {
    "commentText": "Trump has done more than  Flake could ever dream of doing, how can you knock someone else having a 18% approval rating",
    "likes": 1
  },
  {
    "commentText": "tell flake  the republican party will crash and burn without trump. I will never vote for the republican party when trump is gone. tell flake for me please",
    "likes": 0
  },
  {
    "commentText": "Snow-Flake",
    "likes": 0
  },
  {
    "commentText": "This is one low energy individual.    Someone  please~ oh forget the plug.   Batteries wouldnt work",
    "likes": 0
  },
  {
    "commentText": "F--K Flake!!!",
    "likes": 3
  },
  {
    "commentText": "Republican in name only",
    "likes": 1
  },
  {
    "commentText": "what a jackass, be gone satan, you will not be running so take your candy ass home!",
    "likes": 0
  },
  {
    "commentText": "What a Twat!!",
    "likes": 1
  },
  {
    "commentText": "Resist the Resistance!",
    "likes": 1
  },
  {
    "commentText": "Who broke that fucker's nose??",
    "likes": 0
  },
  {
    "commentText": "I'm just glad SnOw FiAkE is out of here soon\n He's a traitor",
    "likes": 0
  },
  {
    "commentText": "I hope some republican actually does try to run against Trump. It'll be great comedy when Trump, backed by the population, wipes the floor with them.",
    "likes": 1
  },
  {
    "commentText": "Maga",
    "likes": 0
  },
  {
    "commentText": "A Traitor to this country....Hopefully one of his beloved Illegal Aliens sticks a knife in him..",
    "likes": 0
  },
  {
    "commentText": "Maxine Waters in 2020\n\"I know that's right!\"",
    "likes": 0
  },
  {
    "commentText": "Rhino",
    "likes": 0
  },
  {
    "commentText": "Flake is a douchebag! He knows nothing about conservatives! MAGA",
    "likes": 0
  },
  {
    "commentText": "And I hope someone tries to straighten up his fkd up nose. \n\n But I doubt that will happen. \n\nClearly Flake was tired of winning before Trump even started.  But pussies usually are averse to winning.",
    "likes": 1
  },
  {
    "commentText": "Fk off Rino swamp rat!",
    "likes": 0
  },
  {
    "commentText": "Lol the party is a fraud. Trump took the republican principles and made you guys look like fools",
    "likes": 0
  },
  {
    "commentText": "I feel Jeff Flake is a troll—an evil one.",
    "likes": 1
  },
  {
    "commentText": "Hope is all they have.",
    "likes": 0
  },
  {
    "commentText": "Flake knows he's got blackmail on his butt and thats why he's backing out.",
    "likes": 0
  },
  {
    "commentText": "I hope Flake gets his diaper changed before leaving the senate. I could help with his crying fits.",
    "likes": 0
  },
  {
    "commentText": "He's mad Trump isn't a globalist shill like all the other RINOs (Bush, McCain, etc.)",
    "likes": 1
  },
  {
    "commentText": "Is Flake a SNOWFLAKE?",
    "likes": 0
  },
  {
    "commentText": "Flake makes no sense. Just like the leftists he serves.",
    "likes": 34
  },
  {
    "commentText": "who is this lady, she is talking like an IRONMAN. BYE!!!",
    "likes": 0
  },
  {
    "commentText": "trump will win 2020 by default.",
    "likes": 1
  },
  {
    "commentText": "Jeff Flake has a future as a Democrat.",
    "likes": 5
  },
  {
    "commentText": "Lol...man I forget how blond haired blue eyed perfect little white dream pundents fox has till I come watch this trash.  Fox news has become a stereotype of the pure race ideology.  That's coming from a white guy.  Um....a liberal white guy, not one of the fox news kind.  It's hard to take you serious about anything with that kind of diversity fox.",
    "likes": 0
  },
  {
    "commentText": "Well there 1 senator out of a job soon",
    "likes": 0
  },
  {
    "commentText": "2020, don't try that, he will not make it that far!!!!",
    "likes": 0
  },
  {
    "commentText": "Why is this irrelevant Snowflake still around?",
    "likes": 1
  },
  {
    "commentText": "The best part of Jeff Flake ran down his mama's leg!",
    "likes": 0
  },
  {
    "commentText": "Maybe Kanye West   :)",
    "likes": 0
  },
  {
    "commentText": "Being decent is a losing strategy everywhere in life. Its a hoax that democrats invented to control you. Stop being decent.",
    "likes": 0
  },
  {
    "commentText": "Trump cannot be re-elected. He only has his base and he cannot recreate the coalition that barely got him in. It is very likely that he will be indicted. Flake is positioning himself.",
    "likes": 0
  },
  {
    "commentText": "Is Martha wearing a BDSM Slave Collar?",
    "likes": 0
  },
  {
    "commentText": "YOU'R SUCH A LOSER flake IF YOU;R SO SMART WHY DON'T YOU CHALLENGE HIM",
    "likes": 0
  },
  {
    "commentText": "How about low energy Jeb!",
    "likes": 0
  },
  {
    "commentText": "Is anybody gonna be left in 2020? I think as soon as the drain plug is pulled there’s only gonna be like 15% of the political parties remaining, and we all know 99% of the Democratic Party will be locked up",
    "likes": 0
  },
  {
    "commentText": "But what if Ben Shapiro runs against Trump? \n0__________0",
    "likes": 0
  },
  {
    "commentText": "Flake isn't running is he. I agree he has failed",
    "likes": 0
  },
  {
    "commentText": "Hey flake ,,,see if you can find the nearest door knob",
    "likes": 15
  },
  {
    "commentText": "Clicked on this just to say to RINO Flake, \"Go home to mommy.\"",
    "likes": 11
  },
  {
    "commentText": "Waters, booker, CPL, warren or Hilary again would all be hilarious",
    "likes": 0
  },
  {
    "commentText": "Nothing like going away with a little dignity left (sarcasm). Flake did the right thing voting yes on Kavanaugh but he went right back to his Flakey ways.",
    "likes": 1
  },
  {
    "commentText": "Yea, pick your best,  they will run, and three things will happen.  #1. They will be totally embarassed and humiliated. #2.  They will lose.  And finally, the reason they will run ,,,,\n#3.  THEY WILL DO IT FOR THE MONEY.",
    "likes": 0
  },
  {
    "commentText": "WHAT A FLAKE 🤡",
    "likes": 0
  },
  {
    "commentText": "Well it’s not u Flake fart 😁",
    "likes": 8
  },
  {
    "commentText": "Flake is a cowardly scumball",
    "likes": 0
  },
  {
    "commentText": "Listen to this scumbag....HE is being forced out of office..scumbag made millions off taxpayer's! !!",
    "likes": 0
  },
  {
    "commentText": "Jeff Flake has a yellow streak running down his back! Donald J Trump is the greatest president in our nation’s history!🇺🇸👍",
    "likes": 47
  },
  {
    "commentText": "What a flake",
    "likes": 0
  },
  {
    "commentText": "Sen. Flake can go to hell. President Trump is the BEST THING to happen to american politics in many years. Finally, a man who doesn't talk out of both sides of his mouth, keeps his word to advocate for America first, and SUPPORTED BRETT KAVANAUGH when he was being ruthlessly attacked by the Democrats. Sen. Flakey needs to back to his home state and rot. MAGA and TRUMP/PENCE in 2020.",
    "likes": 3
  },
  {
    "commentText": "flake was a republican when trump was a democrat he was a republican when trump was partying with hilary and giving money to her campaigne, flake was a republican when trump was pro choice, when he was cheating on his taxes and cheating hard working americans out of their money with his fake school yet you people bash him becouse he dosent agree with this presidents horrendous, hypocritical, unprecident antics...if your life was in danger who would save you first trump or flake?? we all know that answer RIGHT!!!!",
    "likes": 0
  },
  {
    "commentText": "Jeff Flake is a yellow belly coward....Jeff you belong to the Democratic party so shut you pathetic mouth",
    "likes": 0
  },
  {
    "commentText": "Jeff “The Flake” is another bought globalist 🤥🐭🐀 💩.",
    "likes": 294
  },
  {
    "commentText": "It is unreal that Jeff Flake's last name perfectly fits him as being a true flake. He is as \"flaky\" as it gets. How did he ever get elected in the first place?",
    "likes": 0
  },
  {
    "commentText": "Jeff Flake is a filthy, lying sack of flaming dogsh*t who couldn't get laid in a whorehouse with a fistful of $50s! Who gives a crap what that impotent, useless mangina thinks?",
    "likes": 1
  },
  {
    "commentText": "How about you challenge him Flake?",
    "likes": 1
  },
  {
    "commentText": "Flake-Feinstein can run against Trump-Pence. Vote Trump 2020!!!",
    "likes": 11
  },
  {
    "commentText": "I really thought fake ask for FBI investigation to help trump I kavanah, turns out that the is the enemy. must get money from people making money off Democrats policies that favor big business and migration. vote him out",
    "likes": 0
  },
  {
    "commentText": "Traitor",
    "likes": 1
  },
  {
    "commentText": "Maybe Flake can find someone named Frosted so they can run on the Frosted Flake ticket.",
    "likes": 11
  },
  {
    "commentText": "hey Flake, you had your 15 minutes in the spot light, it's time for you to F*CK Off",
    "likes": 0
  },
  {
    "commentText": "Corn Flake",
    "likes": 1
  },
  {
    "commentText": "Epic failure.",
    "likes": 0
  },
  {
    "commentText": "Really Flake???? REPUBLICANS need to remember what it means to be decent??? Are you not seeing what the dems r doing... idk what’s left to say at this point.",
    "likes": 0
  },
  {
    "commentText": "Honestly, is it a slow news day, or what???  Who cares what he thinks?",
    "likes": 119
  },
  {
    "commentText": "WTF is wrong with Arizona?!",
    "likes": 56
  },
  {
    "commentText": "I sure hope it’s you",
    "likes": 1
  },
  {
    "commentText": "Just go home to AZ.  Flake  and STFU! Guys like you are why President Trump got elected.",
    "likes": 3
  },
  {
    "commentText": "WOW..REALLY \nANOTHER SWAMP SCUMBAG",
    "likes": 2
  },
  {
    "commentText": "Yeah, Elizabeth Warren.  And she'll lose hard.",
    "likes": 34
  },
  {
    "commentText": "Tell me what does the left offer?",
    "likes": 7
  },
  {
    "commentText": "Snowflake is truly a demoshit",
    "likes": 0
  },
  {
    "commentText": "Loser",
    "likes": 11
  },
  {
    "commentText": "Flake is like the Droopy of Washington",
    "likes": 81
  },
  {
    "commentText": "Jeff Flake decoded.....Go back to doing nothing, and accomplishing even less.",
    "likes": 218
  },
  {
    "commentText": "Flake NO real convictions just a jerk bag opportunist !!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "likes": 12
  },
  {
    "commentText": "To be decent? That leaves the flake out of the picture.",
    "likes": 30
  },
  {
    "commentText": "Shut up, Flake.",
    "likes": 24
  },
  {
    "commentText": "Flake scum of the earth.",
    "likes": 1
  },
  {
    "commentText": "The only person that has a chance of beating Trump in 2020 is Bernie Sanders, and that is very low. NO Republican can beat trump in the primary. MAGA 🇺🇸❤️🇺🇸❤️🇺🇸",
    "likes": 40
  },
  {
    "commentText": "jeff flake is pretty much EVIL",
    "likes": 67
  },
  {
    "commentText": "Normally I don't like RepubliCunts! Jeff Flake is a good man & guy though like John McCain who is a real American Patriot & bona fide hero.",
    "likes": 1
  },
  {
    "commentText": "Jeff Flake will lose his seat, traitorous piece of human garbage.",
    "likes": 127
  },
  {
    "commentText": "Jeff flake is a FLAkE",
    "likes": 116
  },
  {
    "commentText": "Somebody cause I can't-flake",
    "likes": 12
  },
  {
    "commentText": "Do it snowflake..grow some balls",
    "likes": 138
  },
  {
    "commentText": "Flake by name flake by nature. (I thought he was running again but thanks to the people who replied I now know he's retiring, I'll leave my mistake in because as I replied I'm not American I've just seen videos of Flake and I don't like him).  Let's hope this tool gets voted out.",
    "likes": 30
  },
  {
    "commentText": "Waters & Booker lol",
    "likes": 34
  },
  {
    "commentText": "Why give this nobody time ??? He's the WORST !!!",
    "likes": 10
  }
]