[
  {
    "commentText": "who cares?...they'll burn in HELL soon!",
    "likes": 0
  },
  {
    "commentText": "If Jimmy Fallon were bald...",
    "likes": 0
  },
  {
    "commentText": "My husband worked in the Government, and Secret Service and FBI would get together occasionally and play pool and have a few beers.  The stories I heard about the Clinton's, make-up to his black eyes and scratches on the forehead had to be fixed then Bill would have to speak live on the news channels!",
    "likes": 0
  },
  {
    "commentText": "THIS GUY IS FAKE NEWS AND A PEDOPHILE",
    "likes": 0
  },
  {
    "commentText": "WHERE WOULD YOU LIKE TO BE BURIED?",
    "likes": 0
  },
  {
    "commentText": "Thank God they did not succeed to the WH once more",
    "likes": 0
  },
  {
    "commentText": "That vindictive evil witch just won't go and shut up. Poisonous harridan.",
    "likes": 0
  },
  {
    "commentText": "Lock up the whole criminal family gang.",
    "likes": 0
  },
  {
    "commentText": "I can explain Hillary Clinton with a word that you might not know yet. That word: \"Ogress \". That is the female version of Ogre...\n\nDefinition: Ogre...\n\n1) Mythological humanoid creature. Originated from the old English kingdom of Cornwall. Originally said to be the size of a large man and fed off human flesh, but now taken to be some kind of small giant.\n\n2) A vindictive individual, an unreasonable person.\n\nMy boss is such an ogre, he made me work late three times last week and refuses to pay overtime.",
    "likes": 0
  },
  {
    "commentText": "Hillary Clinton wanted to be a president like my kids want to have a lot of candy. \nEven though they cannot eat that many",
    "likes": 0
  },
  {
    "commentText": "wealthy Liberals eat fetal material to stay alive",
    "likes": 0
  },
  {
    "commentText": "Patriot. Good man, good American.",
    "likes": 0
  },
  {
    "commentText": "Hillary is the devil. Glad America woke up and realized it.",
    "likes": 0
  },
  {
    "commentText": "IGNORE THE CLINTONS",
    "likes": 0
  },
  {
    "commentText": "the clintons epitomize evil  no matter how much you spin or sugar coat it.",
    "likes": 0
  },
  {
    "commentText": "Bill and Hillary = TOXIC",
    "likes": 0
  },
  {
    "commentText": "hillary   lol  \nwhat a national treasure",
    "likes": 0
  },
  {
    "commentText": "Most people do not take the time nor research what information they are seeking,before they speak. Clintons fly by the sit of their pants and it is all about them, Obama the same. Peas in a pod and if they had the opportunity they would sale the other out. I am thankful Donald Trump is my. president.",
    "likes": 0
  },
  {
    "commentText": "That was most likely his last interview.",
    "likes": 0
  },
  {
    "commentText": "Cannot appreciate or believe people who talk negative about someone. Narration of policies of beliefs observed during ones association is educative. We need to draw a line somewhere",
    "likes": 1
  },
  {
    "commentText": "Character was definitely an issue for the Clintons, many politicians and now it’s worse with the Trumps. Character and respect don’t seem to matter nowadays at least not to those in politics and many who have monied interests. Where is a decent Centrist? Please we need term limits, Lobbyist limits, and that includes the Supreme Court justices too. I’m will to see the rest of this presidency play out but I’m not hopeful as usual.",
    "likes": 0
  },
  {
    "commentText": "is he still alive?",
    "likes": 0
  },
  {
    "commentText": "One of his eyes is allergic to a vase to the face lol.\nboth of their filthy existence are abomination to God.",
    "likes": 0
  },
  {
    "commentText": "He took the thong road ! 🤣",
    "likes": 0
  },
  {
    "commentText": "Is he still alive?",
    "likes": 0
  },
  {
    "commentText": "what character \nthey were an embarrassment  back home \nSo they took it on the road to the White  house?",
    "likes": 0
  },
  {
    "commentText": "Hey everyone, Its about 30 days til the 2018 midterm elections. The polls show the house of representatives has some very tight races. \n\n You know if the dems win Congress they will impeach Trump & Justice Kavanaugh. They will never be convicted in the senate, but it will overpower the News cycle with endless talk of all this craziness. \n\nWe cannot do this to our Beloved President Trump. He stuck by his promises & now we must stick by President Trump. Pray sincerely in your heart for the house & Senate to stay Republican. No matter what, find a way to vote November 6th 2018 & take grandparents to the poll too:) \n\nThis is a battle of Good vs Evil. \nGod Bless our nation.",
    "likes": 0
  },
  {
    "commentText": "Her days as a free person are now numbered and she sees the writing on the wall......President Trump is coming after her. Mr President show her NO MERCY.MILITARY TRIBUNAL FOR HER!!",
    "likes": 0
  },
  {
    "commentText": "Everywhere you see Huma. Parents brother head of moslimbrotherhood and sisterhood.\nWorld traitors.",
    "likes": 0
  },
  {
    "commentText": "hillary has high cheekbones like fauxahontis. is this a common trait among lesbians?",
    "likes": 0
  },
  {
    "commentText": "No it's not time to have a female president just for the sake of having one ok we need anyone with greatness to move the USA to righteousness",
    "likes": 0
  },
  {
    "commentText": "I BELIEVE NOTHING ABOUT THIS IDIOTIC STORY",
    "likes": 0
  },
  {
    "commentText": "the Clintons are a stain on the USA....it'll be best to whitewash them from history.... (along with the other abomination Obama)....there's no need to ever make mention of the Clintons ever again....they're now on the same level as Charles Manson or Geoffrey Dahmer ...you'd never mention them in polite society - just as the Clintons should never be mentioned.\n\nit'd be for the best",
    "likes": 0
  },
  {
    "commentText": "The Clintons can spin Arkansas manure to gold",
    "likes": 0
  },
  {
    "commentText": "I can not stand Hillary Clinton. Just seeing her face on my screen makes me sick. The less I see her the better.",
    "likes": 0
  },
  {
    "commentText": "Oh, this guy is selling a book - that says it all.  He spins manure out of gold.  He panders to his customers to sell books: money, money, money.  But he is entitled to his opinion as I am to mine.  - Secretary Hillary R. Clinton got over 2.5 million votes MORE than Trump.  It's NOT a democratic process but relies on politically appointed electoral college members.",
    "likes": 0
  },
  {
    "commentText": "Bill was a battered man, but no one cares because women are above the law. One day, the lid will blow.",
    "likes": 0
  },
  {
    "commentText": "These \"news outlets\" would have been out of business long ago if they had put a middle aged woman in between two men, instead of a hot blonde.",
    "likes": 0
  },
  {
    "commentText": "I'm surprised he isn't dead yet.",
    "likes": 0
  },
  {
    "commentText": "Dear Lord! I wish this woman could retire.",
    "likes": 0
  },
  {
    "commentText": "ESTA ES UNA DE LA INVENTORA DE VIOLACION. LA LESBIANA DE LA CLINTON",
    "likes": 0
  },
  {
    "commentText": "He'll be suicided?",
    "likes": 0
  },
  {
    "commentText": "Little boys who hate women.",
    "likes": 0
  },
  {
    "commentText": "I wish\nthe clintons and the obamas would evaporate overnight",
    "likes": 0
  },
  {
    "commentText": "And they say Trump doesn't have the temperament to be President lol! Thank GOD TRUMP IS PRESIDENT!",
    "likes": 0
  },
  {
    "commentText": "He is a LEO and she is a SCORPIO........He is a fire sign, buy Scorpio's don't get mad very often, but when they do it is an explosive event!.....they are ALL about VENGEANCE and EXTREMELY jealous and volatile!! (lol sounds like a politician already). I didn't really know anything about zodiac information until I researched it this last year. Its just some added research, which NO 2 signs are the same unless twins. Where the planets are at time of birth is what places precedent on certain traits of your personality. Now!! Personally I didn't believe in it before this last year. I never had time to research astrology, but it is fascinating and I just take the info with a grain of salt!!",
    "likes": 0
  },
  {
    "commentText": "Gary Aldrich wrote a fabulous book as well.",
    "likes": 0
  },
  {
    "commentText": "Is he still. Alive and free ???",
    "likes": 0
  },
  {
    "commentText": "I don't believe any of this, women don't hit men do they? That would be sarcasm...",
    "likes": 0
  },
  {
    "commentText": "the clintons are trash. there judgement cometh, and that right soon...",
    "likes": 3
  },
  {
    "commentText": "Why did he not report the Domestic Violence?",
    "likes": 2
  },
  {
    "commentText": "the nfl is 80% black... why do none of those weak cuck jew liberal sjw  reporters have the balls to report and call the nfl out for racism against ALL non blacks?",
    "likes": 0
  },
  {
    "commentText": "I REALLY ADMIRE THIS MAN FOR TELLING THE TRUTH. Also, I'm glad he sat down with his kids and they googled all 3 names and he could make sure his kids knew the truth. Because of what I've heard about ppl in the past I do hope nothing happens to him.",
    "likes": 0
  },
  {
    "commentText": "Didn't lying Hillary have an affair with dede Myers",
    "likes": 0
  },
  {
    "commentText": "I wonder how long has he got to live after this. Knowing Hillary backround count.",
    "likes": 0
  },
  {
    "commentText": "U better get my name in out",
    "likes": 0
  },
  {
    "commentText": "My aunt did work for hillary back in the 80s. She said hillary was a very hateful person and had a bad problem of being half ass drunk a lot",
    "likes": 3
  },
  {
    "commentText": "In a speech in 1992, billywhacker cliton said \"we LOATHE the military\", speaking of himself and the beast. Why in the hell would they get ONE vote to be commander in cheif when they loathe what they will command????  The beast routinely used the words motherfucker and cocksucker.  Hubbel told me she had an almost non existant clit and couldnt orgasm, that nay be the entire problem",
    "likes": 0
  },
  {
    "commentText": "Well You can't blame Hillary for beating the Hell out of Bill, Maybe if that would have went viral , It would have helped her out instead of her being portrayed a passive victim of a cheating Husband. And trying to cover up his affairs and sexual assaults",
    "likes": 0
  },
  {
    "commentText": "Sad you're an understudy and history is written by the victors damn and believe me there's some really shady s*** in our political system",
    "likes": 2
  },
  {
    "commentText": "Please you made a vow protect this country constitutionally you made a commitment please make this right",
    "likes": 0
  },
  {
    "commentText": "Can any of these people prove without a doubt how corrupt the clintons and anybody in this Administration has been with unequivocally proof please bring it forward",
    "likes": 0
  },
  {
    "commentText": "SERIOUSLY ,..everyone understands the reason people voted for Hillary,...they believed it was a vote for OBAMA,..and it very well would have been,..even Obama`s cabinet would have stayed the very same,..obama would have been Secretary of State and still running the country ,...HOW IRONIC,...when Bill was the president ,..Hillary ran the country ...now if she would have been the president ,..Obama would have ran the country ...seriously this is absolute,...there is no stretch of the imagination here...this was how is was all going down",
    "likes": 0
  },
  {
    "commentText": "Thanks God Hillary was not elected. It would be an disaster and disgrace to the White House and to American people.",
    "likes": 3
  },
  {
    "commentText": "They are communist along with Obama’s",
    "likes": 3
  },
  {
    "commentText": "the very sight of Bill and Hillary make me sick they need to be locked up for treason for life",
    "likes": 3
  },
  {
    "commentText": "This man should run for something,,,,, anything",
    "likes": 0
  },
  {
    "commentText": "She desecrated the White House, breaking public treasures. She should go to jail.",
    "likes": 3
  },
  {
    "commentText": "And Hillary had the nerve to call republicans deplorable‘s . ( It’s a crazy world)",
    "likes": 2
  },
  {
    "commentText": "Bill Clinton  turn  the white house  into worehouse.",
    "likes": 2
  },
  {
    "commentText": "Lemme tell you about Hellary. When the Clintons were in the White House, Bill getting his crankshaft worked on by bright young hopefuls, Hellary was treating the US Marine Chopper One crew like their predecessors had treated their sharecropper property before the Civil War put a stop to that nonsense. I kid you not. And when she wasn’t going after the military crew she was screaming at and throwing vases at the Secret Service agents who were there to protect her. The WH staff were terrified of her. Power corrupts. Absolute power corrupts absolutely. I shudder to think what would have happened if she had won the election. Perhaps nothing owing to being so busy screaming and adding to her coffers she wouldn’t have had time for anything else.",
    "likes": 0
  },
  {
    "commentText": "The Clintons should be in prison...long ago-\nTHEY ARE NOT RELEVANT!",
    "likes": 1
  },
  {
    "commentText": "What a bunch of gossipy old women these guys are. So Hillary is a phoney. But Trump is a narcissistic, misogynist, racist, handicapped-insulting sociopath who tried to take away twenty-three million peoples' health care with the stroke of a pen.  I and the country would have been better off with the phoney.",
    "likes": 0
  },
  {
    "commentText": "Our country took a big downturn when Clintons move into Whitehouse.",
    "likes": 3
  },
  {
    "commentText": "My cousin served with this guy.",
    "likes": 1
  },
  {
    "commentText": "you KNOW cnn wouldnt interview this guy ! If it was about Trump ? They would talk about it daily !  cnn makes me sick",
    "likes": 3
  },
  {
    "commentText": "He is so Luck her recent one is dead",
    "likes": 0
  },
  {
    "commentText": "It's a crock of crap that the secret service covers up for scum like this!  They should have been exposed and thrown out on their asses! imho",
    "likes": 0
  },
  {
    "commentText": "Dictators",
    "likes": 1
  },
  {
    "commentText": "look at all those brain washed fools supporting this crooked family!! sickening",
    "likes": 3
  },
  {
    "commentText": "the Clintons are scumbags",
    "likes": 1
  },
  {
    "commentText": "The Clinton's Didn't Like Uniforms.. TRUE during their occupation of the white house, \"we\" were not allowed to tour the Whitehouse in Dress Blues! They stopped us at the door and WE had to leave the tour group!!! I will never forget being blocked from touring \"America's Home\" during the Clinton Occupation. The greatest insult I've ever been exposed to on my HOME Soil!  They were disgusting!!!",
    "likes": 40
  },
  {
    "commentText": "Women do not have the mental lega to  hold presidency",
    "likes": 1
  },
  {
    "commentText": "Well, the way it worked for the Clintons is this! Bill got women for Hillary and Hillary got women for Bill. A 60/40 kind of deal. It`s like Geiko INS. It`s kinda what we do around here!",
    "likes": 0
  },
  {
    "commentText": "She hit him with a vase? She should of got it right back! Wimpy rapist Bill, afraid of his wife? What a shmuck!",
    "likes": 0
  },
  {
    "commentText": "So Hillary is a husband beater.. Go figure that!!! We need an FBI investigation on this!!",
    "likes": 5
  },
  {
    "commentText": "WOW, if this man were to say the same thing about Trump or Bush,,the Corrupted Media would NOT be able to get enough of it. Strangely, NONE had him on their programs. Yeah, \"Strangely\"",
    "likes": 5
  },
  {
    "commentText": "It's a wonder this fellow hasn't been found dead from suicide with four bullet holes in his back???",
    "likes": 2
  },
  {
    "commentText": "A respectable man right here. Be blessed.",
    "likes": 4
  },
  {
    "commentText": "I wonder what happened to Seth Rich.",
    "likes": 0
  },
  {
    "commentText": "I remember watching this interview two years ago. Everyone in the country should have seen this. It's baffling anyone could have voted for her.",
    "likes": 0
  },
  {
    "commentText": "This guy's going to accidentally commit suicide real soon oh my God he's got to be a little worried",
    "likes": 0
  },
  {
    "commentText": "Hillary and Uma were lesbian lovers and both are pedophiles like Bill Clinton",
    "likes": 1
  },
  {
    "commentText": "why's would she wear that awful pink dress looks like a really cheap hooker",
    "likes": 0
  },
  {
    "commentText": "Thanks so much for this .. Gary bravo to you.",
    "likes": 3
  },
  {
    "commentText": "Have any of you come to your senses yet.  Guess Who has the absolute  crisis of character ?  Our Looney Tunes President Donald Duck and Cover Trump.  God help us all.",
    "likes": 0
  },
  {
    "commentText": "trump is corrupt , a sexual pervert, a treasonous Putin sycophant, president stupid pants is his middle name, his entire family are money grubbers, trump has the crisis of character.  He's a crook, a thief, can't wait to see him in his orange jump suit, oh, never mind. He will flee to Russia. Good riddance...Let him rob another country for awhile. Guess you morons will never tire of making her your punching bag. Cowards!",
    "likes": 0
  },
  {
    "commentText": "God thank you for giving us President Trump.",
    "likes": 0
  },
  {
    "commentText": "I'm surprised he hasn't committed suicide yet or had an accident or assassinated! people don't come up alive talking about the Clintons'",
    "likes": 0
  },
  {
    "commentText": "women applaudeing a rapeist so sad",
    "likes": 0
  },
  {
    "commentText": "America is under attack from the democrats not the russians or chinese . the only threat to america is the democrats. get out and vote even if you stand for hours in he rain snow wind  what ever it takes . MAGA",
    "likes": 0
  },
  {
    "commentText": "TRUMP 2020.                                           👍🇺🇸🇺🇸🇺🇸🇺🇸",
    "likes": 1
  },
  {
    "commentText": "That book was a serious eye-opener.",
    "likes": 0
  },
  {
    "commentText": "They can spin shit into gold lol. Guess the US is starting to smarten up a little bit MAGA",
    "likes": 0
  },
  {
    "commentText": "The left wing, liberal Democrat, socialists are now pulling out every trick in the book to undermine Pres. Trump and his policies !! \nSince his election, HRC, Obama, and all their cronies have done the only thing they could resort to:  \n1)  Blame the other side for the same exact thing they're doing  \n2) Take credit for what they couldn't or wasn't able to do \n3) Avoid the question, then start blaming the other side\n4) Keep talking & interrupting the other person\n5) When losing an argument attack the other person's appearance, personality or their family  \n6) Use the warped, liberal, & deluded media (CNN & MSNBC) to say anything to discredit the POTUS & the GOP \n7)  Elect some of the most unethical, unprofessional, absurd politicians who think they can do & say anything at all \n \nHow in the world could former Secy of State John Kerry go to Iran to actually discuss a nuclear treaty is beyond me??? ......\n \"At this point, what difference does it make !!\" .........Four Dead Americans or selling uranium to Russia or giving a terrorist nation like Iran millions of $$ -- Obama & HRC= warped policy !!\n \"Who does he think he is? Does he think he can wave some magic wand to bring jobs back to the US\" .......Easily, the worst Pres in US history !!  Mr Appeasement\n\"You have to pass a bill to know what's in it !!\" Really is that how it works ??\n \"Unemployment is low because everyone has 2 jobs !!\"    There is no cure for stupid !!                                      \n\nKeep talking and eventually what's on your mind will come out-blathering idiots !!\n\nRe-elect Pres Trump in 2020 !!!   He came along at the exact time in history when the U.S. needed him most !! One couldn't ask for a better person to lead our great country !!!\nFinish building the wall !!\nVote GOP in Nov 2018 Get Maxine, Pelosi and all the other liberal Dems out of office !!",
    "likes": 2
  },
  {
    "commentText": "God Help Us!!!",
    "likes": 4
  },
  {
    "commentText": "My uncle was secret service for Hillary Clinton. She was so nasty as human being, he retired. Bill cannot practice law. Permanently. Think on that",
    "likes": 0
  },
  {
    "commentText": "Fake news gobbled up by stupid people.",
    "likes": 0
  },
  {
    "commentText": "HILLARY is and has always been POWER HUNGRY **",
    "likes": 0
  },
  {
    "commentText": "not I’m just",
    "likes": 0
  },
  {
    "commentText": "Government is a club and none of us are invited...",
    "likes": 0
  },
  {
    "commentText": "Look at the difference between the fully clothed men and the woman on this program. There is a huge difference in appearance and yet no one seems to notice anymore. Trained brains.",
    "likes": 0
  },
  {
    "commentText": "Why do you suppose that the blonde woman on this show is dressed like it's a playboy magazine photo shoot? What a Tramp! The show is about news...not what's throbbing between your legs!",
    "likes": 0
  },
  {
    "commentText": "This video is gossip trash. Sad Fox news.",
    "likes": 0
  },
  {
    "commentText": "The LAST thing we need is more women in power .",
    "likes": 0
  },
  {
    "commentText": "Why are the fuggers still free? Our system is still broken until then.",
    "likes": 0
  },
  {
    "commentText": "There are still people who want to ridicule Hillary Clinton or bring the Clintons to justice!? I agree they're despicable human beings. However, you should do the same with Trump, his cabinet, his advisors, and almost anyone associated with him, but most especially, the war criminals, Henry Kissinger and John Bolton--all of these creatures are anti-God, anti-Christ abominations. And while you're at it, hold to account nearly every Congressperson and high ranking military officer since the administration of JFK. Good God! LBJ murdered his way to high office and continued his crimes as vice-president and president! Has anyone out there cracked a Ph.D.-level American History texts? How about an undergraduate text? And the \"swamp\" in Washington that Trump so eloquently stated he'd \"drain?\" This swamp is now a Cretaceous jungle where 40 foot-long, 18,000-pound Sarcosuchus imperators rule. When these monsters finally consolidate their power and wealth, after they've utterly gutted the planet for the remaining resources, when the planet teeters on the razor's edge of extinction and World War III sets the world ablaze to cover environmental horrors, the rest of us are going to be served up as crispy crocodilian hor d'oeuvres. Thanks for your help.",
    "likes": 0
  },
  {
    "commentText": "Who cares nothing will ever happen to Hillary....the deep state loves her",
    "likes": 0
  },
  {
    "commentText": "HOW in the Hell do all these Fox Women cope with having to keep their legs crossed ?!",
    "likes": 1
  },
  {
    "commentText": "Can liberals really be this stupid?",
    "likes": 0
  },
  {
    "commentText": "Hillery and Bill were fighting over who was gonna wear the black strap on dildo.",
    "likes": 0
  },
  {
    "commentText": "What an  interview, paints a vivid portrait of the out of control clinton mafia. Hard not to know someone who has identical character defects,as the mr. And mrs.",
    "likes": 0
  },
  {
    "commentText": "namaste, hell your people look so uncomfortable like they saying things they're not aloud to speak about. shit hope this man gets out of your studio safely. may we all be free",
    "likes": 1
  },
  {
    "commentText": "Would be nice if the Secret Service agents would do the American public a favor and take the Clinton's down - it's very apparent to most now that they are Criminal, murdering Satanists that do not care about the public what so ever, only themselves.",
    "likes": 0
  },
  {
    "commentText": "fake news from fox as usual",
    "likes": 0
  },
  {
    "commentText": "ewwwww  hiliary exsposing herself ?",
    "likes": 0
  },
  {
    "commentText": "FAKE NEWS!",
    "likes": 0
  },
  {
    "commentText": "i guess she does hate men...she married a dog who screwed anything with a hole...animated/ inanimate it does matter to a horny unrestrained, dog with no scruples. they deserve one another.",
    "likes": 0
  },
  {
    "commentText": "Peckerhead Brian Kilmeade shut the f up up and let your guests speak and finish answering your questions",
    "likes": 0
  },
  {
    "commentText": "Anyone with an IQ of -12 with knows you can get busted each time you delete an email or not? or for that matter text messages! Apparently the only ones that don't know is Hillary Clinton and the FBI. How secure do you feel now America? Aren't you glad Madam Pantsuits Cigar Bill  was not elected as your POTUS? Unfortunately we still have the FBI and the State Dept that has yet to come clean on their corruption! Makes you long for the days homo Edward J Hoover! Laud Ham Mercy!",
    "likes": 0
  },
  {
    "commentText": "Skunk",
    "likes": 0
  },
  {
    "commentText": "this guy better watch people on the wrong end of the clintons always end up found dead of apparent suicide.",
    "likes": 0
  },
  {
    "commentText": "Many loved Hellary. Still may do Hillary.",
    "likes": 0
  },
  {
    "commentText": "...context? What would you do/ how would you feel if your partner was practicing infidelities in your home AND you've got people actively hiding the fact that you know in your own home? This is more interesting apparently than the Panama Papers or Childgate...",
    "likes": 0
  },
  {
    "commentText": "He must know something cowley and Comey and Starr don’t know. He should investigate trump’s mob ties .",
    "likes": 0
  },
  {
    "commentText": "Tell America why Hillary Obama and Michelle or Michael Obama are still alive. Should they all be shot and killed in public. Yes they should. Let trump send the military in and rid the earth of this trash.",
    "likes": 0
  },
  {
    "commentText": "The U1 explanation is pending. That is all heads of state with Mueller at head of. Intel.",
    "likes": 0
  },
  {
    "commentText": "A former neighbor of my parents worked at the WH during Bill's first Presidency and shared some stories about  Hillary's temper, arrogance, foul mouth and attitude towards uniforms. He was former military and said she had the most foul mouth he had ever heard.",
    "likes": 0
  },
  {
    "commentText": "She is going to hate Gitmo when she gets locked up🤣🤣🤣🤣🤣🤣🤣",
    "likes": 0
  },
  {
    "commentText": "Wow",
    "likes": 0
  },
  {
    "commentText": "My dad worked with Gary along time at the White House both as officers",
    "likes": 0
  },
  {
    "commentText": "He was an officer not an agent",
    "likes": 0
  },
  {
    "commentText": "I hate the Clintons as much as anyone, but really \"Breaking News, married couples fight and sometimes women can get violent\", wow keep up the thorough work.",
    "likes": 0
  },
  {
    "commentText": "Monica...what a skank . I hate women that play the victim, when in fact they were the antagonist",
    "likes": 0
  },
  {
    "commentText": "The Pedo Queen....",
    "likes": 0
  },
  {
    "commentText": "Respect for this body gard!\nThank you Sir!",
    "likes": 0
  },
  {
    "commentText": "should have finished Hillary off a long long time ago.. here and Bill both are nothing but leaches... who eat the very flesh of anyone close by...",
    "likes": 0
  },
  {
    "commentText": "Bush and Clinton families are scum.",
    "likes": 0
  },
  {
    "commentText": "5:29 SAYS IT ALL",
    "likes": 0
  },
  {
    "commentText": "Can anyone honestly blame bill for being with Monica? Look at his hideous wife, and the science experiment known as Chelsea .. Bill may have had a lot of affairs over the years, but he has had to live with that psycho so he has served his prison sentence already",
    "likes": 0
  },
  {
    "commentText": "PATHETIC! All the real crimes  this  guy knows about  and he  brings  this  milk-toast?  And the Bushes were people of good  character??? WTF? RIDICULOUS",
    "likes": 0
  },
  {
    "commentText": "Fake news👎👎👎👎👎",
    "likes": 0
  },
  {
    "commentText": "I'm glad that there are people who expose vile corrupt politicians like the Clinton's, but its not surprising really. In my opinion, they've been lying to and robbing millions from your Country ever since they've been involved in politics.\nIt's tragic really but as we've got to know them over all these years, we've all found out that they've not behaved ethically at all and have often used charity as a front for corruption.",
    "likes": 0
  },
  {
    "commentText": "I know people who for at NYPD and NJ State Troopers and all claim she is the biggest CUN.... they've ever had to work with (for protection).  \n\nYou have to work pretty hard to earn that title..............enough said.",
    "likes": 5
  },
  {
    "commentText": "Hillary Clinton is the most investigated person on the planet. why do you think she has never been indicted for anything/ Maybe it has to do with the fact that the tuff she's accused of doing never happened? Use your brain.",
    "likes": 1
  },
  {
    "commentText": "imagine that.",
    "likes": 1
  },
  {
    "commentText": "TRUMP 2020",
    "likes": 5
  },
  {
    "commentText": "Hillary rotten has a fetish for rapists hell she even married one",
    "likes": 0
  },
  {
    "commentText": "I wonder if this guy is still alive..",
    "likes": 0
  },
  {
    "commentText": "He’s FOS.  This does NOT need to come forward; true or not.  He acts like he’s doing the world a favor.  Greed.",
    "likes": 0
  },
  {
    "commentText": "Surprised that Satans Bride didn't have this guy 'disappear' in dubious circumstances, like all the others!",
    "likes": 4
  },
  {
    "commentText": "This is sad...the information he he has is due to his job, which should all be off limits for him to write about",
    "likes": 0
  },
  {
    "commentText": "👧 ✌🏼of💩",
    "likes": 0
  },
  {
    "commentText": "is he still alive.\ni expect this man to of been dead due to a apparent 'suicide'",
    "likes": 0
  },
  {
    "commentText": "All msm is selling you something.  🤔. Remember this. Trump is an elite tv actor backed by the Zionists joooos",
    "likes": 0
  },
  {
    "commentText": "HILLARIOUS HILLARY LOOKS LIKE SOMETHING THAT CRAWLED OUT OF A REPTILIAN'S ASS\nAND COUGHED OUT A BILLY GOAT THAT EATS SHIT AND THEN LIES ABOUT IT LATER,  WTF?",
    "likes": 1
  },
  {
    "commentText": "I’m glad this man wrote his book I just hope he’s sleeping with one eye open cause I’m sure he’s in the Clinton’s bingo book now.",
    "likes": 0
  },
  {
    "commentText": "Perhaps if this guy was on another network other than Fox, I might believe his story.",
    "likes": 0
  },
  {
    "commentText": "She hates men? That explains a lot of her anti-male statements.",
    "likes": 1
  },
  {
    "commentText": "Faux News at it again.",
    "likes": 0
  },
  {
    "commentText": "Hate baiting gossip Bullshit.",
    "likes": 0
  },
  {
    "commentText": "Clinton is just as bad as fox news trump and ignorant sheep trump followers. God bless America.",
    "likes": 0
  },
  {
    "commentText": "Bill Clinton had a very good economy during his presidency. Too much 24 hour news, we do not need to know about his affairs. That type of news dirties the airwaves. CNN started live news 24/7/365 and it has been a mess. How did CNN just happen to have cameras live recording the World Trade Centers minutes before the jets crashed into them??? They said we do that all of the time, just put cameras randomly in places and record. Right, and CNN is completely truthful and never does fake news. They had a fake excuse for fore knowledge of 911.",
    "likes": 1
  },
  {
    "commentText": "LOL!!! Fox News is hilarious.",
    "likes": 0
  },
  {
    "commentText": "This just shows us just how careful we have to be as voter's to make sure before we vote to make sure we get the real facts about the person who is running for President. Look just at the last President Obama almost brought this great nation down and no doubt crocked Hillary would had finished the job. People wake up before it is to late. Thank God those who voted for President Trump.",
    "likes": 5
  },
  {
    "commentText": "His actions a little strange too.",
    "likes": 0
  },
  {
    "commentText": "Blue vase, blue dress ... What difference does it make ??? LMAO",
    "likes": 5
  },
  {
    "commentText": "Arkansas drug dealers",
    "likes": 1
  },
  {
    "commentText": "RIP",
    "likes": 0
  },
  {
    "commentText": "These people were running your country, FFS",
    "likes": 1
  },
  {
    "commentText": "God protect this man.",
    "likes": 0
  },
  {
    "commentText": "not one agent would have taken a bullet for this witch",
    "likes": 0
  },
  {
    "commentText": "This dude is the biggest piece of s*** ever should have spoke up years ago .. but know you stood by and collected all that money with her only care about your check every week and you probably got p a I'd to do this",
    "likes": 0
  },
  {
    "commentText": "Nonsense. Hey Gary this has nothing to do with the job of President. It's called Gossip Girl and it's worthless as is this video. Garbage",
    "likes": 1
  },
  {
    "commentText": "Hillary then destroyed the lives of the young woman that simply told the truth about her and her husband. Despicable human being.",
    "likes": 4
  },
  {
    "commentText": "Sadly enough, this guy is playing with his life. I hope he doesn’t turn up in the Clintons’ extensive body count. 🤔",
    "likes": 1
  },
  {
    "commentText": "I know some of the troopers who protected the Clintons when he was Governor.  It's true, the troopers hated guarding them, they treated their detail like crap.",
    "likes": 1
  },
  {
    "commentText": "Who cares she isn t president Crook Trump is",
    "likes": 1
  },
  {
    "commentText": "monica was a real catch,",
    "likes": 0
  },
  {
    "commentText": "u not saying fuckall??? yeah she is evil but u havnt said anything about her??? everyone has fights so what! tell us more about her!?",
    "likes": 0
  },
  {
    "commentText": "Id still bang her",
    "likes": 0
  },
  {
    "commentText": "MORE BULL SHIT FROM FOX....IS SHE RELEVANT...NO ONE ELSE TO BLAME I GUESS",
    "likes": 0
  },
  {
    "commentText": "Because they got rich doing shameful shit",
    "likes": 0
  },
  {
    "commentText": "Most criminals don’t like law enforcement. I wouldn’t protect either one of them",
    "likes": 0
  },
  {
    "commentText": "Wow ,EVERYONE KNOWS NOW",
    "likes": 0
  },
  {
    "commentText": "when does it end, with these criminals. rotton to the core.",
    "likes": 0
  },
  {
    "commentText": "Larry Nichols (here on the tube) has given some very revealing first hand accounts of his days with the Clintons. The night he first reported for duty was fund raiser for Bill's Ark gov run. He said Hill showed up late in a muumuu with hairy armpits and legs and would allow no one to introduce her or refer to her other than as \"Hillary Rodham\". Bill was getting busy with a waitress in the bathroom and Larry thought to himself: I hope this job pays well because these two are are pair to be reckoned with.",
    "likes": 2
  },
  {
    "commentText": "Clint Hill and the SS of the Kennedy White House kept their mouth shut for years,this guy writes a book and you can't shut him up.What will you do when Navy Seals start writing books about their life. Bottom line ,if your in the SS or any sensitive detail  KEEP YOUR MOUTH SHUT !!!!!. if this gut said this about Bush or any other Conservative the right would have his head on a platter,but because it's Clinton (who I don't like ) then he's a patriot.",
    "likes": 0
  },
  {
    "commentText": "Evil people.",
    "likes": 0
  },
  {
    "commentText": "great video",
    "likes": 0
  },
  {
    "commentText": "And people wanted Hillary as it's president!!! Don't be idiots people this bitch doesn't care about you or anyone else",
    "likes": 2
  },
  {
    "commentText": "You freakin trump supporters need to quit drinking his koolaid and turn off fox news. 😂😂😂",
    "likes": 0
  },
  {
    "commentText": "Good on yeah!",
    "likes": 0
  },
  {
    "commentText": "2 years ago folks just forget this shit",
    "likes": 0
  },
  {
    "commentText": "I want to know if the blue vase was part of the white house or if they brought it from home? Because everything and I mean everything in the white house belongs to the people. Why do you think Obama stole as much crap as he could fit into his greedy little pockets. The millions on top of millions these people have stolen from the American people is sad!!!!",
    "likes": 0
  },
  {
    "commentText": "THATS EASY TO DO.",
    "likes": 0
  },
  {
    "commentText": "WONDER  HOW  HE  WILL  DIE ?",
    "likes": 0
  },
  {
    "commentText": "should have brought this shit up in the election Hillary would have won for giving bill a black eye.",
    "likes": 0
  },
  {
    "commentText": "Bill can cheat, but Hillary can’t get mad...",
    "likes": 0
  },
  {
    "commentText": "Cliteron Hellary",
    "likes": 0
  },
  {
    "commentText": "Democrats are demon possessed ......Soaring Raven.....soaringraven1",
    "likes": 0
  },
  {
    "commentText": "Check out Kevin Shipp",
    "likes": 0
  },
  {
    "commentText": "so essentially and in a nut shell they are both ugly people,horrible leaders,and shit stains on western civilization,so ahhh,what else is new?",
    "likes": 0
  },
  {
    "commentText": "so glad this guy spoke up---glad Hilary wasn't elected President",
    "likes": 0
  },
  {
    "commentText": "a friend of mine's niece was a white house intern and she was groped by this pos Bill Clinton",
    "likes": 1
  },
  {
    "commentText": "And this woman was sooooo close to being president. Scary .... very scary",
    "likes": 0
  },
  {
    "commentText": "You better have security 24 hrs a day or her goons will get to you. Wait, was the blue vase a priceless antique?",
    "likes": 0
  },
  {
    "commentText": "TRUMP 2020",
    "likes": 1
  },
  {
    "commentText": "I was watching a 28 minute interview with this guy youtube shut down and now I can't find it..... hmmmm..... censoring much.",
    "likes": 0
  },
  {
    "commentText": "Is he allowed to do this?",
    "likes": 0
  },
  {
    "commentText": "I wouldn't want to see Hillary \"exposed\"...without a Hazmat suit and a blindfold on...",
    "likes": 9
  },
  {
    "commentText": "Dead man walking",
    "likes": 0
  },
  {
    "commentText": "Hates military and law enforcement ?   What ASSHOLES !!!!",
    "likes": 0
  },
  {
    "commentText": "Why is she still on the streets?  USA Citizens just eat your chips and drink your drinks and stay asleep...So they can collapse the economy and send you a fema bus for your next meal....",
    "likes": 0
  },
  {
    "commentText": "\"believe all the stories you hear...\"  I've heard AWFUL rumors about the Clintons.  \"...Dangerous angry behavior\"",
    "likes": 3
  },
  {
    "commentText": "Change the batteries in your smoke detectors idiots. chirp",
    "likes": 0
  },
  {
    "commentText": "chirp",
    "likes": 0
  },
  {
    "commentText": "like Hillary wasn't exposed before and this is new news? all of this is old news and not one person has lifted their finger to take out these traitors/criminals!!!",
    "likes": 0
  },
  {
    "commentText": "I have no problem with the female but what he said was she's not capable and she is not a leader",
    "likes": 0
  },
  {
    "commentText": "Gary Byrne: my hero --- for real.  No joke.",
    "likes": 0
  },
  {
    "commentText": "Don't anyone remember the Cocaine and Gun running in Arkansas.Good job on the Book.",
    "likes": 0
  },
  {
    "commentText": "PASSING THE BUCK DONALD CHUMP YET ONCE AGAIN FOR YOUR RUSSIAN CRIMES ARE YOU ASS HOLE I MIGHT DISPISE THIS HARPIE BUT I WONT HAVE IT GO DOWN FOR A CRIME IT DID NOT COMMIT THATS ILLEGAL AND PRETTY DUMB AND YOU CALL YOURSELF A STABLE GENIUS THATS A REAL FEMALE AND MOTHER YOUR SETTING UP FOR YOUR EVIL YOU IDIOT PEDIOPHILE CANNIBAL WHO GET FUCKED BY A BULL STUPID AND MARRIED TO A TRANNY NO LESS",
    "likes": 0
  },
  {
    "commentText": "You won't see this on CNN !!",
    "likes": 0
  },
  {
    "commentText": "She lost and will never be the POTUS.",
    "likes": 0
  },
  {
    "commentText": "Research Says Gary Byrne Was a Uniformed Officer, Which Is The Lowest Detail Of Secret Service....And At Best, Would Have Only Seen The Clintons Passing In The Hall...Or Would Have Been About 15 Feet Or So To The Rear Of The President....Yet...He Claims To Have Been The Last Barrier To The President....And He Witnessed All These Hillary Explosions....I'm Not Saying Hillary Wasn't a Wack-Nut.....But Based On This Guys Position At The Secret Service....It's Not Likely He Witnessed What He Claims To Have....Plus Why Did He Wait Ten Years Before Telling All This???.....",
    "likes": 0
  },
  {
    "commentText": "She's butch and he's a male whore. Their marriage is political and nothing more. I've always known this.",
    "likes": 0
  },
  {
    "commentText": "Hillary have an elephant skin she already showed us when she Asked :  What's happened? \nHillary what's happened? America don't trust you. Leave just leave.",
    "likes": 0
  },
  {
    "commentText": "At the very least, by 2020 Hillary will be in Jail.  That's the safest place for her to be.\nWhere she will never be is in the Oval Office.",
    "likes": 0
  },
  {
    "commentText": "I want these bastards to suffer for their evil deeds.  Please, God, make them accountable --  put them in prison!",
    "likes": 4
  },
  {
    "commentText": "Those two were made for each other mental illness or demonic illness",
    "likes": 0
  },
  {
    "commentText": "What a liar Byrne is.  See link.",
    "likes": 0
  },
  {
    "commentText": "I dislike the Clintons and believe they are worst thing that this country ever produced next being that other snake barry sotoro, but I don't agree with what this guy is doing. If he was truly trying to make a change and inform us on that snake hilary he should of done it when it counted like in 2006 to 2012. Other words he's no different then them and is trying to capitalize on the money. That's jus my opinion.",
    "likes": 0
  },
  {
    "commentText": "Everyone knows hillary is Gay & has been all her life, only married to Bill for political  reasons, consequently Bill chases women.",
    "likes": 0
  },
  {
    "commentText": "Surprising, \nHillarywas actually fuckable at one time",
    "likes": 0
  },
  {
    "commentText": "Planned Parenthood is advertising on this channel!!!!!",
    "likes": 0
  },
  {
    "commentText": "Here's hoping you don't become another body count of Hillary.",
    "likes": 0
  },
  {
    "commentText": "I knew that Bill and \nHis wife didn't get along \nThey just put on show . \nAnother example why \nShe should never be in \nOffice . She also attacked\nHer staff the night she lost\nThe race to President . \nThis woman needs to be\nIn JAIL . Throwing Bibles \nShe is to childish ! \nAnd to moody to be in\nAny office .",
    "likes": 0
  },
  {
    "commentText": "Monica Lewinsky is Osama bin Laden's g friend",
    "likes": 0
  },
  {
    "commentText": "I am going to go find this book! I bet it's a good one!",
    "likes": 0
  },
  {
    "commentText": "Um",
    "likes": 0
  },
  {
    "commentText": "Why is she not arrested yet? Why hasnt she been tried for treason yet??",
    "likes": 0
  },
  {
    "commentText": "Good job being a good American telling the US people what is up. The monopoly MSM owned media lies and hides important info. They ignore and promote the Soros and the like funded anti gun propaganda and lies proven lies by the experts that do the peer reviewed scientific studies published in scholarly journals work. THE CRIMINOLOGISTS \n     In Commiefornia we have one of or the biggest anti gun legislators pushing laws that do not solve issues and are not issues into law Senator Leland Yee. He was busted for arms trafficking  even ones of state and federally illegal guns. Full auto and RPG's !",
    "likes": 0
  },
  {
    "commentText": "LMFAO THE CLINTONS ARE JUST TRASH !!!!",
    "likes": 0
  },
  {
    "commentText": "Shocking he’s still alive after exposing this.",
    "likes": 0
  },
  {
    "commentText": "Dirty Former Secret Service agent!",
    "likes": 0
  },
  {
    "commentText": "SHE'S STILL CRAWLING AROUND FREE! WHY?😥",
    "likes": 0
  },
  {
    "commentText": "Fox needs to change things up. I’m tired of seeing the same bleach blonde bimbo sitting between two doofuses.",
    "likes": 0
  },
  {
    "commentText": "Another agent wrote in late nineties that the White House Christmas party included a Christmas tree adorned with birth control which may have been used by attendees later in places inside the White House.  That did it for me.",
    "likes": 0
  },
  {
    "commentText": "Many people have come forward about both of them and no media coverage about the underhanded things they have done, the sexual predator Bill, or her nasty mean personality..... why not?",
    "likes": 0
  },
  {
    "commentText": "The Clintons are deplorable and hopefully will stay in our passed.  Let’s move forward and get the “Trump Crime Family” out of the White House and into jail.   LOCK THEM UP...",
    "likes": 0
  },
  {
    "commentText": "We heard this years ago. Is there anything new",
    "likes": 0
  },
  {
    "commentText": "Don't care about Rules and Law. LMAO 😂",
    "likes": 0
  },
  {
    "commentText": "I hope he has protection, or he'll be suicided like so many.",
    "likes": 0
  },
  {
    "commentText": "Clinton foundations next suicide?",
    "likes": 16
  },
  {
    "commentText": "It is so satisfying to know that she will die a bitter unfulfilled shrew!!!",
    "likes": 0
  },
  {
    "commentText": "Finally someone who is coming forward to tell just how evil  and what a lying old hag, Hillary Clinton is!",
    "likes": 0
  },
  {
    "commentText": "I bet there's a buncha shit that he decided to leave out because of the actions of these scumbags was so bizarre,  he knew no one would believe it.",
    "likes": 0
  },
  {
    "commentText": "could you imagine waking up one morning after a drinking night and see this bitch sleeping next to you, and then praying thast your pecker is not sticky,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,BURN THE SHEETS",
    "likes": 0
  },
  {
    "commentText": "If any of this were true, wouldn't he be a target? I don't buy it! I imagine they know thousand times more people than ordinary people do. Therefore since they know more people, they would know more people that pass away or die. Every single person on Earth dies and I say it's just coincidence. I really doubt their secretly Hitman. I shook bills hand one time and spoke with him before at public speech. His hands are as soft as baby skin. His hand shake was firm but not too firm.Very gentle type of guy. The guy was extremely nice and was very down to earth. Politics aside, I didn't see a evil bone in his body. Now Hillary on the other hand, she was pretty stuck up but still too old and brittle to do anything their trying to say she does. I respect all presidents regardless of party. People need to show a little more respect to our presidents. If people quit looking at just negative things I almost bet every single person could find at least one thing they like about every president we have had. Quit focusing on fabricated news and negative thinking. It does no one any good. Try to think more about the positives and although hard to do with some presidents I'm sure every president has done at least one thing you agree with. I think political parties is what is dividing our country and I think there should be no parties. Then good people with good world and domestic views would be elected. The problem with parties is that half the country won't support a president regardless how good or bad they are just by their political affiliation. Political parties are just about like a bunch of gangsters if I had to compare it to something. Who decided what Democrats and Republicans value as important? Because 90% of what they think is important I don't and vice versa. I agree with some views from all parties because I'm open minded. I think all laws past should be general public voting. Not by a select few. With technology today it would be easy to have US citizen vote on our countries laws and policy. What worked in the 1700-1800s is outdated and no longer works. That's why Congress can't get anything accomplished. It's all about which party controls congress, president can only do so much. Congress can do way more than president but all the blame gets put on president. I just think if your a US citizen, you should support your president like I'm doing now with trump. Not my favorite guy in the world but I want him to succeed, not to fail. Some citizens want the president to fail but if he does he will take us down with him. So might as well just support our president because he is the only president we have right now. If you don't support our president, in my opinion your not a real US citizen. You can go live in Afghanistan and tell us how far your whining gets you there. We are a very fortunate country and people who haven't traveled the world have no clue just how good we have it! No country is perfect but just saying we are extremely lucky. We have flaws but nothing that can't be fixed. We are at a point where technology has surpassed most of the current laws. The Congress can't change laws fast enough and are about 50 years behind. That's why public voting as long as not corrupted I think could fix these problems rather fast and way faster than politicians could ever dream of. We don't need politicians, we need everyday people who know real life problems to run this country. Not the top 1%. But until the day something changes, people should support whoever is in office regaurdless.",
    "likes": 0
  },
  {
    "commentText": "It's sad these things happened, but this man is clearly violating his confidentiality oath. He's wanting to make money from exposing highly personal matters from inside someone's home.",
    "likes": 0
  },
  {
    "commentText": "The idiots on the left want a civil war because the Russian collusion didn't pan out over this corrupt  mean old hag",
    "likes": 0
  },
  {
    "commentText": "Clinton is the reason lawlessness is rising she was and is awful thing but no one can stop. it is 2018 sand she is still walking free",
    "likes": 0
  },
  {
    "commentText": "Right wing bullshit  how much did he get paid for this Trump who is the biggest clown America  u have no brains there's no proof  what he's saying",
    "likes": 0
  },
  {
    "commentText": "Hahaha good stuff.\nI heard the same thing about knock down drag out fights in the White House with Hillary throwing things... From a former Secret Service agent who knows my sister",
    "likes": 17
  },
  {
    "commentText": "Thanks for your service and infornation.",
    "likes": 0
  },
  {
    "commentText": "Is this guy dead yet?",
    "likes": 0
  },
  {
    "commentText": "it isn't her fault. it because trump collioded wit da russians",
    "likes": 0
  },
  {
    "commentText": "You are all so lucky that TRUMP won .",
    "likes": 0
  },
  {
    "commentText": "'She doesn't like men'.... It fits with what Brice Taylor writes in her book, \"Thank you for the memories\"  about HC and BT. Brice, tells she was a young girl when she was brought to a hotel room and forced to spend time there with HC. Read the book.",
    "likes": 0
  },
  {
    "commentText": "She's finshed. They are elite scum.",
    "likes": 0
  },
  {
    "commentText": "Domestic violence added to their list of bullshit. LoL",
    "likes": 0
  },
  {
    "commentText": "The bible said it best. Woman were trouble from the beginning. Smh",
    "likes": 0
  },
  {
    "commentText": "we would be in WW3 by now  if that bitch had got in",
    "likes": 0
  },
  {
    "commentText": "Xc",
    "likes": 0
  },
  {
    "commentText": "Is he serious! Theres no honor in a Rat! Esp a rat whom eaves drops on family disputes!!!!!!! He's a disgrace and an opportunist !!!!! Shame on him and on Fox!!!!!",
    "likes": 0
  },
  {
    "commentText": "didn't the FBI cover up the Clinton's foul stench?",
    "likes": 4
  },
  {
    "commentText": "Clinton is a disgusting pig she’s sitting back laughing that everyone is making it so hard on trump",
    "likes": 0
  },
  {
    "commentText": "CNN LIES LIES LIES. . PLEASE POST THIS ON ANY CNN VIDEO YOU SEE TILL THEY START TELLING THE TRUTH",
    "likes": 0
  },
  {
    "commentText": "Good man!",
    "likes": 0
  },
  {
    "commentText": "Gary here just filed a lawsuit against them. He`d better hurry, Before the Congress Freezes her Her stolen assets. That means ALL her assets.",
    "likes": 0
  },
  {
    "commentText": "Please Fox news nothing but FAKE NEWS i am sorry trump news.",
    "likes": 0
  },
  {
    "commentText": "BILL CLINTON SHOULD BE ASHAMED OF WASTING GOOD CIGARS.  LOL",
    "likes": 0
  },
  {
    "commentText": "dude came forward for money...cmon really",
    "likes": 0
  },
  {
    "commentText": "Witch and warlock",
    "likes": 0
  },
  {
    "commentText": "Thank God this man came forward to reveal the UGLY TRUTH!",
    "likes": 0
  },
  {
    "commentText": "Fox is part of mainstream media propaganda machine !",
    "likes": 0
  },
  {
    "commentText": "I can't believe it!!  A man who tells the truth. Thank you. \n You can either be on the cover up team or the CLEAN UP TEAM.\n What team are you on?",
    "likes": 0
  },
  {
    "commentText": "As Always, Thank You FOX",
    "likes": 0
  },
  {
    "commentText": "Keep him alive remove all doorknobs",
    "likes": 0
  },
  {
    "commentText": "JUSTICE HAS A DOUBLE STANDARD. \n\"ALL MEN ARE CREATED EQUAL?\nOH I SEE, THIS DOESN'T APPLY TO WOMEN👹\nLOCK HER UPPPPPP",
    "likes": 0
  },
  {
    "commentText": "Fucks news",
    "likes": 0
  },
  {
    "commentText": "Ha-ha! You people are acting like this is the most horrific thing you've ever heard! This is it? After all Bill's extramarital behavior? It isn't like she had 3 husbands already, or cheated while Bill was pregnant, or was caught in a recording how she likes to grab d***, w/o even asking, because of who she is, of course. Ha-ha! This is why you all are responding this way? That you don't, about the way Trump acts is a clear cut as to how dumb you are! Thanks… this, I HAD TO SEE!",
    "likes": 0
  },
  {
    "commentText": "Anything on Faux is fake!",
    "likes": 0
  },
  {
    "commentText": "The Clintons will NEVER HAVE TO ANSWER for any of their MANY CRIMES!!! They will always WALK FREE...they are untouchables!!!",
    "likes": 0
  },
  {
    "commentText": "VASE STORY PROVES SHES NUTS",
    "likes": 0
  },
  {
    "commentText": "She’s a piece of shit, that’s a well known fact now. I couldn’t of been happier when she lost",
    "likes": 0
  },
  {
    "commentText": "I've heard stories that  Hil - LIAR - y  will soon be placed in suspended animation  (Like on the Jupiter 2 on,  \"Lost in Space\")\nand thawed out in the Earth year  2099  A. D.  to run for President of the planet Uranus.",
    "likes": 0
  },
  {
    "commentText": "Seeing the absolute monster Hillary turn into easy to forget she was kind of hot way back in day",
    "likes": 0
  },
  {
    "commentText": "One of them should  make her allergic to led",
    "likes": 0
  },
  {
    "commentText": "He is probably on her hit list.",
    "likes": 0
  },
  {
    "commentText": "Hope this guy doesn't get caught up in another doorknob.",
    "likes": 0
  },
  {
    "commentText": "Take care man, your dealing with Jezebel and Jezeboy; be sure you are safe... God Bless you for exposing them.",
    "likes": 0
  },
  {
    "commentText": "They need to Lock her up",
    "likes": 0
  },
  {
    "commentText": "Have you heard voting for Hillary this is a scary thing to read it could be a horror story Hillary as the demon she is what can she do for America  the right people are honest and trustworthy..Hillary is not do not be fooled she is a wicked, wicked women and involved in petofile it known please take her past into consideration and let our country be what the Americans deserve!!!",
    "likes": 0
  },
  {
    "commentText": "This guy still around?",
    "likes": 0
  },
  {
    "commentText": "Bill Clinton may be the most important president ever because without his skirt-chasing Hillary would have beat Obama and become president in 08. Thanks, Bill!",
    "likes": 0
  },
  {
    "commentText": "Hillary so disgusting, riding his coattails to high office.",
    "likes": 0
  },
  {
    "commentText": "Has anybody ever seen Hillary bow her head and pray, before a speech? Before a meeting? She can whoop Pneumonia in three days. How is that possible? Oh well, what does it matter now?",
    "likes": 0
  },
  {
    "commentText": "Why does Bill Clinton always look stoned af?",
    "likes": 4
  },
  {
    "commentText": "Now somebody needs to push this killaryzilla clinton family toget a dna for this boy danny he needs to no if rapes bill is his dad own it bitch rapes bill 😣😣😣😣😣😣😣😣😣😣😣b a man nt a mouse hoe",
    "likes": 0
  },
  {
    "commentText": "I like how  this dude starts to answer everyone's questions before they finish asking the question .  Very annoying",
    "likes": 0
  },
  {
    "commentText": "BUSHES class act?????? your kidding right?  They are drug users, DRUG SMUGGLING, CHILD TRAFFICKING,  NAZIS, PEDOFILES AND SATANISTS  among many other  criminal things.  Tell the fricken truth.",
    "likes": 0
  },
  {
    "commentText": "Based on the storys , public record, congressional investigation, the Clinton Foundation, the list goes on; how anyone other than a Clinton  acolyte , parasite  would believe them to be innocent of  malfeasance and fraud on a major scaale",
    "likes": 0
  },
  {
    "commentText": "She is genuinely psycho! We escaped a bullet!",
    "likes": 0
  },
  {
    "commentText": "It seems to me that all that gold the Clintons spun from manure, it starting to turn back into manure!",
    "likes": 4
  },
  {
    "commentText": "Does anyone have the guts to take them out!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "likes": 0
  },
  {
    "commentText": "trump is,a hugely well known pedophile and has a lawsuit against him for it.",
    "likes": 0
  },
  {
    "commentText": "fox news are liars and are not credible. Dont buy into their bullshit.",
    "likes": 0
  },
  {
    "commentText": "This video just reitterate what I already know about the Clintons!",
    "likes": 0
  },
  {
    "commentText": "Make sure you show her Strap on Dildo..",
    "likes": 0
  },
  {
    "commentText": "Hillary is a man hating axxhole . our country almost had a major catastrophe when the established swamp and media did backward summersaults to get her elected.in the end they all lost and America won.",
    "likes": 12
  },
  {
    "commentText": "Interesting",
    "likes": 0
  },
  {
    "commentText": "Doesn’t the mention of “Demoncrats” and the \"Salem Mass. Witchcraft Trial Instigators,  Judges and Executioners\" and the “Spanish Inquisition” both latter of which involved the burning at the stake of those alleged to be witches, this done by the evil ones who themselves were disciples of Lucifer, instantly and unquestionably appear to be totally “Synonymous” acts and actions?! \nCoincidence??? Most Certainly Not!!!!!!\n \nPOOR, POOR TOTALLY POSSESSED DEMONIIC HELLERY,  ONE OF THE PRIMARY CANDIDATES FOR THE DESIGNATION OF POSTER WITCH FOR THE  TOTALLY DEMONIC SATAN’S DISCIPLES COVENS  ,  SHE THANKFULLY WILL ONE DAY BE NO MORE IN THIS VENUE . . . BUT \"WAITING IN THE WINGS\" ARE THE MULTITUDE OF OTHERS WHO REMAIN ON THE SCENE ESPOUSING THE SATANIC MESSAGE TO ONE AND ALL WHOSE WEAKNESS OF MIND AND SOUL  TEND TO BE TOTALLY RECEPTIVE DUPES, THEY WHO WILL LISTEN AND MANY OF WHOSE WEAKNESS ARE PERVERTED BOTH IN MIND AS WELL AS IN THEIR SOUL AND THUS TEND TO BE LIKELY CANDIDATE ADDITIONS FOR LUCIFER'S DEMONIC POSSESSED; HIS  MULTITUDES OF DEVOTED DISCIPLES.",
    "likes": 0
  },
  {
    "commentText": "Clinton would have been the Democratic Nixon but then I love Nixon. Her slogan \"I am a CROOK\", and her dog is a transgendered cat like Dr. Evil has. \n\nmore silly thoughts...\nThe cat was born female but feels male and thus it becomes the first transgendered cat. The cat thought it was Mexican and thought it was an 'El Gatto\" but Hillary denies the cat's transracial nature. Your race isn't something you feel or choose but your gender and sex is totally up to you. It was pointed out by the White House Press Corp that Mexicans are not a race. To which Hillary disagreed and referred them to La Raza's website. In no way does Hillary have a racist ideology *sarcasm*. All I know is Hillary loves her cats. \n\nOver the years of her administration more and more cats would appear in the White House and in the end she had 64 cats. She became the first Purrrrfect \"Cat Lady\" president. \n\nShe also introduced and supported legislation to redefine marriage as 'any partner a citizen chooses'. After it was passed by a majority Democratic controlled Congress Hillary divorced Bill and married her favorite cats because she also passed Sharia Law so multiple husbands and wives yes both could legally be achieved. Massachusetts and California the penultimate cucked stated passed unanimously. She then married all 64 cats.",
    "likes": 0
  },
  {
    "commentText": "Dang - You tube stop trying to force feed me the lamestream news - which has already discredited itself so many times either mis-informing us re WMDs / the Libya lies on Hillary's behalf or failing to inform us about important issues.  I will never go back to the main stream corporate media because it's lied too many times - by omission and commission. I diidn't think I could hate the MSM more - but your force feeding is making me hate it.  I will never bother listening to another piece of propaganda from FOX or any other monopoly media source.",
    "likes": 0
  },
  {
    "commentText": "Stop trying to feed this crap to me - I am trying to watch someone with something to say.",
    "likes": 0
  },
  {
    "commentText": "Fox is a waste of an intelligent person's time!!",
    "likes": 0
  },
  {
    "commentText": "The Clinton's, a match made in HELL!!! If anyone's face should be hidden, it's hers! She doesn't like anyone but herself! It makes you wonder how she got pregnant?  Skank!",
    "likes": 0
  },
  {
    "commentText": "She is lucky that is all he said. It is sooo evident that there has been more protection and cover-ups to do with certain people involved in politics and Trump gets none of it. So obvious he is NOT part of their click. People who cannot see this need to dig beneath the surface and not just accept what the news says, you do not need to be Einstein to see common sense. Big shocks are coming. Trump WILL expose the corruption which is beyond most peoples comprehension. Trump will serve 2 terms due to the fact that people are waking up to the truth every day, his support base will only increase.",
    "likes": 0
  },
  {
    "commentText": "Stephanopoulos sucks Bill's cock...wouldn't surprise me either if he actually did. Clinton Foundation supporter and donator . But the pussy won't tell the truth ,he was right there !",
    "likes": 0
  },
  {
    "commentText": "search  ' Hillary Clinton MKultra'  see how Hillary sexually abused Female minors supplied to her through the once secret Nazi mind control programme.. Hillary PEDOPHILE",
    "likes": 1
  },
  {
    "commentText": "the Clintons are disgusting people",
    "likes": 0
  },
  {
    "commentText": "this is what is called Karma.  Clinton tried to destroy Trump, and now.....",
    "likes": 0
  },
  {
    "commentText": "this agent was fired for touching kids !",
    "likes": 0
  },
  {
    "commentText": "This old bitch is a smelly foul breath witch and treated Secret Service horribly.",
    "likes": 0
  },
  {
    "commentText": "Monica=great manipulator along with slick Willy.  Channukah Lewinsky=7 days of blowjobs from Monica.  hildebeest=so glad she lost",
    "likes": 0
  },
  {
    "commentText": "Former Secret Service agent can tell stories about his duty and his job???",
    "likes": 0
  },
  {
    "commentText": "I certainly hope the person that wrote the book has a lot of protection....I am sure he has heard of all hell breaking loose on people that tell the truth on the Clintons or are going to tell the truth.    Poor man. Watch your back.",
    "likes": 0
  },
  {
    "commentText": "Her loss to a politcal novice..is karma for all the horrible things she has done...maga 2020!",
    "likes": 0
  },
  {
    "commentText": "Creepy Bill with his fake \"Good Ol Boy\" expressions.... ugh.",
    "likes": 0
  },
  {
    "commentText": "How about Hillary having an affair with Shumer",
    "likes": 0
  },
  {
    "commentText": "Published on Jun 29, 2016 \nit's 2018 now i hope this guy hasn't had an accident \nplease protect this person",
    "likes": 0
  },
  {
    "commentText": "As if HC needed exposing, she will be in a retirement home before she will have to answer for all she did. Washington politicians have ways of covering up things and or disavowing culpability or claiming they were not amply informed of what was actually going on. Regardless, they are like law enforcement, they will never admit to any wrong doing and they cover for each other. We don't count, we're just cattle to be herded, to be controlled and therefore punished when we don't toe the line.",
    "likes": 0
  },
  {
    "commentText": "hell, Hillary and George stupidopolous should hook up, they would make a great couple....of idiots",
    "likes": 0
  },
  {
    "commentText": "I'm still mesmerized by that woman's beautiful hott pink dress and legs..  I bet she’s wearing Louboutins",
    "likes": 0
  },
  {
    "commentText": "True American, thank you...",
    "likes": 0
  },
  {
    "commentText": "Am I glad Donald Trump is the President? I don't know. Am I glad Hillary Clinton isn't the President? Hell yeah.",
    "likes": 0
  },
  {
    "commentText": "The Clintons are a cancer, they need aggressive chemo.",
    "likes": 0
  },
  {
    "commentText": "A wife is pissed because her husband had an affair.  No shit Sherlock.   THAT'S NORMAL",
    "likes": 0
  },
  {
    "commentText": "I don’t want her to become president bc my first period class teacher has two kids in the army and she ALWAYS tells us what’s they are doing......Hilary will get them killed 4 sure seriously how did she even get that far no offense it’s just my opinion but I mean come if she is ever president there will me no more America",
    "likes": 0
  },
  {
    "commentText": "TA   SECRET AGENET SAYS THAT HE  CAUSGHT  BILL  CLINTONS  LICKING TE ASS  HOLE OF MONIA     OF  HIS  AND  WAS SMOKING   THE CIGARE  AND SHE WAS  SMOKING  MARI JAUANE AND    HE       BILL       ICKING  HER   BUT AD   DRINKING   COFFE  UGHT  LICKINH HER ASS  HOLE IS UGH   HE WAS PREVERTED       CHILD   MOLESTER",
    "likes": 0
  },
  {
    "commentText": "I'm going to look for his book at the library.  We dodged a HUGE bullet when Hillary lost.",
    "likes": 4
  },
  {
    "commentText": "JUSTICE IS COMING AND BABYLON IS FALLEN.",
    "likes": 1
  },
  {
    "commentText": "Even Bill Clinton preferred someone other than Hillary! lol 😂",
    "likes": 34
  },
  {
    "commentText": "It's because they're damn Crooks and she's a fucking  lesbian..",
    "likes": 0
  },
  {
    "commentText": "Of course he will end up MISSING, gun shot in head.",
    "likes": 2
  },
  {
    "commentText": "\"She does not like men!\" Of course not! Her nickname is Licky-the-Dyke!",
    "likes": 6
  },
  {
    "commentText": "The Clintons are so corrupt .  They should be serving a very long sentence in prison",
    "likes": 16
  },
  {
    "commentText": "I swear Hillary died last yr. Lool at that woman besides bill when he was pres. Look at the woman beside him now.",
    "likes": 1
  },
  {
    "commentText": "Was the found dead yet?",
    "likes": 0
  },
  {
    "commentText": "I read the book. There is nothing negative about the Clintons in it.",
    "likes": 2
  },
  {
    "commentText": "Hey Democrats, you wanted to elect a psychopath!!!!",
    "likes": 0
  },
  {
    "commentText": "She looks like Palpatine in the thumbnail for this video",
    "likes": 0
  },
  {
    "commentText": "It's funny to think that Monica Lewinsky is a better person than Hillary Clinton. I bet Bill believes the same thing.",
    "likes": 0
  },
  {
    "commentText": "To definitely be a truthfully honest. Hillary Clinton is a possible behind the Pizzagate scandal. Definite signs of her well-perversed grain of Satanic Worship. The Wife that beats her Husband, what kind of perverted practices are these. In what upmost looks as if Bill is enduring for both status, and ritual. This will never be brought to light. Mysteriously, just recent; the Clinton's had a home fire, burning official documents, and scarce belongings into flames ... If Donald Trump jails them, he deserves another 8 years.",
    "likes": 0
  },
  {
    "commentText": "Having read his book, I was floored! He's too generous and non gratuitous. But it NAILS Hillary!!!",
    "likes": 0
  },
  {
    "commentText": "Blimey hillary has always been ugly with insane eyes, gives me the creeps! Wheres the vomit bucket",
    "likes": 0
  },
  {
    "commentText": "Spin manure into gold lmao...Sad, but true",
    "likes": 0
  },
  {
    "commentText": "C",
    "likes": 0
  },
  {
    "commentText": "dead man walking!",
    "likes": 0
  },
  {
    "commentText": "Why would anyone have voted for her she is such a lying witch, and yet they are trying to say my President is unstable.",
    "likes": 0
  },
  {
    "commentText": "no wonder why Bill Clinton kept mistress.",
    "likes": 0
  },
  {
    "commentText": "Fox \"News\" = Russian",
    "likes": 0
  },
  {
    "commentText": "Thank God for President Trump",
    "likes": 150
  },
  {
    "commentText": "Fox is FAKE NEWS!!",
    "likes": 0
  },
  {
    "commentText": "Faux news is crying SO hard.",
    "likes": 0
  },
  {
    "commentText": "Please stay safe-she is dangerously deceiving.",
    "likes": 0
  },
  {
    "commentText": "Better watch his back, they have over 50 bodies to there name.",
    "likes": 0
  },
  {
    "commentText": "You can’t blame Bill for cheating.",
    "likes": 0
  },
  {
    "commentText": "Surprised he is still alive...damn dude thanks for speaking out",
    "likes": 0
  },
  {
    "commentText": "The Clintons also stole White House pictures, furniture and other priceless items when they left the WH.",
    "likes": 0
  },
  {
    "commentText": "Secret Service nickname her \"The bitch\" during the Clintons first term...I cant imagine why.",
    "likes": 0
  },
  {
    "commentText": "I always knew Bill was a puppet and Hillary controlled the strings. But more important,WHO IS THAT LUSCIOUS Blonde sitting there ??? My god what a body",
    "likes": 0
  },
  {
    "commentText": "Amen for this dude cumming for me.",
    "likes": 0
  },
  {
    "commentText": "Brave guy",
    "likes": 3
  },
  {
    "commentText": "She needs a checkup from the neck up",
    "likes": 0
  },
  {
    "commentText": "Uh oh, he's saying bad things about the Clintons.......he will commit suicide by shooting himself in the back of the head three times with two different guns. Confirmed by a coroner who got a job working for a company affiliated with the Clinton foundation!",
    "likes": 0
  },
  {
    "commentText": "God bless this man,People who cant see how incredibly evil Hillary is simply dont want to,they are lost.",
    "likes": 0
  },
  {
    "commentText": "ive always said that- Hillary is a Freudian delight.talk about penis envy.except she doesnt wish she posessed a penis, she wishes she could slash every one she comes in contact with,stuff it,mount it and hang them in a great gallery as a testament to her exploits. hell it wouldnt surprise me if she has such a display.and Bubbas balls are likely hanging on a plaque amongst her collection.  she HATES men! and she is the coldest \"woman\" ever.\non top of her other characteristics,she has a massive false superiority complex and is a narcissist. a very dangerous combination.\n\nthank God she was sent scurrying back into her hole, tail tucked betwixt her hairy ass legs!\n\nlong live the 2nd amendment! show em how to do it, Trump!",
    "likes": 0
  },
  {
    "commentText": "Typical Liberal Hypocrisy. They (supposedly) stand for women’s rights and against spousal abuse, yet he’s a rapist and she’s a spousal abuser. Anyone who doesn’t believe this man has not been paying attention. Even at Bill’s first inauguration, Hillary didn’t realize her mic was on and was heard ripping him anew one. Read the book ‘Because He Could’ by Dick Morris (Bill’s right hand for years). He tells it all plainly. And the story he tells isn’t pretty. And Morris hasn’t exactly supported Hillary in any of her runs. Who would know these two better than Dick Morris?",
    "likes": 0
  },
  {
    "commentText": "Back in 1992, I knew that Bill Clinton was a scumbag. I could see right through Hillary; that she was an arrogant, condescending, power-hungry megalomaniac.  Clinton got elected in '92 because idiots such as myself voted for Ross Perot.  At least I can blame youthful ignorance for voting for Jimmy Carter in 76 & 80 but voting Perot in 92 was just plain stupid. So, that being said, I am partially to blame for inflicting this disease known as the Clintons on America; along with every other dunce who voted for Perot in 1992.",
    "likes": 0
  },
  {
    "commentText": "Trump broke the constitution and will be impeached/ sent to prison 😊😊😊",
    "likes": 0
  },
  {
    "commentText": "Congralations   to  this  brave  man  for  telling   the  truth -    How   funnty   that  Bills  worst  enemy  is  Hillary ---  what  a  HOOT",
    "likes": 7
  },
  {
    "commentText": "The clinton's are deadly people",
    "likes": 0
  },
  {
    "commentText": "This guy should be careful to stay away from hot tubs, small aviation, etc. It seems most people who come forward with such information end up \"committing suicide\" in interesting ways -- like multiple gunshots to the head, or in one case, five .45 caliber rounds to the chest. All \"suicides\".",
    "likes": 1
  },
  {
    "commentText": "Not volcanic in the sack. How revolting ... the vision.",
    "likes": 0
  },
  {
    "commentText": "Poor guy what a job. Don't worry about Hillary vengeance. She's washed up.",
    "likes": 0
  },
  {
    "commentText": "All three Clintons are criminals and now they are breeding again.   Chelsea is a fugly reincarnation of her mother who actually looks like her father, not Bill!",
    "likes": 12
  },
  {
    "commentText": "Best case scenario would have been Hillary attacking Bill with a knife and SS shooting her.",
    "likes": 0
  },
  {
    "commentText": "She does not like men? You all missed that. Do u believe it was only bill who was having affairs?",
    "likes": 0
  },
  {
    "commentText": "Please watch our show for more TRUTH. www.contitonight.com",
    "likes": 0
  },
  {
    "commentText": "2:15 He wants to leave, and she pulls him back!!!!",
    "likes": 0
  },
  {
    "commentText": "What a HORRID woman!",
    "likes": 0
  },
  {
    "commentText": "How Trump is killing Americans: eliminating counter-terrorist funding to the NYPD.",
    "likes": 0
  },
  {
    "commentText": "Look up the Allies of Humanity Briefings, free online, to comprehensively understand the reality and intentions of the extraterrestrial intervention in the world today. These are perhaps the most important documents in the world today.",
    "likes": 0
  },
  {
    "commentText": "Why does she keep getting away with stuff and how the fuc was she able to run for president despite all of this it's insane",
    "likes": 0
  },
  {
    "commentText": "Hillary is a lying, corrupt POS that should be EXTERMINATED!! In honor of the brave men of BENGHAZI. Barry too!",
    "likes": 0
  },
  {
    "commentText": "Thank god Trump won",
    "likes": 0
  },
  {
    "commentText": "They don't like law enforcement because they are criminals",
    "likes": 0
  },
  {
    "commentText": "A broken blue vase?  Vase gate!  A mark under his eye?  Coffee gate!  Dangerous angry behavior?  Behavior gate!!  She doesn't like men??  Men gate!!",
    "likes": 17
  },
  {
    "commentText": "Every liberal president since JFK has been a disaster. They're not people with extraordinary amounts of integrity. They're terrible!",
    "likes": 0
  },
  {
    "commentText": "wow lol the blonde in the purple dress sure doesn't keep it subtle",
    "likes": 0
  },
  {
    "commentText": "He will not be around long",
    "likes": 0
  },
  {
    "commentText": "What a load of crap ! Anyone with a brain , can easily figure out how currupt and untrustworthy the Clintons are . Fox so called news , with these clowns on the set , who don't have two brain cells to rub together , only legitamise the Clinton family . When you look at who they were advocating , Donald Trump LOL , the Clintons almost look respectful and honest .\n\nBeing \" fair and balanced\" I'm sure Fox is hammering The Donald daily ?",
    "likes": 0
  },
  {
    "commentText": "Why?",
    "likes": 0
  },
  {
    "commentText": "She figured  how to get  it",
    "likes": 0
  },
  {
    "commentText": "What a show",
    "likes": 0
  },
  {
    "commentText": "Ur money,  our money goes for all this",
    "likes": 0
  },
  {
    "commentText": "Stand with who?",
    "likes": 0
  },
  {
    "commentText": "Ur not  elite",
    "likes": 0
  },
  {
    "commentText": "They walk u d0nt, 2 judiciary  system",
    "likes": 0
  },
  {
    "commentText": "She walks you dont",
    "likes": 0
  },
  {
    "commentText": "Found guilty? And?",
    "likes": 0
  },
  {
    "commentText": "Ur  warranties  is what?",
    "likes": 0
  },
  {
    "commentText": "U guys have a job now? But then what?",
    "likes": 0
  },
  {
    "commentText": "Guys  and gals,  when she gets  her gets? And u at Google, and u tupe?",
    "likes": 0
  },
  {
    "commentText": "U deep state , she is about  her,  you know this,  why the dance?",
    "likes": 0
  },
  {
    "commentText": "U support  , and, what  do u get out of this? U protect someone who would  through  u under the bus? And that's  cool?",
    "likes": 0
  },
  {
    "commentText": "When it's gone lol",
    "likes": 0
  },
  {
    "commentText": "You enjoy your freedoms with ,like no protection is there, u pathetic , lol",
    "likes": 0
  },
  {
    "commentText": "it has to be fake because a real ex secret service that ecspose them will die",
    "likes": 0
  },
  {
    "commentText": "Breaking the  media build image of the front person for the NWO is a good thing and the fact that  any power would accept such a toxic person to front them enlightens us of who and what the deep state intention.",
    "likes": 0
  },
  {
    "commentText": "I've heard him speak before so insightful",
    "likes": 0
  },
  {
    "commentText": "And to think this violent psycho, lesbian, pedophile Hilary almost became Pres. ... Scary! I'll bet the Libs will just ignore this impartial data as well.",
    "likes": 0
  },
  {
    "commentText": "If  All Geezra  wasn't so full of shit many ld give them A shot at some lnfo.",
    "likes": 0
  },
  {
    "commentText": "Wow! I never thought that Fox was against the Pedo Foundation.\nMay the almighty bless the brave man and his family from that evil skunk whore Hitlary.",
    "likes": 0
  },
  {
    "commentText": "Hillary apologized to Obama when she lost - I believe she did that because Obama would have run the presidency behind the scene. Another four years of Obama's open borders, MS-13, and terrorists flooding our country.",
    "likes": 0
  },
  {
    "commentText": "U guys are all racists saying that Mexicans are all rapists and criminal and are ignorant because you think global warming is a myth created by China",
    "likes": 0
  },
  {
    "commentText": "Does anybody realize that everybody watching this video are racist ignorant assholes",
    "likes": 0
  },
  {
    "commentText": "I think everyone knows now that Hillary Rodham died in 1996 and was replaced by a series of lesbian clones and transgender duplicates. Through the use of hypnosis, murder, satanic homosexuality and extreme lesbianism the Clinton/Obama machine grabbed power for years. Only Donald J (for Jesus) Trump has saved us. God bless him.",
    "likes": 0
  },
  {
    "commentText": "God bless you",
    "likes": 0
  },
  {
    "commentText": "Cmon he's telling his story and yes God bless him for doing it\nBecause he wants to make money",
    "likes": 0
  },
  {
    "commentText": "Should have put a bullet in her ugly ass head",
    "likes": 0
  },
  {
    "commentText": "Fucking bitch!",
    "likes": 0
  },
  {
    "commentText": "What makes me think is the fact before bill got into office he said \"he was joking an talking to a sheriff saying there's no way this guy can get elected\" then the sheriff said \"believe everything u hear they will get elected an they'll B in there for 8 years\" so my thing is how did he already know that 🤔 if anyone caught onto that",
    "likes": 0
  },
  {
    "commentText": "very dangerous",
    "likes": 0
  },
  {
    "commentText": "Hilary has gained a tremendous amount of weight and its most likely due to her being on a lot of medication. Something is seriously wrong with this women. I just pray if she is ever charged with the crimes she has been committed that she doesn't get off due to mental illness. We have plenty of Mental Institutions that Hilary can spend the rest of her life locked in a padded room.",
    "likes": 0
  },
  {
    "commentText": "Someone has to do an ACCURATE movie on The Clintons. They're just so scandalous and skeevy",
    "likes": 0
  },
  {
    "commentText": "of course she don't  like military and law enforcement...ever heard of thief liking  cops?",
    "likes": 0
  },
  {
    "commentText": "\"Tell us the thong story...\" Ha!",
    "likes": 0
  },
  {
    "commentText": "Keeping all them lies has aged her",
    "likes": 0
  },
  {
    "commentText": "$HilLIARy ASSAULTED the President of the United States! I don't think Milania will be doing that. and since the Trumps are actually Married, I think we'll be spared all the sexual exploits that made the U.S. a Laughing Stock to the rest of the World! I don't think the Trumps will be Stealing $250,000. worth of furniture, knick knacks, cutlery, silverware, antiques and paintings when they leave either. signed, Proud Third Party Voter",
    "likes": 0
  },
  {
    "commentText": "Mr. Byrne is a good man. I loved his book.",
    "likes": 0
  },
  {
    "commentText": "You know what the problem with the right is? While they focus on using facts, they leave the left to coach their own ethics and feelings",
    "likes": 0
  },
  {
    "commentText": "This guy is her dog. If he was for real he would be dead! He was put out there to get people to pay attention to this shit and lies and not what is really happening. None of what he is saying hasn't been said before. The sheeple really are stupid.",
    "likes": 0
  },
  {
    "commentText": "Clinton's have  no character only slim from Hillary and Bill Clinton and Chelsie \ndrain the swamp",
    "likes": 0
  },
  {
    "commentText": "I am so happy she lost. Even when she lost she threw a hissy fit and ran home and started blaming people. No, YOU'RE the reason you didn't win. Lying criminal bitch..",
    "likes": 12
  },
  {
    "commentText": "This dude might end up committing suicide by \"hanging\" with 3 bullets in the back of his head.",
    "likes": 46
  },
  {
    "commentText": "As a former Federal LEO Whistleblower, I give praise for this brave Secret Service Officer. May God Protect him for exposing this enormous menacing threat to America.  Having lived in Communist countries I know about Socialistic Dictatorships. Many including myself could clearly see a Dictatorship by Hillary Clinton coming.  All indications were there; her past actions, and stated intent to destroy Americans sacred personal liberties and freedoms enshrined in the Bill of Rights and to establish a Criminal Neo Communist Dictatorship. This was indeed a very real possibility that would most likely have happened had it not been stopped as it was on election night by an enraged electorate, whom the wicked one, derogatorily referred to as\"Unredeemable Deplorables\", and combined with the unseen hand of Almighty God was soundly defeated. Interestingly there are eerie historic parallels between Hillary; The (Wicked One) and Soviet mass murder Dictator Stalin.  Both were said to lash out violently, and crave destroying freedoms and arbitrarily abusively  exercise ultimate power over other, people and countries as well as commit mass crimes etc. That's why some call her \"Stalinary\"! America was spared; saved from a horrific Terror Criminal Dictatorship under her and her cohorts that is a Political Miracle. Lets not forget that!  Thanks and Praise to Almighty God for saving America from her and for this most wicked, diabolic, corrupt and hate filled woman's defeat, Amen!",
    "likes": 2
  },
  {
    "commentText": "This guy is a proven fraud. \n\nFirst, he wasn't a \"Secret Service Agent\". He was a uniformed officer stationed OUTSIDE the White House living quarters and Oval Office. He wasn't allowed in those sections of the White House and did not work directly with any Clinton in the '90s. Further, all of his claims are denounced by the  Association of Former Agents of the United States Secret Service, comprised of many former ACTUAL Secret Service agents.\n\nFor those who wish to be educated instead of brainwashed by establishment media:\nhttp://www.politico.com/story/2016/06/hillary-bill-clinton-secret-service-224578",
    "likes": 5
  },
  {
    "commentText": "Thank God that cunt lost!",
    "likes": 0
  },
  {
    "commentText": "Secret service agent turned dog for a buck",
    "likes": 0
  },
  {
    "commentText": "Im shocked he hasnt been found dead of an apparent suicide.",
    "likes": 218
  },
  {
    "commentText": "5:26 'And from my personal experience, based on what I saw, SHE DOES NOT LIKE MEN'.\n\nIf you replace 'men' in that sentence with 'black people' or 'homosexuals', or a male candidate not liking 'women', this would be all over the news.\n\nFrom someone who was her personal security detail, we now know that she is a sexist. Only dislike or hatred of Males is permitted in this society.",
    "likes": 8
  },
  {
    "commentText": "she only loves 'Isis' and MONEY!!!",
    "likes": 0
  },
  {
    "commentText": "I hope this man doesn't get found dead by suicide of two taps to the back of the head.",
    "likes": 0
  },
  {
    "commentText": "Is this guy like the other Fox tool claiming to have been a CIA agent without that being true?",
    "likes": 0
  },
  {
    "commentText": "yeah amen to this white Dude!! but of he was black an a agent!! he would br a TRADER!! KILLED!! TALKED ABOUT LIKE A DOG!!",
    "likes": 0
  },
  {
    "commentText": "yeah amen to this white Dude!! but of he was black an a agent!! he would br a TRADER!! KILLED!! TALKED ABOUT LIKE A DOG!!",
    "likes": 0
  },
  {
    "commentText": "Lmao direct quote \"she does not like men\"",
    "likes": 0
  },
  {
    "commentText": "I'm glad there are brave people like this man! I hope more people will listen and see the truth...",
    "likes": 1
  },
  {
    "commentText": "As a USSS agent you take an oath and are sworn to NOT talk like this.  You are not allowed to talk about what you observed witnessed tell stories like this etc... I do not support the Clintons nor do I like them however this guy is breaking his oath his promise and paperwork he signed ..he has no ethics or value sytem he broke his word and he is not an honorable person..",
    "likes": 0
  },
  {
    "commentText": "i hope you die of cancer BITCH",
    "likes": 0
  },
  {
    "commentText": "I'm no fan of the Clintons, but what a load of cheap gossip!! I wouldn't want this idiot protecting my dog, let alone me!! Cheap gossip programme!",
    "likes": 4
  },
  {
    "commentText": "And yet there is not even one photo of this man standing near Hillary?  Strange!!!!",
    "likes": 0
  },
  {
    "commentText": "MAY GOD HELP AND FORGIVE US ALL",
    "likes": 0
  },
  {
    "commentText": "the worst part of the whole media hiding all the evidence against Hillary isn't that it hides her as the evil liar that she is its shows how much they all really hate this country because all this proves how dangerous she would be as president and they don't care , you would think there would be at least half of them that still love this country more then there loyalty to her and Obama because we are in danger as a nation not just as Republicans !!!",
    "likes": 0
  },
  {
    "commentText": "Let us pray for this brave man, he might be having an accident if she is elected.",
    "likes": 0
  },
  {
    "commentText": "Her voters would never see it anyway because they don't watch any real news and if they did they wouldn't understand it it anyway.",
    "likes": 0
  },
  {
    "commentText": "Like Trump said \"Hilary is a devil\"",
    "likes": 0
  },
  {
    "commentText": "Well he gonna be dead soon",
    "likes": 0
  },
  {
    "commentText": "Hillary Clinton is an evil feminist cunt piece of trash and should never be President.",
    "likes": 0
  },
  {
    "commentText": "Trump is just what the doctor ordered for our sick nation.",
    "likes": 0
  },
  {
    "commentText": "Trump 2016...P L E A S E ! ! !",
    "likes": 0
  },
  {
    "commentText": "Well this is acceptable. Hillary did say she has a public and private opinion. Domestic abuse is ok as long as it's in private.",
    "likes": 1
  },
  {
    "commentText": "Killary Robbem Cuntlinton is so unfit to be president she's all soft and happy with the public yet when in government she shouts and get angry and throws shit at her staff what a horrible bitch.",
    "likes": 0
  },
  {
    "commentText": "Clinton deserves prison!!! Why isn't anyone prosecuting her?!?!",
    "likes": 0
  },
  {
    "commentText": "I hope people can begin to understand how one sided things are because of the power of the main stream media. They support one thing and will stop at nothing to obtain it. Freedom of the press is a joke thank goodness we have the internet to speak freely.",
    "likes": 0
  },
  {
    "commentText": "I hope people can begin to understand how one sided things are because of the power of the main stream media. They support one thing and will stop at nothing to obtain it.",
    "likes": 0
  },
  {
    "commentText": "Hillery Clinton is nothing more then a puppet 4 the N.W.O. She has sold out herself, the government, the constitution, the people, and ultimately (if  she can get her way) our once great nation. A vote for her is a vote 4 the N.W.O. and 4 the unseen man behind the curtain pulling the strings.",
    "likes": 0
  },
  {
    "commentText": "This guy may wake up with a horse head in his bed. Why are all the pro-Clinton not seeing what she is. A lying, dishonest, greedy woman. I would love to see a woman President but not Hilary Clinton.",
    "likes": 0
  },
  {
    "commentText": "Shame there is a recording of Hillary mistreating the secrete service.",
    "likes": 0
  },
  {
    "commentText": "Expose her hypocrite ass!",
    "likes": 0
  },
  {
    "commentText": "Why doesn't somebody do something about them, and how the hell did they ever get elected?",
    "likes": 0
  },
  {
    "commentText": "Hillary's great legacy will be of her cackling like an old witch.  I'd like to see somebody throw a bucket of water on her.  You can't tell me that wouldn't be funny.",
    "likes": 0
  },
  {
    "commentText": "best seller? what a waste",
    "likes": 0
  },
  {
    "commentText": "Wow",
    "likes": 0
  },
  {
    "commentText": "ive made comments on other stations about media coverage n how thayve sold out..to Clinton's interest..well ive been watching cnn 4 a yr now finally i see fox gotta say good job thank you...truth",
    "likes": 0
  },
  {
    "commentText": "TELL IT BROTHER,,,,!!!!!!  BOTH PARTIES ARE SO OUT OF IT FOR THE PAST 35 YEARS,,,,WE NEED ONE PARTY>>>>>>>> \"\"\"\" THE AMERICAN PARTY \"\"\"\" <<<<<<<< A NATIONALIST PARTY for A GREAT STRONG NATION,,,,VOTE TRUMP......!!!!   Hillary and Bill STOLE EVERYTHING OUT OF THE WHITE HOUSE WHICH WAS OUR THE TAX PAYERS STUFF<>><<< THEY EVEN TOOK THE LETTER \"\"\"\" B \"\"\"\" OFF EVERY KEYBOARD of EVERY LAPTOP AND COMPUTER IN THE WHITE HOUSE....THE WHOLE FAMILY IS WORSE THAN THE MAFIA.....LOCK THEM UP>>>>ALL OF THEM....SAVE THAT GRAND BABY NOW>>>> SO THAT LITTLE ONE DOES NOT GROW UP LIKE THAT EVIL FAMILY,,,,,!!!  again all VOTE TRUMP,,,,, a OUT SIDER...he is FOR THE PEOPLE BY THE PEOPLE,,,,then we will WIN ,,,FOR ALL RACES ,,,,FOR ALL PEOPLE.....VOTE TRUMP.....!!!!!",
    "likes": 0
  },
  {
    "commentText": "this guy just wanted money for writing back lol not 1 sound bite or video",
    "likes": 0
  },
  {
    "commentText": "thank god he came forward and exposed this qualified woman for what she is",
    "likes": 3
  },
  {
    "commentText": "As Trump said. Hillary could literally shoot someone and the FBI would still let her get away with it, as would her supporters.",
    "likes": 0
  },
  {
    "commentText": "What a fucking douchbag this guy talking about Monica Lewinsky like that. \nBoth parties and every president and congressman/senator are all working for the same criminal bankers. WTF are people arguing about who's better etc... etc... blahhh blahhh blahhh for? There all fucking losers and they all need to go. This POS here is part of the problem.",
    "likes": 0
  },
  {
    "commentText": "Are you people listening to this man?  He is giving you first hand information on the character, or lack of it, in Hillary Clinton.  Clearly he is not a Trump hack, and these confessions are not given up lightly.  Pay attention, and do not suffer \"Buyers Remorse\" because you didn't want to hear the truth.  And please, please, don't be that last guy wearing platform shoes or gal with leg warmers in gym class......don't be the last bitter clinger supporting Hillary when your countrymen and countrywomen have long since seen the light and stopped supporting her.",
    "likes": 0
  },
  {
    "commentText": "Didn't he say uniformed Secret Service? Those dudes are security guards. Tough call if he's BSing or not.",
    "likes": 0
  },
  {
    "commentText": "I'm glad he stuck to his guns and didn't cave in to there whims.",
    "likes": 0
  },
  {
    "commentText": "This gentleman is honest and true. I glad he wrote his account of the Clinton's. They are evil people.",
    "likes": 0
  },
  {
    "commentText": "Stick a fork in her.",
    "likes": 0
  },
  {
    "commentText": "Evil BITCH!",
    "likes": 0
  },
  {
    "commentText": "what is wrong with the people even thinking about Voting for that Bitch",
    "likes": 0
  },
  {
    "commentText": "dumb bitch and asshole husband need to be in jail",
    "likes": 0
  },
  {
    "commentText": "ron paul is the man that could of saved the usa",
    "likes": 0
  },
  {
    "commentText": "I'm surprised he hasn't mysteriously died in some tragic accident since speaking truth.\n#VoteTrump",
    "likes": 0
  },
  {
    "commentText": "LIARS. HE IS AN ACTOR PEOPLE. HE NEVER WROTE SHIT. WHY DO YOU BELIEVE THIS SHIT........ GREENBURG.",
    "likes": 0
  },
  {
    "commentText": "\"Alex , it's not Hillary ! It's \"HILL-LIARY\"",
    "likes": 0
  },
  {
    "commentText": "Wrong this dude",
    "likes": 0
  },
  {
    "commentText": "Hillary  Clinton could be filmed on live tv on every major Network walking into a bank stark naked, pulling a gun out, shooting someone and robing the bank.  Afterwards an investigation would be conducted by Loretta Lynch, the FBI, and the Justice department and there would be no wrong doing found.  CNN & MSNBC would report that Hillary was completely exonerated.   And Hillary would still be elected president by an overwhelming majority.",
    "likes": 0
  },
  {
    "commentText": "Those of you who are listening to this and thinking \"Trump for President\" don't understand just how bad Trump would be for the country. He's heavily bigoted against women, people of other religions, and the disabled. Running for president by making fun of people doesn't set a good precedent for a president. How easily could somebody who thinks he can joke about these things while running for office tell a joke about a foreign leader and cause international dispute or war because of his insulting jokes? He has basically no understanding of the middle or the lower class either, so he will treat them badly and think it's alright because he doesn't have the experience needed for him to be a good leader. If he thinks running the country is like running a business, count on him trying to make laws that cut the amount of money that is actually going to the average person as he wants to make all the profit. And how many businesses has Trump run into the ground again? Neither Trump nor Clinton is suitable as a president, and the people of the United States should get together and tell the government this is not acceptable.",
    "likes": 0
  },
  {
    "commentText": "Thank GOD for people like that that have the balls to stand up.",
    "likes": 0
  },
  {
    "commentText": "Please do not put this woman back in the White House!",
    "likes": 0
  },
  {
    "commentText": "Wow it's funny how people think this guys some kind of hero, let me get a book deal keep people locked up in the matrix of distractions and gossip while a laugh all the way to the bank with my new monopoly money from my New York Times best seller.  Now people think good old Donald Trump is going to save them.....please. They are both puppets of the same creature.  Read (Hosea 4:6) Repent and follow Jesus your only hope.",
    "likes": 0
  },
  {
    "commentText": "If the federal government is HALF as corrupt as everyone believes it to be; hillary will be our next president.... \nIts an out of control MONSTER and they do whatever they want because they know Americans are too distracted and apathetic to actually HOLD PEOPLE ACCOUNTABLE and MAKE the government work FOR US!!!",
    "likes": 0
  },
  {
    "commentText": "Read the book! Lots of personal information! ..",
    "likes": 0
  },
  {
    "commentText": "Excellent segment!!! We need more truth to come out!",
    "likes": 0
  },
  {
    "commentText": "God Bless America: JFK assassination, Vietnam, the Bush & Clinton dynasties, sub prime real estate scandal, Middle east invasions, CIA murders and cover ups. Did I miss anything?",
    "likes": 0
  },
  {
    "commentText": "maybe Trump should bone billary in her corn AAAAHHHH  HA HA HA HA HA HA HA",
    "likes": 1
  },
  {
    "commentText": "Thank you for the truth Gary!",
    "likes": 0
  },
  {
    "commentText": "It's unbelievable than in today's age people could give liars like the Clinton's a free pass.",
    "likes": 0
  },
  {
    "commentText": "Billary for pres!!!",
    "likes": 0
  },
  {
    "commentText": "This took  some real courage , Hillary is mean and a Crook just like Trump describes, her,  this man better watch out something might come back to bite him , may God protect him he has kids and a family,  Vote Trump dump this mean witch like woman,",
    "likes": 0
  },
  {
    "commentText": "I have to say that I find it completely inappropriate that a member of the secret service would come out and discuss personal details about the former President and First Lady. Whether their wrong or not is irrelevant. His job is to protect the President, First Lady and their daughter, not to gossip on news outlets about the drama that went on while he was on duty. I wonder if he would feel the same if someone told the intimate details of his life as well.",
    "likes": 0
  },
  {
    "commentText": "Notice it is fox news,  a known republican leaning news oufit. They are not credible, nor is he.",
    "likes": 0
  },
  {
    "commentText": "Thank you Fox News for letting this man come on there show and tell his story.most news won't put stuff like this on there air waves.",
    "likes": 0
  },
  {
    "commentText": "Fox News .... so much for this being credible.",
    "likes": 0
  },
  {
    "commentText": "There's always a disloyal little turd in there somewhere always trying to get out, but only when the coast is clear, never when their in there being paid by the people they subsequently bag, what's new?",
    "likes": 0
  },
  {
    "commentText": "\"Dangerous angry behavior.\" Former Clinton Secret Service agent. \n\nWhy the hell are people voting for her? Her Damn body guard is warning you she's a dangerous pyscho.",
    "likes": 282
  },
  {
    "commentText": "Jail for the Clintons. Hillary is a disgrace to AMERICA..............",
    "likes": 0
  },
  {
    "commentText": "Hillary is a CROOK",
    "likes": 0
  },
  {
    "commentText": "Why did it take the CIA 25 minutes to cross the street? It took the CIA 25 minutes to cross the street because they were already there. Why did Ambassador Stevens make it to the hospital alive after the CIA left the area? Why are the buildings burnt from the inside? Why would the Libyans set deadly fires of deadly (smoke) diesel fuel then rejoice when they finally pull the Ambassador alive out of the building? Why would the Libyans attack Americans when the American CIA just helped them win the war over Kaddafi’s military by calling in pin point air strikes during countless battles?",
    "likes": 0
  },
  {
    "commentText": "was he murdered?",
    "likes": 2
  },
  {
    "commentText": "I wish that Fox bobble head would stop talking so Byrne can speak.",
    "likes": 0
  },
  {
    "commentText": "america is in quite the pickle now",
    "likes": 0
  },
  {
    "commentText": "This @2:01 is also about what sleepwalking trash so many Americans are now.  it's way past due to stop placing ALL the blame on pieces of shit like The Clintons.  the deranged people who co-sign their toilets are right there with them.",
    "likes": 3
  },
  {
    "commentText": "Hill and Bill - no class white trash  - corrupt to the core.",
    "likes": 0
  },
  {
    "commentText": "She is definitely not a leader.",
    "likes": 0
  },
  {
    "commentText": "Ladies and gentlemen just think in a few more months we might get Hilary Clinton as President. Are you kidding me. Has hell frozen over. I don't see her as a leader at all but a follower.",
    "likes": 0
  },
  {
    "commentText": "I call bullshit if he's a trump supporter",
    "likes": 0
  },
  {
    "commentText": "Has there ever been a person who fills the role of a evil queen as much as this woman? They wrote a story about this woman many years ago. She was the one who gave the poison apple to Snow White.",
    "likes": 1
  },
  {
    "commentText": "oh...I'm sorry This is Fox?\n I thought it was going to be a news story...",
    "likes": 0
  },
  {
    "commentText": "Just go see her movie!!",
    "likes": 0
  },
  {
    "commentText": "What about Trump?  Is he better?  A simple tour of his private life undoubtedly negatively surprise us. He is dirty because he doesn't  respect anyone's privacy, slander, lies, threats like a common criminal, vulgarly speaking. Thought vote Republican to balance, but will not do it because that man is totally disqualified to be president of this great country. He has no ethics or integrity.",
    "likes": 0
  },
  {
    "commentText": "gary byrne is like the worst secret service agent since edward snowden. he should be working in public service. you think anybody will ever hire him in connection to anything confidential?",
    "likes": 0
  },
  {
    "commentText": "And she don't like men..!!",
    "likes": 0
  },
  {
    "commentText": "But Trump lacks the temperament to be president eh? Get real dude!",
    "likes": 0
  },
  {
    "commentText": "how is it he is still alive?",
    "likes": 0
  },
  {
    "commentText": "That blonde needs to fuck off back to the brothel",
    "likes": 0
  },
  {
    "commentText": "All we got to do is stop Obama from reigning the votes I remember Obama died people can't vote I no how that went.",
    "likes": 0
  },
  {
    "commentText": "Hillary is lgbt. Good luck with that.",
    "likes": 3
  },
  {
    "commentText": "What a load of garbage.  This guy didn't publish a book so his kids would understand the intimate details of what went on in the white house.  He did it purely for one reason only - money!  Good luck to him.  I hope he made a fortune.  But don't cloud the truth with nonsense about \"I have to look my kids in the face, etc\".",
    "likes": 0
  },
  {
    "commentText": "what about when clintons left the white house they stole heaps of stuff, furniture ,plates ,antiques and more.",
    "likes": 3
  },
  {
    "commentText": "double42...\nhe is telling the very truth... regardless of what is happening to many... you have to love your country more...not to vote for her ever...",
    "likes": 0
  },
  {
    "commentText": "Perfect example of the type of story that her supporters could care less about. The \"free shit lovers\". She could be sucking Kim Jong-un's cock while stuffing top secrete documents in his back pocket and they would still vote for her. This is the last chance for the power of \"We the People\" to reign and the Clinton constituency DOES NOT CARE!",
    "likes": 0
  },
  {
    "commentText": "This is why I'm voting for Jill Stein",
    "likes": 0
  },
  {
    "commentText": "mark my words ppl will end up dead under Hillary and no not terrorists or enemies of state but our very own soldiers and politicians... the terrorists and enemies will be hired for jobs.... Isis thank Hillary and others off shore PAY HER!!! fuckin disgrace..",
    "likes": 0
  },
  {
    "commentText": "What man would be foolish enough to throw his life away protecting this horrible old witch?  If I were one of the secret service agents escorting her and I spotted a potential assassin coming at us, I would actually  hold the old witch in front of me as a human shield for myself!",
    "likes": 18
  },
  {
    "commentText": "\"They don't like the military and they don't like law enforcement. \"",
    "likes": 0
  },
  {
    "commentText": "Crisis of character written in salacious style by a man who has betrayed the oath & trust of the position he was hired into to make a fast buck.....now that's character",
    "likes": 0
  },
  {
    "commentText": "If you ever work for someone elite,  like this you can witness this man is telling the truth.",
    "likes": 0
  },
  {
    "commentText": "This secrete service guy is disgrace to intelligence and security system. Every single thing he said here is about the Clintons personal life which he swore an oath to protect and conceal. Which is not Americas business or priority. Can somebody show me a perfect couple. In my 38 years and I am yet to see one. How could they have let this butt kissing sissy up to that position without noticing his character. With a gun to this man head, he will give intelligence away like a bitch spreading her thighs apart for anything, on sighting money. WHO GAVE THIS MAN THAT JOB?",
    "likes": 0
  },
  {
    "commentText": "As long as America continues to be a slave to the three Semitic \"faiths\", we will never live up to our true potential.",
    "likes": 0
  },
  {
    "commentText": "I watch Fox to see all the lies",
    "likes": 0
  },
  {
    "commentText": "Hillary Clinton = Angela Merkel",
    "likes": 0
  },
  {
    "commentText": "Cli tons are evil",
    "likes": 2
  },
  {
    "commentText": "Damn, she laid a shiner on Bill? Wow, even I didn't know she'd go THAT far.",
    "likes": 0
  },
  {
    "commentText": "damn blonde babe killed my concentration",
    "likes": 0
  },
  {
    "commentText": "This just makes me love Hillary even more. She is straight above the law!!\nshe must have the good on everyone. she can straight up lie to the Feds and their like \"yep she should be president\"  awesome!",
    "likes": 0
  },
  {
    "commentText": "Many of the Clinton's private security have died young, funny that?",
    "likes": 2
  },
  {
    "commentText": "🚨!!!Watch \"Hillary's America\", In theaters NOW!!! Learn about the lies & Corruption!!! Must watch before you vote!!󾓦󾓦󾓦",
    "likes": 0
  },
  {
    "commentText": "I wonder how long it will be before he has a sudden heart attack or commits suicide?",
    "likes": 0
  },
  {
    "commentText": "What's the matter with you if a wife is betrayed i,d tho a vase to",
    "likes": 0
  },
  {
    "commentText": "Risking death to talk about the bitch.",
    "likes": 0
  },
  {
    "commentText": "They are evil they jus  love the money",
    "likes": 0
  },
  {
    "commentText": "Clintons don't like anyone with a uniform. Wow...so that is our law enforcement and military. SMH...",
    "likes": 0
  },
  {
    "commentText": "Hillary and BIll are both sociopath murderers..........",
    "likes": 4
  },
  {
    "commentText": "For a guy who was fired from the Secret Service, he still as a axe to grind I guess.",
    "likes": 0
  },
  {
    "commentText": "with over 50 mysterious deaths connected to the Clintons I seriously doubt this former Secret Service guy would dare to make stuff up.  I've read may books that say the same as Gary.  Blood Sport, also Dick Morris's new book, as well as Dolly Kyle's book. She was a mistress if Bill's for decades. The Clintons are slime.",
    "likes": 0
  },
  {
    "commentText": "Trump is our BEST BET to a Russian alliance !!!   Trump can and will befriend them and help SAVE the Israelites. Trump is the one who can, and most likely WILL unite OUR WORLD into a one world government !!! To help promote peace FOR ALL !!!!!!",
    "likes": 1
  },
  {
    "commentText": "C'mon people billyboy LOVES to get roughed up, beat down, and VIOLATED with hillybilly's  BIG 10\"er' ISLMFAO !!! REALLY ISLMAO(RN) RIGHT NOW !!!",
    "likes": 1
  },
  {
    "commentText": "I believe this man is100% credible,we should listen to him.",
    "likes": 4
  },
  {
    "commentText": "Who would know the Clintons better than a man around them up close and personal!! Day after month after year!?",
    "likes": 3
  },
  {
    "commentText": "all media blackout on this story everyone needs to research what is below\n\n4 people has just been assassinated 4 investigating Hillary Clinton and the DNC Victor thorn.. The latest victim is Shawn Lucas he was just assassinated 4 days ago because he's served fraud papers to the DNC he has a video on YouTube on it I don't know if it is still there you might want to look for it",
    "likes": 1
  },
  {
    "commentText": "Wow she doesn't like men! And yet we only hear people bitching about Trump disrespecting women so he cannot be our president! All you need is a third person who sees that in any home, the women can very well be the aggressors!",
    "likes": 0
  },
  {
    "commentText": "I bought his book and have read it; the only complaint I have is that he didn't reveal a LOT more about the Hildebeast than he did. I'm sure he must have picked up a lot of other crap that she did, along with Bill, but for some reason he doesn't go into much detail other than what you see in this video.  It's better than nothing, I suppose, but I was hoping for a LOT more dirt on the bitch.",
    "likes": 0
  },
  {
    "commentText": "Its sad Hilary Clinton is a role model for women. She hates men, Hates her husband but stays with him and she is a aggressive idiot.\nI feel sad for her though because she knows shes done if she leaves her husband",
    "likes": 7
  },
  {
    "commentText": "🇺🇸🇺🇸Trump 2016🇺🇸🇺🇸",
    "likes": 0
  },
  {
    "commentText": "You're all an embarrassment to the white race. Your bigotry is fucking disgusting. You weak. Willfully ignorant. Trash. You trumpers, you fucking burn outs. The both stupid fucking logic is an embarrassment to the world. The poor, uneducated, should never get to to decide the fate of this nation.",
    "likes": 0
  },
  {
    "commentText": "good old fox reporting stupid shit.",
    "likes": 0
  },
  {
    "commentText": "So much for an oath of secrecy",
    "likes": 0
  },
  {
    "commentText": "He is gossiping so that he can look his kids into the eyes? How old are they? 12-13? \nI believe it! Sure....\nHe is not saying anything of any importance or consequence, only gossiping. Nothing more, not even worth watching. I shut it off after he mentioned his kids.",
    "likes": 0
  },
  {
    "commentText": "Fox News:  So fair and balanced.  Hahahahaha!!!\nI totally trust Fox to tell it like it is.  Lololololol!!!!!!!",
    "likes": 1
  },
  {
    "commentText": "I can't wait for this election to blow up from the insanity of the main candidates and their supporters....Judgement Day is coming.",
    "likes": 1
  },
  {
    "commentText": "Hillary Clinton is very ill. Do a goggle search for \"Shock Video: Hillary Completely Insane   \", then you will see who is truly unfit for office. Hillary Clinton Seizures. Hillary Clinton Has A Seizure/Stroke.",
    "likes": 2
  },
  {
    "commentText": "Thank you for telling the truth to the American Public.  Hillary Clinton will never come clean with all the dirt that she has on her.",
    "likes": 6
  },
  {
    "commentText": "Is this the guy how is now dead?",
    "likes": 0
  },
  {
    "commentText": "Only a complete retard would want to see Billary back in the White House.",
    "likes": 2
  },
  {
    "commentText": "This dude is an idiot.  He's a security guard who saw a chance to make himself some money by spinning lies about his former employer.  He should look in a mirror to see a true \"crisis of character\".  \n\nOh yeah, nothing is going to stop Hillary Rodham Clinton from being our next president.  If that causes you pain...........     good..",
    "likes": 0
  },
  {
    "commentText": "As long as American keep their eyesand ears open, Trump will win.  The Dems are blind a day deaf to facts about their candidate.  Keep in ,mind how important it is to Vote for Trump.  The future of our country depends on it.",
    "likes": 0
  },
  {
    "commentText": "As long as American keep their eyesand ears open, Trump will win.  The Dems are blind a day deaf to facts about their candidate.  Keep in ,mind how important it is to Vote for Trump.  The future of our country depends on it.",
    "likes": 0
  },
  {
    "commentText": "Hilary Cunton:I'm a woman vote for me,I will bring no change like Trump what so ever but if you don't vote for me you must hate woman. -_-",
    "likes": 0
  },
  {
    "commentText": "Hillary for prison 2016‼️",
    "likes": 5
  },
  {
    "commentText": "This guy needs to go into hiding!!!!",
    "likes": 0
  },
  {
    "commentText": "George stephenoplus is pos",
    "likes": 0
  },
  {
    "commentText": "What's those stains on Hilary's trousers.?",
    "likes": 0
  },
  {
    "commentText": "This dude didn't expose anything. Anyone with the correct amount of brain cells can see that Hillary is a corrupt shithead.",
    "likes": 206
  },
  {
    "commentText": "can you see the reptilian fangs on this secret service guy?",
    "likes": 0
  },
  {
    "commentText": "Exactly.  This woman is cancer. If she gets back in the White House , we are done",
    "likes": 201
  },
  {
    "commentText": "does hillary cliterus get her clothes from merkle cos she looks like a bag of shit tied up",
    "likes": 0
  },
  {
    "commentText": "Hillary Clinton Never Uses Her Pussy As She Is A Lesbian",
    "likes": 0
  },
  {
    "commentText": "fuck american politics are a mickey mouse shit show.",
    "likes": 0
  },
  {
    "commentText": "Get ready for the first female pres. If you still think your vote counts, then you probably still believe in the tooth fairy.",
    "likes": 0
  },
  {
    "commentText": "Hope he's not on her hit list...the Clinton body count has grown",
    "likes": 0
  },
  {
    "commentText": "i don't think most Americans understand how brave this guy is being .... the Clintons have used the FBI, IRS and other government bodies to target people who speak out about them before ... the corruption is so ingrained  .... the media, large IT organzations like twitter  and facebook target people who have an opposing view to the government ... the corruption is systemic and endemic to anyone involved with the Clintons",
    "likes": 0
  },
  {
    "commentText": "This guy will do anything to be famous and the media loves him.",
    "likes": 3
  },
  {
    "commentText": "Trump 2016",
    "likes": 0
  },
  {
    "commentText": "Ah more Fox News crap run and owned by Murdoch . He is a liaring piece of crap . Trump is history and will go down as the most mentally unstable nominee ever . He has lost the plot . Rep. Party is a joke. Trump is just a loose cannon. He is a draft dodger and takes other people's war medals as he is a coward . Not only did he NOT fight for his country but he attacks those that did and died for their country. Trump is a traitor to America and should be hung.",
    "likes": 0
  },
  {
    "commentText": "everyone get ready for WW3 A BATTLE OF WHO HAS THE BIGGER GUNS",
    "likes": 0
  },
  {
    "commentText": "God bless this man!!!",
    "likes": 6
  },
  {
    "commentText": "shes already been \"selected \"",
    "likes": 0
  },
  {
    "commentText": "I didn't hear anything here that proved she is a devil worshiper.  Judging from a lot of the comments some of you are filled with so much hate, you should judge your own character. But we know that will never happen because hypocrites never look within, they only judge others from their narrow point of view.",
    "likes": 0
  },
  {
    "commentText": "I am from the UK, and I would like to say this...How any American Citizen can even begin to think about voting for Hilary Clinton I just don't know, have you all lost your minds and your sense of right and wrong and your ethics and principles! My God what are you thinking of!! Do you you really want a criminal as your president? If she gets to be president then the worlds worst proven liar will have gotten into the White House, how on earth can that happen? How can it happen that she has got where she is, by cheating and taking huge sums of money from corrupt dictators? How has she been allowed to set up the 'Clinton foundation' that enriches only her and Bill Clinton? If you care you will read all her criminal emails that she illegally sent on a disapproved server, which are freely available to read at the Wicki Leaks site. How the USA can elect a criminal to power is shocking to me, is it to you? The USA electorate have decided to accept corruption because they have got used to it, can't you set your sights higher and stop accepting corruption as the norm.",
    "likes": 0
  },
  {
    "commentText": "Faux News is so pathetically desperate.",
    "likes": 0
  },
  {
    "commentText": "Election Alert! if you want limited employment, higher taxes and more terrorists attacks, then vote for Hillary. on the other hand, if you want buku jobs, lower taxes and really do something about terrorism? VOTE FOR THE DONALD! CHRIST BLESS AMERICA!",
    "likes": 0
  },
  {
    "commentText": "Hillary has no business being POTUS...ever!",
    "likes": 0
  },
  {
    "commentText": "He's been sucking Trump's......",
    "likes": 0
  },
  {
    "commentText": "Lol...the only thing us Fox viewers want exposed are those legs !",
    "likes": 0
  },
  {
    "commentText": "Lol.. who's this has been loser ! Trying to get a few bucks like that so called ex cia guy ...hahahaaaa !",
    "likes": 0
  },
  {
    "commentText": "WHAT HILLARY NEEDS IS A POWER-DRIVEN DILDO, NOT BATTERY OPERATED BUT GASOLINE ENGINE POWERED",
    "likes": 0
  },
  {
    "commentText": "Brian Kilmeade has his head up Israel's ass",
    "likes": 0
  },
  {
    "commentText": "Hillary is insane, and trump is a naccacist.",
    "likes": 0
  },
  {
    "commentText": "I recommend all who see this to monitor your local voting locations with cameras...watch for people coming more than once. There are countless reports in recent history of donald duck, mickey mouse and yes -- \"Jive Turkey\" all voting democrat. Look it up. We also know they look in the phone book and vote for people. Remember, they got the voter ID laws struck down for this reason. Anyone can vote for ANYone -- dead people, etc. Maybe even you. So please stay vigilant, because she WILL try to rig this.",
    "likes": 0
  },
  {
    "commentText": "the woman my mom works with, her kids go to the same country club as this man's and are pretty close. I've heard the story, and every single word of it is true. it's such a shame that this will probably never get out to her voters.",
    "likes": 0
  },
  {
    "commentText": "Wondering if he's going to have an 'accident' or 'commit suicide'...",
    "likes": 35
  },
  {
    "commentText": "CNN, ABC NEWS, and all the other liberal media outlets should be airing this guy! Hillary supporters need to WAKE THE HELL UP.",
    "likes": 0
  },
  {
    "commentText": "As we approach the national election in November, we will see an increasing number of people stepping forward like this guy who worked closely with the Clintons and exposing them for who they really are! And it will become painfully clear to all Americans that we cannot have Hillary be the 1st female POTUS!",
    "likes": 0
  },
  {
    "commentText": "Terror alert! Terror alert! Fox are the antithesis of msnbc.",
    "likes": 0
  },
  {
    "commentText": "O'BAMA IS NOT GOING TO LET THIS CLINTON NUT JOB RUN FOR THE PRESIDENCY!\nIT WILL BE CALLED OFF AT THE LAST MOMENT!  THIS HAS ALREADY BEEN PLANNED\nSO O'BAMA IS BOUGHT BACK FOR ANOTHER TERM!  THE LEAST DESIRABLE CANDIDATE CLINTON, IS SUPPORTED THE MOST BY O'BAMA.  ASK YOURSELF WHY?\nI ALSO THINK THERE A LOT OF PEOPLE WHO ARE EXTREMELY SCARED IF TRUMP GETS INTO THE WHITEHOUSE.  I THINK THERE WILL BE HUNDREDS OF EXECUTIONS FOR TREASON WHEN PEOPLE ARE EXPOSED !!!!",
    "likes": 0
  },
  {
    "commentText": "Any woman would be stressed an angry with a playboy husband cheating on her left and right and in public, under her nose, and in full view of everyone. Just because she has a lousy, unfaithful husband, it doesn't make HER the bad wife or a bad leader. You are attacking the wrong person. Slick Willy was the bad spouse in this scenario--not HER.",
    "likes": 0
  },
  {
    "commentText": "Hillary AKA as The Devil!",
    "likes": 0
  },
  {
    "commentText": "Bill Clinton spread Aids  when he was Gov  and had drug flown in  on private planes",
    "likes": 0
  },
  {
    "commentText": "Why does Obama and H. Clinton constantly get away with lying to the American public? Incredible!!!",
    "likes": 0
  },
  {
    "commentText": "Even after you hear this man speaking the truth these idiots are still supporting this idiot clinton!!!",
    "likes": 0
  },
  {
    "commentText": "People will vote for this useless btch! We are doomed.",
    "likes": 2
  },
  {
    "commentText": "+Drug use, aka, cocaine.",
    "likes": 13
  },
  {
    "commentText": "+Drug use, aka, cocaine.",
    "likes": 0
  },
  {
    "commentText": "She is a real liar and phony candidate, but trump should be smarter in his answers.. Because this LIAR  will keep it up thinking it's true. That is what liars do.",
    "likes": 0
  },
  {
    "commentText": "I went to high school with a girl who's father was a Arkansas State Trooper during Clinton. She said her father quit & they moved from Arkansas to get away from the crap that was going on. Out of morals & fear of punishment of not going along with Clintons orders. These people are evil.",
    "likes": 0
  },
  {
    "commentText": "So easy to believe.",
    "likes": 0
  },
  {
    "commentText": "Thank you for the TRUTH,about pshyco hillary, HOW IS IT RUNNING FOR POTUS,    WATS HAPPEND TO AMERICA,IS SHE A BOUGHT WHOREBY HILLARY???????",
    "likes": 0
  },
  {
    "commentText": "Hillary is the most corrupt person ever, if she wins this thing its all over......how do these people get so full of themselves, horrible.....",
    "likes": 0
  },
  {
    "commentText": "i heard they were fuck their cousins type hillbillys",
    "likes": 0
  },
  {
    "commentText": "pretty typical to try to blame the wife etc for husbands issues...",
    "likes": 1
  },
  {
    "commentText": "CLINTON'S ARE SO CORRUPT YOU CAN'T BELIEVE/  VOTE TRUMP",
    "likes": 0
  },
  {
    "commentText": "You People are\nDesperate to\navoid The Truth\nHillary's is our New\nPresident\nNothing Desperate\nPeople Say will Change\nThat poor Trump\nSupporters. !!!!!",
    "likes": 0
  },
  {
    "commentText": "who cares about the Clinton's dirty laundry? This guy will never work in a security position again. Only FOX would stoop to this kind of yellow \"journalism\".",
    "likes": 0
  },
  {
    "commentText": "This is ALL Hillary Clinton's FAULT! 100% Hillary, she caused it, she started it, she laid the ground work for it, along with all the other terror attacks since 9-11. It's all Hillary Clinton fault. She is the liar and can't be trusted. She started ISIS, she started Al Queda, and she's the reason for the Middle Eastern conflicts all these years. All her fault, and hers alone. Nobody else!",
    "likes": 0
  },
  {
    "commentText": "This can easily be proven right or wrong, someone look for images or videos of Bill with a black eye that is being covered up.",
    "likes": 0
  },
  {
    "commentText": "What horse shit. Don't expect anything less from Fox..wtf does this have to do with Hillary? Her husband cheated not her! This is just smear tactics from a right wing media outlet that panders to the base fears of America. Trump had 3 wives, didn't raise his own kids and stole and cheated his way across the US. What a joke he is!",
    "likes": 0
  },
  {
    "commentText": "please stop ending every scandal or incident with \"...gate\". please",
    "likes": 0
  },
  {
    "commentText": "Lock her up",
    "likes": 0
  },
  {
    "commentText": "please with all she had to put up with he is lucky she didn't kill him.",
    "likes": 0
  },
  {
    "commentText": "I hope he has plenty of body guards!!",
    "likes": 0
  },
  {
    "commentText": "all this stuff we've heard already and he corroborated it. What I don't understand is why he had to insert(in another interview) that \"he could see why a person like Vince Foster would commit suicide\" ?  All this : womenizing, fighting, just being a bitch is not going to hurt Killery but a LOT of people still don't believe Vince Foster killed himself. Could the clinton machine have trotted this cat out with his book for the sole purpose of putting a bandaid on the VF case?",
    "likes": 0
  },
  {
    "commentText": "Hier kann man nur sagen: Wer Frieden will darf niemals die Clinton wählen!",
    "likes": 0
  },
  {
    "commentText": "LOCK HER UP.",
    "likes": 2
  },
  {
    "commentText": "Makes me vomit looking at her.",
    "likes": 0
  },
  {
    "commentText": "She Has To Be STOPPED!!",
    "likes": 8
  },
  {
    "commentText": "cocaine snorting addicts...read the book,right",
    "likes": 0
  },
  {
    "commentText": "lol she's a violent abuser",
    "likes": 0
  },
  {
    "commentText": "They're no different than any other human; susceptible to airborne lead",
    "likes": 0
  },
  {
    "commentText": "This.",
    "likes": 0
  },
  {
    "commentText": "did I hear him say that Clinton Hilary that is doesn't like men damn!!!!!!!",
    "likes": 3
  },
  {
    "commentText": "I hhave no use for Hillary. Really. This is pretty sad though. A Secret Service Agent reduced to a gossip girl with a book deal. Seems like none of these bozos take their professionalism  seriously anymore. How many SEALs are out there writing books? He shouldn't be commenting on about what he experienced about the private lives of others while he was acting in a professional service capacity. Dishonorable. He is a bad as the Clintons.",
    "likes": 0
  },
  {
    "commentText": "how many women faught there cheating husband's keep it real",
    "likes": 0
  },
  {
    "commentText": "how does some one get a black eye within minutes of the event? Swollen, sure... but a black eye? That takes more than a few minutes.",
    "likes": 1
  },
  {
    "commentText": "+orinoor funny,funny,funny,i watch to many movies,when u said change 1st letter of his name from b to k 1st thing that came to mind was movie kill bill,no,no no,im not saying kill the man,just what auto came to mind,",
    "likes": 0
  },
  {
    "commentText": "The media are solidly behind Clinton but that's going to be the case. The media are owned by the illuminati and she is their candidate.",
    "likes": 5
  },
  {
    "commentText": "Everything Ben Carson said about Hillary Clinton is true. Look it up on youtube..\nShe is a satanist who supports the NWO agenda. Watch out guys. WWIII will go into overdrive if she is elected.",
    "likes": 0
  },
  {
    "commentText": "My uncle has a friend who was also an agent during the Clinton administration and he's also bashed her for being a POS so I believe it",
    "likes": 57
  },
  {
    "commentText": "to bad cnn won't dare interview him",
    "likes": 0
  },
  {
    "commentText": "I'm sorry but he's whines so much in this book. He claims to be unbiased, but loves papa Bush so much. Often exerts himself into the business of the people he serves.",
    "likes": 0
  },
  {
    "commentText": "their all sick hbillary trump and 100's of other members frequented larry epstines sex slave island rest assured eggmericans will still vote",
    "likes": 0
  },
  {
    "commentText": "with so many people on usa. how come u just have these elected people? isnt anything better than clinton? weird.... because she will continue the same agenda of her family... war, fear, conflict, oil, iraq, daesh bla bla.. i think América is the real threat.... im very concerned.",
    "likes": 1
  },
  {
    "commentText": "It has come to this. I have found some honest news...on Fox. What the fuck is happening in this country?",
    "likes": 0
  },
  {
    "commentText": "I don't even need to read the book, by just looking at Hillary, I can already tell she's a bitch.",
    "likes": 0
  },
  {
    "commentText": "Benghazi! !!!!!!!!!!!!! She is not human.",
    "likes": 0
  },
  {
    "commentText": "Bravo! He Spread the True!",
    "likes": 0
  },
  {
    "commentText": "Was old Mary Todd any different? No she never ran for president, but even she is a step up from Agent Orange.",
    "likes": 0
  },
  {
    "commentText": "What's disgraceful is that someone who was entrusted to protect the first family is using that access to line his pocket.  What's next?  Agents giving out classified information they overheard so they can score a TV interviews and make a few bucks?  That's disgraceful!   Is this one of the agents who would get drunk on road trips and hire hookers?  Hmmmmm I wonder......",
    "likes": 0
  },
  {
    "commentText": "Hillary will be the first Lesbian President in US History, if she wins. Funny how Bill is finding a way to sneak back into the White House after the Monica Lewinski scandal. If Hillary gets it, she will be able to have her own female interns in to service the old cow!\nPlease vote for Trump! You have no idea how bad things will get with Hillary as President!",
    "likes": 0
  },
  {
    "commentText": "Thank you for sharing truth. God Bless You.",
    "likes": 0
  },
  {
    "commentText": "\"Shriveling Willy\" is looking BAD !!!  All this Hillary shit is gonna kill him.   She couldn't care less,",
    "likes": 0
  },
  {
    "commentText": "The Clintons' are so fake.  makes me sick",
    "likes": 0
  },
  {
    "commentText": "The modern day Bonnie and Clyde of the globalist.",
    "likes": 0
  },
  {
    "commentText": "How much did Trump pay this guy?",
    "likes": 0
  },
  {
    "commentText": "This is a load of shit.",
    "likes": 0
  },
  {
    "commentText": "I think an \"Airline Accident\" is in his future...........",
    "likes": 0
  },
  {
    "commentText": "Hilary is a bolshevik cunt.",
    "likes": 0
  },
  {
    "commentText": "Please Vote against Hillary! Our country is doomed with her as president BENGHAZI!!! She will not keep us safe!",
    "likes": 0
  },
  {
    "commentText": "THIS GREAT NATION NEEDS PEOPLE WHO WORRY SERIOUSLY  OF IT'S WELL BEEN. , CAN  YOU IMAGINE HIRING THIS MAN, TO TAKE  CARE OF YOUR HOUSE.   ONLY THE ALLMIGHTY GOD, CAN KEEP THE USA BEEN GREAT,  AND FOR THIS, WE NEED TOO BE ON THE  SIDE OF RIGHTEOUSNESS,  AND JUSTICE. , THIS IS NOT EASY, AND NOT IMPOSSIBLE. I HOPE THE  BEST FOR YOUR NATION.  EVEN IF IT WINS DONAL., I'M A MEXICAN JEWISH, ILLEGAL ALIEN,  WHO IS GRATEFUL TO GOD, BECAUSE OF THIS GREAT LAND OF THE USA.",
    "likes": 0
  },
  {
    "commentText": "My fear is that the Clintons - both of them - are psychopaths.",
    "likes": 37
  },
  {
    "commentText": "This is why we cant make retards presidents",
    "likes": 0
  },
  {
    "commentText": "She is WRONG.... Everything about her is WRONG!",
    "likes": 0
  },
  {
    "commentText": "fox PUPPETS",
    "likes": 0
  },
  {
    "commentText": "so the the next american president is either going to be a whore cunt or a corporate ceo, i hope god can save you because anything short of that will leave you all fucked, oh wait a second your already fucked good night folks",
    "likes": 1
  },
  {
    "commentText": "Holy shit ! How is this guy still alive ? I would have expected them to take out him and his whole family by now in some \" mysterious \" accident ...",
    "likes": 4
  },
  {
    "commentText": "HEY NFL, where is your outrage on domestic violence when gender roles are reversed?",
    "likes": 0
  },
  {
    "commentText": "Big Fat Lies by Walteria Music on You Tube",
    "likes": 0
  },
  {
    "commentText": "So Fox and this guy are demonizing Hillary for being angry that the secret service were helping her husband to have affairs with other women- an intern no less...correct me if I'm wrong. And also for fighting with her husband about it. Help me to see how this reflects bad leadership skills. Would being meek and letting this happen without showing her displeasure have looked better on her resume? She forgave him, stayed with him, but she she let him have it in private obviously. How is that bad?",
    "likes": 0
  },
  {
    "commentText": "5:29-30, \"She does not like men\".  The dickens you say.",
    "likes": 0
  },
  {
    "commentText": "I think it's funny how people assume that if you insult either Trump or Hillary that you support the other, when i reality we're screwed either way",
    "likes": 7
  },
  {
    "commentText": "This is when the liberal blinders go up. The stupid fucks that support that cunt will hear none of this, will believe none of this. But hey, that's the way they work. If it suits their personal agenda, it must be true. If it doesn't, FOXNews LIES!",
    "likes": 13
  },
  {
    "commentText": "No one is tougher that the Palestinians. Check out the recent reports from the World Bank, the EU and the UN. Home demolitions military law for them no laws for settlers and more plans to take even more of the West Bank via railways and extended settlements. Read what senior cabinet ministers from Jewish Home are saying, read what some of the senior state rabbis are saying. It's disgusting. It's terrifying. Hilary makes another massacre in Gaza inevitable. Does anybody really think that reducing Gaza to edge of poverty. Calorie counting to keep it on point of collapse and the world bank report is devastating. It shows Israel deliberately reducing Gaza to poverty stricken relying on aid with no real GDP (aid was 18% in 2000 it's 58% in 2011- appalling).",
    "likes": 0
  },
  {
    "commentText": "could there be more corruption?  Bravo for this guy, and by the way.....he is not going to commit suicide.... lol",
    "likes": 0
  },
  {
    "commentText": "Every election year one can see just how ridiculous and volatile the world is getting. The two bobble heads we have to choose from is a reflection of this. Is it our honest opinion that either one of these power hungry individuals want the presidency to do US good? Do you really think Hillary or Donald wants to serve us? Both are custom to being served. As long as influence is controlled by the wealthy the average citizen will never be anything more than a wage slave pawn to be lead to one side or the other. Two sides of the same coin. Spitting hatred towards the other when both are in the same boat. We've seen how statesmen who have contended the two party system have been treated in the past. As well as their supporters. Which should make clear to anyone with any reasoning capability that the act of voting is a toy given to us to make us feel in control. To validate the lie that has been taught to us from grade school. That the system is honest. That your vote counts and the system works. Well look around..What do you think?\nI wish you a good work day tomorrow.",
    "likes": 0
  },
  {
    "commentText": "he has death wish",
    "likes": 0
  },
  {
    "commentText": "Hillary for Prison 2016.",
    "likes": 4
  },
  {
    "commentText": "I think the Clinton name has S.O.I.L.E.D. The White House long enough. I wouldn't even sit on a chair in there until the ENTIRE place from top to bottom was Disinfected❗️Twice ‼️",
    "likes": 0
  },
  {
    "commentText": "I'm surprised 666 media uploaded this.",
    "likes": 0
  },
  {
    "commentText": "How much do these so called 'supporters' get paid to cheer and sell out their country? I mean they can't really be that stupid can they?",
    "likes": 0
  },
  {
    "commentText": "Don't listen to this guy he's getting paid to talk shit about Hillary. He's making money off the Clintons ...For a peaceful world vote for Hillary Clinton 16!!!!",
    "likes": 0
  },
  {
    "commentText": "hillbilly hillary clampett. Do you really want to wake up to that in the morning, America ?",
    "likes": 0
  },
  {
    "commentText": "that bitch deserves everything she gets",
    "likes": 0
  },
  {
    "commentText": "The unfortunate part is that 99% of America would vote for anyone other than Hillary and she would still win the Presidency, All of the elitist cronies at the top are rubbing each others backs and fingering each others butt holes keeping their pockets lined with millions from foreign governments supplied by the Clinton Foundation. They will assure that she is put in power to keep their gravy boats a float. \nNo one is going to question the Clintons when they are all bought and paid for, jeopardizing their vary lively hoods and like so many others that attempted to speak out against the Clnton's corruption that have fallen under mysterious circumstances, their lives. \nThis guy is very brave for coming forward but it wouldn't surprise me if the Clinton Crime Family and friends haven't already put a hit on him.",
    "likes": 6
  },
  {
    "commentText": "America is a dead liberalshithole now.",
    "likes": 0
  },
  {
    "commentText": "The most corrupt government in the history of America does nothing to this liberal criminal and 51% of the voters hate America and are criminals and takers just like her.",
    "likes": 0
  },
  {
    "commentText": "He is lying.don't be sheep.\nI don't like her but i couldn't belive that guy",
    "likes": 0
  },
  {
    "commentText": "wikileads is going to destroy her!",
    "likes": 0
  },
  {
    "commentText": "Hillary was fine when she was younger, damn",
    "likes": 0
  },
  {
    "commentText": "HILARY 2016",
    "likes": 0
  },
  {
    "commentText": "like being gang raped women? vote Hilary   Gay and like to fly off buildings to your death vote Hilary ..won't work but want what workers earned vote Hilary",
    "likes": 0
  },
  {
    "commentText": "this is exactly what I said about her without ever seeing this video you can just see in her eyes she does not like man she is a lesbian and she is the driving force behind the Clinton's if you vote for that treasonous woman who is filled with anger you will see the end of America as you know it if that is what you want you go right ahead but she has made felony mistakes of the highest degree including murder she is a complete liar and has been caught lying numerous times blatantly",
    "likes": 0
  },
  {
    "commentText": "Couldnt this guy get in big shit for this? like he must have signed some kind of confidentiality agreement.",
    "likes": 0
  },
  {
    "commentText": "I dont care if Trump or Johnson wins, anybody but Crooked Hillary",
    "likes": 226
  },
  {
    "commentText": "Great guy, but ofcourse the left has attacked him all over the place...SMH!!!!",
    "likes": 1
  },
  {
    "commentText": "Here is the real dirt on Hillary Clinton!!!\n\nAs President, Hillary will do what she has done all of her life: work her butt off to deal with problems which confront America and the World. She will work together with advisors, congress, professionals, international allies et al to find better ways to address: Domestic Security, Defense, Health Care, Women's Rights, Jobs, Education, Economic Prosperity, Environmental Quality, Foreign Relations, Immigration Issues, Gun Sanity, Civil Rights, Family Stability, Trade - All of the overwhelming, complex issues which she has the keen intellect, education, experience, drive, work ethic, ethical values and vision to deal with very effectively.\n\nThe interesting thing is that there is not one thing positive about Trump and his legacy of public service. That is because it is a legacy of self interest. He brings nothing to indicate that he has any capability whatsoever to be an effective leader who can deal with the world's problems.\n\n I can understand Trump's appeal to right-wing conservatives who love his tough talk, demagoguery and  scapegoating. This technique has worked in many countries, but always ends up having a disastrous outcome for the freedoms, peace and security of the people, even those who voted for the tyrant.\n\nRead Ms Clinton's biography -the real one, not just the Republican propaganda. She is a truly remarkable, outstanding American who is one of the most qualified individuals to ever run for the office of President!",
    "likes": 0
  },
  {
    "commentText": "When are idiotic American voters going to get their heads out of their ashes, and vote for Trump who is honest, has the greatest children who prove he is a GREAT man, and stay away from Hillary Clinton who is a CORRUPT BEAST & so pathetically SCANDAL-RIDDEN like no other life long politician who is old & sick as \"AQUA LUNG\" with that \"F\" BOMB cursing mouth like the RICH BIT*H Jezebel she is. I purely hate you Hillary voters, because you all must know she is a lying TRAITOR. You only vote for her because you want a NANNY STATE to pay your friggin way through life you retarded losers who all dropped out of school. You are all druggies, drinkers, and never had a job in your lives. I hope you all get a disease that will kill you all off. You are ruining the USA. Most of you are stinking minorities. I cannot live in a country where the voters are as CORRUPT as HITLERY.",
    "likes": 15
  },
  {
    "commentText": "America loves the Clintons and the Obama's they took care of America the Beautiful already they have nothing to prove they already did it?",
    "likes": 0
  },
  {
    "commentText": "I fear for Gary Byrne's life....... I just hope they dont get him too... very brave to say what you have.... you have more Guts than most... Hate the Bitch.....",
    "likes": 0
  },
  {
    "commentText": "turks are strong people? best joke ever",
    "likes": 1
  },
  {
    "commentText": "Good sir Gary Byrne! I wish u a long and prosperous life. But if one day he disappears all of a sudden, we would know what happenned......",
    "likes": 0
  },
  {
    "commentText": "Too bad Fox News will not interview Trump's ghost writer for his famous book, Art of the Deal.  At least he sounds like he isn't just a bad actor telling lies.",
    "likes": 0
  },
  {
    "commentText": "Fox News...they are rapists and raped, they take drugs, they are criminals, they never did any real journalism in war zone ( except Our great hero Bill O'Really !....but some are nice people , like the Roger !",
    "likes": 0
  },
  {
    "commentText": "cops, military, homosexuals, and blacks are on her do not let them close to me, except for photo ops, and special events....however she has had homosexual affairs during the 1990's",
    "likes": 0
  },
  {
    "commentText": "Sounds correct from all Ive ever heard as a cop from all the secret service agents i talked to that was Clinton agents, during the Clinton years and afterwards as well....also I heard a lot of stories from Arkansas State Troopers direct that say the same thing...they think they are elite, special, that laws to not apply to them.....greedy, power hungry....they hate homosexuals, and blacks.....they pretend to like them but behind closed doors they tell staff to keep black and homosexuals away from them at all times except for photo ops ....",
    "likes": 0
  },
  {
    "commentText": "It's simple, Hillary Clinton is a lying, criminal psychopath, same a good old Billy Bob",
    "likes": 0
  },
  {
    "commentText": "\"She does not like men\"\nAhahahahahaha \nI've never heard anyone say that until now I've been thinking it the entire time!\nI knew there was beef between the Clintons.",
    "likes": 9
  },
  {
    "commentText": "hillary lifting up her dress, I think i am going to puke. I bet people can smell that disgusting twat of hers from Mars. Who knows what is living in that disgusting twat of hillary. Maggots maybe. Parasitic organisms. Maybe worms. I also wonder this same thing when it comes to her GROTESQUELY and HORRIDLY UGLY daughter of hers.",
    "likes": 1
  },
  {
    "commentText": "hillary clinton PURE RAW SEWAGE!!!!!!!!!!!!!! Also what the fuck is that scary looking thing she gave birth to. chelsea clinton is HORRIDLY and GROTESQUELY UGLY.",
    "likes": 0
  },
  {
    "commentText": "why does this have to be shown on fox and fuckheads? they discredit everything they talk about",
    "likes": 0
  },
  {
    "commentText": "If Donald Trump wins: America is safe hillary Cancerton wins: America is screwed and I'm moving to england",
    "likes": 0
  },
  {
    "commentText": "why is this bitch able to run for president",
    "likes": 0
  },
  {
    "commentText": "I personally know of another gentleman that quit working for the Clintons with the same and worse experiences. So I believe what is in this book to be true!!! According to my friend, Hillary had fights with secret servicemen on daily basis. In fact, it didn't make a difference where and whom was present.",
    "likes": 0
  },
  {
    "commentText": "HILLARY BEATS BILL....NO WONDER HE NEEDED MONICA... POOR BILL !!!!",
    "likes": 1
  },
  {
    "commentText": "\"I wanted to tell my kids 'cause they were going to study this in school?\"  About a THONG??!!  What the hell are they teaching them in school??  I know you are out to make $$ on your book, but Killary would still get votes from her cult even if she drop-kicked a bi-racial baby from a transgender couple while texting Putin nuclear missile codes from her cell phone...  We have all seen how she is above the law.",
    "likes": 0
  },
  {
    "commentText": "at least nixon was honorable enough to step down for a hell of a lot less..that should tell you everything you need to know about her power hungry self serving character",
    "likes": 0
  },
  {
    "commentText": "thought it was interesting until i saw it was on fox news. BYE",
    "likes": 0
  },
  {
    "commentText": "HILLARY! A TALKING CAL AS TO ME BAG!",
    "likes": 0
  },
  {
    "commentText": "It is so darn scarey if she has her finger on the button. She ALREADY Screwed up as Secretary of State,,,,she wasn't there to answer the call! Please consider this before you vote for her. It would be nice to have a woman president,,,,,just not this one.",
    "likes": 0
  },
  {
    "commentText": "There are 3 kinds of liars. Liars, damn liars, and politicians. The last category is why I voting for Mr. Trump. I don't know why so many people rant about Hillary. She doesn't care about what anyone thinks, the only thing u can do that will upset her apple cart is to vote against her.",
    "likes": 0
  },
  {
    "commentText": "\"She doesn't like military or law enforcement!\" Yeah we need someone like that in the White House. We need someone with such volatile behavior. What is it that people who are choosing to vote for Hitlery don't see? Please WAKE UP before November... PLEASE. I'm imploring you..... Don't be blind to what is happening. Open your minds and seek TRUTH before its to late.",
    "likes": 2
  },
  {
    "commentText": "I have great respect for the Turks. Many years ago in Germany I went into a bar that happened to be a Turkish hangout. The biggest meanest Turk picked a fight with me. I fought back. He kicked my ass. After he kicked my ass he helped me up and bought my drinks. I rarely had to buy my own beer there ever again. Shots of Ouzo would appear in front of me.",
    "likes": 0
  },
  {
    "commentText": "What delinquents those Clintons are. And we want to promote them back into the White House. Nuts!!!",
    "likes": 4
  },
  {
    "commentText": "hard to protect  garbage  hope the Clinton's  don't kill this guy  brave brother",
    "likes": 0
  },
  {
    "commentText": "I already know!!!! She is a ass hole......When I shook her hand in Vegas running against Obama eight years ago it was if wtf.",
    "likes": 0
  },
  {
    "commentText": "the us in Hillarys' fighting for us is her secret, corrupt, stupid self and her post of gold!",
    "likes": 0
  },
  {
    "commentText": "how is she still getting people to vote for her is what I cannot believe!",
    "likes": 0
  },
  {
    "commentText": "I am the most anti-Hillary person alive but it's not his place to divulge their private lives. He was hired to protect. Embarrassing for the US Secret Service.",
    "likes": 0
  },
  {
    "commentText": "I definitely have no love loss for the Clinton's but the statement at 1:06 that Bush 41 was \"solid class\" ? There's no mistaking that this is a FOX news story. Sensationalizing anything Bush. What a crock of crap!",
    "likes": 0
  },
  {
    "commentText": "He has no reason to lie we all know what Hillary is and it's not pretty. Liar,crook",
    "likes": 0
  },
  {
    "commentText": "This guy better be careful, I wouldn't want to be on the wrong side of the Clintons, could be career ending among other things......",
    "likes": 0
  },
  {
    "commentText": "Fighting among themselves is their business, I wanna hear something to do with actual corruption/crime and proof, \"someone told me\"  is just hearsay and doesn't mean anything.",
    "likes": 0
  },
  {
    "commentText": "..The most terrifying words in the English language are: I'm from the government and I'm here to help.",
    "likes": 7
  },
  {
    "commentText": "Of course she doesn't like men!!!!! That's why Bill had to have affairs because his gay wife couldn't keep him satisfied.",
    "likes": 0
  },
  {
    "commentText": "Hillary IS a manic.",
    "likes": 0
  },
  {
    "commentText": "Fiction writer.",
    "likes": 0
  },
  {
    "commentText": "This guy is a liar. Nothing he says is confirmed by anyone else.",
    "likes": 0
  },
  {
    "commentText": "Unconfirmed unsubstantiated claims.  There should be other witnesses if his outrageous claims are true. These are just tall tales with no confirmation. Baloney.",
    "likes": 0
  },
  {
    "commentText": "Good on you Gary, you are a  man of integrity.",
    "likes": 0
  },
  {
    "commentText": "The Clintons are like Twinkies, young people get addicted to them, and years down the line you find out exactly how bad they are for you.",
    "likes": 0
  },
  {
    "commentText": "hillary has bad teeth.",
    "likes": 0
  },
  {
    "commentText": "what  .wow",
    "likes": 0
  },
  {
    "commentText": "ugh man I can't believe this twat is the front runner for president. i mean what a fucking joke. you mean to tell me there isn't anyone else in this entire fucking country who we could choose instead man. why the fuckkkkkkkk does it have to be her",
    "likes": 0
  },
  {
    "commentText": "Hillary lies for living.",
    "likes": 0
  },
  {
    "commentText": "What a piece of CRAP! This is a man trying to make  $Big Bucks$ on Trump supporters who'll she'll out the money (some even from their grocery money) to line his pockets! Who you vote for is irrelevant to this guy. 💩",
    "likes": 0
  },
  {
    "commentText": "I hate Hillary as much as the next guy, and I think she's a deceitful liar. But this guy is totally out of place; if you're in the Secret Service you ought to keep your mouth shut about your opinions on the people you protect. It's a privacy thing.",
    "likes": 0
  },
  {
    "commentText": "Hillary has more balls then all those man who live to destroy her . She will be the first woman president , may god blesses her",
    "likes": 0
  },
  {
    "commentText": "Great Book, trank  you for all the info Gary",
    "likes": 0
  },
  {
    "commentText": "This woman should not be in this race! She is unacceptable as someone who can become our Commander in Chief. America deserves better!",
    "likes": 0
  },
  {
    "commentText": "Go ahead and elect Hillary and see what happens ! You will see food shortages and riots for food . Gasoline shortages , medicine shortages , electric power shortages , etc. Don't believe me ? Just go on You Tube and watch videos of Venezuela and see what is going to happen in The United States if Hillary is elected . And yes Hillary is a Communist !",
    "likes": 0
  },
  {
    "commentText": "As much as I hate the Clintons this \"Secret Service\" guy has lost all credibility with his fellow officers. Secret Service does not kiss and tell. If they (The Clintons) committed a flagrant felony in their presence then I could see testifying against them. But this is nothing more than rumor mongering for profit and is beneath the office that he held. God help him. God help us all.",
    "likes": 0
  },
  {
    "commentText": "Hello everyone summon me if you can!",
    "likes": 0
  },
  {
    "commentText": "other secret service agents have written similar stories about her as well, regarding her temper. These guys are willing to take a bullet for this bitch, and she treats them and staffers like dogs.",
    "likes": 13
  },
  {
    "commentText": "A dark day, Hillary Liar and Wall Street expert, elected President and back in comes Bill and the ladies,",
    "likes": 0
  },
  {
    "commentText": "We are required to wake up ourselves from Hillarys & Obamas. These are the crooked people who have compromised American's security for the sake of their love for Muslim terrorists. We need to support Trump, because he is the real trump card of our beloved nation America",
    "likes": 0
  },
  {
    "commentText": "Both the Clintons are underhanded, lying thieves!!!!!! Donald Trump for POTUS!!!!!!!!!!!!!!!!",
    "likes": 105
  },
  {
    "commentText": "\"DON-THE-CON\"  IS AN UGLY HUMAN BEING BOTH INSIDE AND OUT  !!!",
    "likes": 0
  },
  {
    "commentText": "It's a government sever on a government network, and I bet if you could send threats to the president, then burn you're computer, they can still track the IP address and you still get arrested, so?? What's in their net that's so fucking important!!",
    "likes": 0
  },
  {
    "commentText": "As a Chinese, I am so envious of this freedom of speech of the United States!",
    "likes": 0
  },
  {
    "commentText": "The problem with Hillary followers is you cannot educate an idiot.  It is time for men and women to start acting like men and women and not an ass kissing shit sandwich eating follower of a murdering bitch.",
    "likes": 0
  },
  {
    "commentText": "The problem with Hillary followers is you cannot educate an idiot.  It is time for men and women to start acting like men and women and not an ass kissing shit sandwich eating follower of a murdering bitch.",
    "likes": 0
  },
  {
    "commentText": "Gary Bryne's book is INCREDIBLE!  I couldn't put it down!  It's not all Clinton gossip but about what these guys go through to keep us and our government officials safe.  I have so much MORE respect for them...",
    "likes": 4
  },
  {
    "commentText": "He lying that's why he not Secret nore he Serving us no more",
    "likes": 0
  },
  {
    "commentText": "Congratulations to our next president Hillary Clinton! 🗽",
    "likes": 0
  },
  {
    "commentText": "The Clinton's are the longest term trash in this country's history, and STILL trying to usurp the power once again before the both croak from old age!! Much more damage to the country and lives lost guaranteed!! That's all they know!!",
    "likes": 0
  },
  {
    "commentText": "I don't buy these stories he's doing it for money and fame.",
    "likes": 2
  },
  {
    "commentText": "Body language tells me this guy is full of shit.  Head tilted to the right and looking down.  You lot are just sheepole!  Wake up.",
    "likes": 0
  },
  {
    "commentText": "Clinton motto is testify and die.",
    "likes": 0
  },
  {
    "commentText": "\"THE CLINTON LIBRARY'\" IS AKIN TO AN INTERNATIONAL MONEY LAUNDERING ENTERPRISE \"HIDDEN IN PLAIN SIGHT\" AND OBVIOUSLY OFF LIMITS FROM MEDIA ATTENTION, CRITICISM AND SCRUTINY.  THE ONCE NOBLE IDEALS/IDEOLOGIES OF AMERICA HAVE BECOME SO CORRUPTED AND PERVERTED THAT AS A \"HOUSE OF CARDS\"; WASHINGTON  IS LIE ON TOP OF LIE WITH THE FULL SCOPE OF THE MASSIVE FRAUD INCOMPREHENSIBLE TO THE AMERICAN PUBLIC. AS FEATHER NESTING AS ANY SOUTH AMERICAN DICTATOR EVER  AND FINANCIALLY  SUPPORTING THE WORLD INCLUDING OUR AVOWED ENEMIES RELIGIOUSLY PLEDGED TO OUR DESTRUCTION.  AS FUNDAMENTALLY  INHERENTLY STRONG AS AMERICA IS AS A NATION, I DO NOT BELIEVE THAT AMERICA COULD SURVIVE ANOTHER CLINTON PRESIDENCY WITH A CANDIDATE  WHO IS AWNSERING CORRUPTION CHARGES/QUESTIONS AS SHE CAMPAIGNS FOR PRESIDENT!!!!!!!!!!!!!!  ONCE THE LEADER OF THE FREE WORLD, WE HAVE BECOME IT'S LAUGHING STOCK WHO DOLES OUT FOREIGN AID.",
    "likes": 1
  },
  {
    "commentText": "Maybe this former secret service member is like Fox News' Former CUA agent Wayme Simmons who never served a day in Intel he was just some dude off the street with 7 DUIS. Sentencing him this month. Fox is 100% trying to start world war. A brave militia of freedom -loving Americans should visit fox.",
    "likes": 0
  },
  {
    "commentText": "If I was someone in the Secret Service & had to protect Bill or Hillary Clinton, I would resign immediately. Fuck 'em. Let them protect themselves. \"He's allergic to coffee.\" Well, I'm allergic to bullshit.",
    "likes": 0
  },
  {
    "commentText": "Hillary is one of the biggest turds in the political toilet bowl...time to vote these self serving assholes OUT!",
    "likes": 8
  },
  {
    "commentText": "They will not stop trying to take Hillary down. It's what they live for.",
    "likes": 1
  },
  {
    "commentText": "this man might die by the clinton crime family black hand",
    "likes": 0
  },
  {
    "commentText": "She may be a skank, but she's OUR skank.",
    "likes": 0
  },
  {
    "commentText": "The truth?  The truth is the guy is a serial cheater...  Yep, sure is....  Truth our country has never done better economicly then with his leadership....  Truth he left with the country being \"in the Black\" no other president has ever done that.....  Would I want him for a husband?  NOPE!  for a president?  In a second, you bet!    What is wrong with you people....  he is a cheat but a good president, and she will be to......",
    "likes": 0
  },
  {
    "commentText": "Its sad to read these comments and realize that many Americans have no idea what is going on. Some of you do in fact know the media is controlled by the elite which is good. You're more aware than some. However, I still see people taking sides..... republican this, Democrat that. Are u guys not aware that since JFK, our votes haven't mattered?? The super rich elite who run our country (assuming you know this already and haven't been on mars for the last few years) will never allow into office anyone that goes against what they stand for. What the elite stand for is making sure regular folk like you and I are enslaved and have no Rights or freedoms to do as we choose. Their plan is and has been for decades now, is to extrapolate money from the masses until the masses are in poverty. Trump nor Hillary will do anything different to prevent our nation from defaulting on our debt. They are all puppets and until u open your third eye, you will remain blind to the world around u. Tuck Frump and Huck Filary.....they will both end America as we know it. Hell if Bernie were a factor I'd say the same for him.",
    "likes": 0
  },
  {
    "commentText": "Of the two Evils, perhaps one should vote for the one that Didn't have an FBI investigation after them and futhermore didn't pay off the AG and FBI to let them get away with their crimes!",
    "likes": 0
  },
  {
    "commentText": "this guy just wants people to buy his book 😒😒",
    "likes": 2
  },
  {
    "commentText": "So she has a temper....wow Who doesn't? We all know Monica sucked on Bill's fat cock...wow. This is only shocking to you because you haven't heard other stories about other presidents/their wives. I'm not supporting her, but good luck w/Trump and his pipe dreams of bring jobs back etc etc",
    "likes": 0
  },
  {
    "commentText": "I saw this useless program on fox, well, i tuned in once again like i often do to see what new names foxnew news will call Hillary. I think it's a sad day in America when people will do all things just to (a) get publicity and (b) further their agenda. Foxnews and its guest has managed to accomplish that successfully. When was the last time you heard a \"secret\" service person write a tell-all book? Think about it, \"SECRET\" service member I think it's shameful. I don't care if you don't like the Bush's, Clintons or any president. \n\nHe is not a brave man, give me a break. Do you know about people who are secret service? Well, the fact that you don't know them mean that they are truly brave. Being brave isn't ousting confidential informations in a \"failed\" attempt to demonized a woman whose husband has a history of infidelity. What do you do when some of you spineless men cheat of yours wives? Well, blame it on the wife. While this trash may appeal to senseless foxnews view, it will NOT appeal to any sensible, forward thinking being. I wish Trump will jump on it as he is known to do. The same crap happened when one man came to foxnews to take credit of being the man who pulled the trigger and killed Osama, WHAT? I thought the military function as a team. Then where does these solo one-men army come from?",
    "likes": 0
  },
  {
    "commentText": "So bill and Hilary are both compulsive liars",
    "likes": 0
  },
  {
    "commentText": "Why not say \" I wrote this book for money \". Nothing wrong with that. Don't tell me that wasn't the main reason.",
    "likes": 0
  },
  {
    "commentText": "Hillary IS A Fooking DOUCHE BAG",
    "likes": 4
  },
  {
    "commentText": "My utmost respect for this great man.",
    "likes": 7
  },
  {
    "commentText": "God protect this agent from the murderers criminal Clintons for telling the truth!!!",
    "likes": 47
  },
  {
    "commentText": "hillery cant  be elected  they should disqulifie her ass",
    "likes": 1
  },
  {
    "commentText": "its time to put an end to all of the clitons bs",
    "likes": 11
  },
  {
    "commentText": "dishing the dirt, oh it's so thrilling! I'm just eating it up with a spoon. \nTalk about integrity, as a secret service agent you're not supposed to be a big blabber mouth gossip. \nHe didn't care when she ran for the NY senate,  or when she became us secretary of state. or even when she ran for the Presidency for the 1st time. But, now suddenly he's a man of conscience. I get it; cha ching.",
    "likes": 0
  },
  {
    "commentText": "Hillery dines on the testicles of minoritys",
    "likes": 0
  },
  {
    "commentText": "This is just wrong. Sure he has every right to author a book, but to attack Hillary's character is just wrong. She probably pissed him off a few times back in those days.",
    "likes": 0
  },
  {
    "commentText": "when hillary lies then gets caught then it's always someone else's fault but she the one with her hole foot in her mouth",
    "likes": 0
  },
  {
    "commentText": "Can't understand guys like Gary Byrne. When you make a pledge to honor and protect the secrets of the nation while serving then that should stand. To hell with some whinny bitch who thinks he has a secret to share and wants to try and cash-in. If I were to ever do the same about 1984-1989 it would bring the roof off. I would have to title my book, \"And The Wall Came Tumbling Down!\"",
    "likes": 0
  },
  {
    "commentText": "Not only is ISIS an enemy of the people of the United States, so is the FBI and the IRS....govt. pawns one and all.",
    "likes": 0
  },
  {
    "commentText": "He sounds like a crafty story teller to me.",
    "likes": 0
  },
  {
    "commentText": "George H.W. Bush drugged each and every member of the permanent W.H. staff with Enflurane, a drug which causes amnesia and hypnosis.  This is George H.W. Bush, umbrella man, slandering the Clintons.\nHillary Clinton is a fine, decent Church Lady.",
    "likes": 0
  },
  {
    "commentText": "No mention of him being completely discredited by the USSS and by his own previous testimony.  He is just another James Okeefe. He believes he can't be discredited because he can blame it all on the \"Clinton Machine\" coming after him.  He is despised by all of his former colleagues.  Also he was not an Agent as the FOX News idiots keep referring to.",
    "likes": 0
  },
  {
    "commentText": "Slime lookin for a dime.",
    "likes": 2
  },
  {
    "commentText": "He worked for the crooks. Bill was such a dick , glad the bitch wacked him. \nI hope she cut his dick off before she goes to jail.\n\" I believe the X secret service guy\"...",
    "likes": 0
  },
  {
    "commentText": "Hahahaaa...I want my kid's to know.....yes we all know who you are \" Scumbag\" trying to make a buck with an old story ! By the way... If it's true.... Hillary did exactly what any wife would do to their husband if caught cheating !",
    "likes": 0
  },
  {
    "commentText": "Don't forget to use the word Volcanic... over and over again...",
    "likes": 0
  },
  {
    "commentText": "Lol... I thought he was supposed to protect the President....take the bullet or blue vase ?",
    "likes": 0
  },
  {
    "commentText": "Crooked Hillary will not be elected. The American people have the last say and they don't want her. She already lost once.",
    "likes": 0
  },
  {
    "commentText": "If trump becoming the nominee didn't prove to republicans that taking this idiot stance of \"if I don't get what I want no one gets anything\"  fucking man up and act like adults.",
    "likes": 0
  },
  {
    "commentText": "I'm sure he became a secret service agent based on his political bias. Cons bitch more then any other group wa wa wa hahaha",
    "likes": 0
  },
  {
    "commentText": "Airline pilots and secret service agents have one thing in common. Their word cannot ever be second guessed because of their superior mental capacity associated with those occupations.",
    "likes": 0
  },
  {
    "commentText": "hilary was a sexy bitch back in the day lol",
    "likes": 0
  },
  {
    "commentText": "Isn't what he's doing illegal?  I thought Secret Service people have to sign some kind of NDA?  What gives?",
    "likes": 0
  },
  {
    "commentText": "Clintons always get caught trying to cover their lies",
    "likes": 0
  },
  {
    "commentText": "What? She's the only one exposed? There's worse you know, but you won't talk about that. You know why? Because Fox News is not news it's right wing propaganda, Yeah that's right! The day you expose everyone including right wing/republicans you will be a legit news reporters!",
    "likes": 0
  },
  {
    "commentText": "Who gives a fuck?",
    "likes": 0
  },
  {
    "commentText": "why doesn't anybody address the fact that Lewinsky was a mossad honeypot and Tripp was a mossad agent",
    "likes": 0
  },
  {
    "commentText": "Trump is our last chance.............Even then we are in for one hell of a rough ride.  The HildeBeast will get us nuked............",
    "likes": 0
  },
  {
    "commentText": "sad.... an old lady bag bashing of somebody for profit... typical of Fox News....",
    "likes": 0
  },
  {
    "commentText": "May God protect this man for speaking the truth.",
    "likes": 476
  },
  {
    "commentText": "Hilary is a Worthless fucking cunt",
    "likes": 0
  },
  {
    "commentText": "Can you spell Bi  Polar ?",
    "likes": 0
  },
  {
    "commentText": "Run Away Best Seller!!!!  TOO FUNNY!!!   If gary isn't wearing pink bikini underwear, I'd be very surprised.",
    "likes": 0
  },
  {
    "commentText": "Typical of the Demorats to sweep all improprieties under the rug.",
    "likes": 2
  },
  {
    "commentText": "American politics is infinitely more interesting than Australian politics. I'm not saying there is no criminality, but it's not played out much in the media or on you tube.",
    "likes": 0
  },
  {
    "commentText": "▀█▀▒█▀█▒█▒█▒█▒▒▒█▒█▀█▒▒█▀█▒█▀█▒█▒█▀█▒█\n▒█▒▒█▄█▒█▒█▒██▒██▒█▄█▒▒▄▄█▒█▒█▒█▒█▄▄▒█\n▒█▒▒█▀▄▒█▄█▒█▒█▒█▒█▒▒▒▒█▄▄▒█▄█▒█▒█▄█▒▄ OR DIE...",
    "likes": 0
  },
  {
    "commentText": "She should be beaten to death by fist",
    "likes": 0
  },
  {
    "commentText": "So sad. Your life accomplishment is to pretend you wrote a book with a bunch of gossip trash in it. He thinks he's so important now. This guy is a sad excuse of a man.",
    "likes": 2
  },
  {
    "commentText": "The Clinton's are dirty as hell, just like 90% of politicians in the world; what else is new...",
    "likes": 0
  },
  {
    "commentText": "Low level secret service guy who just happened to be there EVERY TIME SOMETHING HAPPENS...SO BELIEVABLE...HMMM...Selling a book maybe...FOX happy to dump on Hillary every chance they get...which maybe easy since these three look constipated as hell...",
    "likes": 1
  },
  {
    "commentText": "Check out for yourself how many have died during any and all Clinton investigations that would have landed either and or both in prison.",
    "likes": 0
  },
  {
    "commentText": "“Clinton’s Body Count.”  We’ll could through the entire list and evaluate each one,  it is true that they had some connection with Bill Clinton, or with someone who was in Clinton’s sphere, and that many of them died violently or by suicide.  That raises the question of whether their deaths were related and whether any of the deaths can be linked in any way to Bill Clinton.There is no credible evidence that any of the deaths is related or can be attributed to Bill Clinton.  Some of the descriptions of the deaths are not accurate.According to a May 5, 2000 article in the Arkansas Times, the “Body Count” list originated  in 1994 run by an Indianapolis lawyer named Linda Thompson of the American Justice Federation.  It has been circulating ever since.  The list came up in sworn testimony that White House employee Linda Tripp gave to Judicial Watch chairman Larry Klayman in December, 1998.  Trip testified that a hand-written list of people who were involved with Clinton and who had suffered mysterious deaths ended up on her office chair in the White House.  This was just before the sex scandal between White House Intern Monica Lewinsky and President Clinton became known publicly.  Tripp said that the list was accompanied by a note that said, “Linda, just thought you’d find this of interest.”   PS: Don't be lazy look up who and what the Clintons are.",
    "likes": 0
  },
  {
    "commentText": "James McDougal died on Sunday, March 8, 1998 in John Petersmith Hospital in Ft. Worth, Texas.  He had been serving a federal prison sentence for fraud in connection with the Whitewater land deal.  At first, he claimed to be innocent, but after being convicted of 18 felony counts, he cooperated with Special Prosecutor Kenneth Starr’s investigation of the Clintons.  He was scheduled to give damaging testimony against the Clintons, although critics of the investigation say his testimony had previously been inconsistent and that nothing new was expected to be revealed.  A prison spokesman said McDougal died of a heart attack and had been suffering from heart disease and blocked arteries.",
    "likes": 0
  },
  {
    "commentText": "Mary Caitrin Mahoney was murdered over the July 4th weekend in 1997 at the Georgetown Starbucks near Washington D.C.  She was the assistant manager and, according to published reports, she and two other employees were working late at night after the coffee bar had closed.  All three were found shot to death.  No money was taken and there was no sign of forced entry.  In 1999, Carl Derick Cooper was charged with the murders, six armed robberies, and other shootings.   Mahoney had interned for the White House official responsible for contact with the Asian-American community.  TruthOrFiction.com has not found any documentation that she was about to “go public with her story of sexual harassment in the White House” or that her death was anything beyond that of a murder associated with the robbery.  A report in The Washington Weekly explains that journalist Mike Isikoff had written that “a former White House staffer” with the initial “M” in her name was going to go public with a sexual harassment story and people speculated he meant Mary Mahoney and that was why she was killed.  Later, it turned out that he was referring to Monica Lewinsky.",
    "likes": 0
  },
  {
    "commentText": "Ex-UN Official John Ashe died suspiciously the day before he was scheduled to testify against Hillary Clinton.",
    "likes": 0
  },
  {
    "commentText": "Didn't Nazi Germany have SS? \nI wonder why they quit wearing lightning bolts\non their sleeves.",
    "likes": 1
  },
  {
    "commentText": "As a post script,  hillary needs to be behind bars and only because our federal system is  so corrupt, she is not.  Actually,  her husband needs to be there with her.",
    "likes": 0
  },
  {
    "commentText": "i have always said our votes do not count due to the electoral votes so why bother to vote. Besides, as of the last 16 years, Presidents have been selected by higher authority,  not elected.",
    "likes": 0
  },
  {
    "commentText": "Fox is the right arm of the Republican Party! This PROPAGANDA FOX PUT OUT IS JOURNALISTIC SHIT! FUCK FOX!",
    "likes": 0
  },
  {
    "commentText": "i don't like the Clintons ..but this guy and this info scrapes the bottom of barrel and is not relevant to election",
    "likes": 0
  },
  {
    "commentText": "All we need is a hysterical woman \"leading\" the \"free\" world !",
    "likes": 0
  },
  {
    "commentText": "The comments made are very worrying : having many agenda is one thing : BUT THE INABILITY TO MANAGE AND LEAD IS WORSE :(\nWould you allow her to have a finger anywhere near a nuclear button ???",
    "likes": 0
  },
  {
    "commentText": "He is telling the truth 100 %. I remember when it happened and a friend of my uncle was a secret service agent and he told us the whole story right after it happened and what he was hit with was a crystal ash tray.",
    "likes": 5
  },
  {
    "commentText": "You  Hillary hatin' whackjobs got your asses handed to you after the Benghazi hearings showed no wrongdoing by Hillary or the POTUS. You've got the worst fucking excuse for the GOP Nomination in the history of American politics....\nNow, this guy is trynna take us back to Monica Lewinsky.\nWTF!!! REALLY??\nThat shows just how desperate the GOP is. What a Fucking clown show!",
    "likes": 0
  },
  {
    "commentText": "How does she get such power over most of the media?",
    "likes": 0
  },
  {
    "commentText": "How weak of a woman do you have to be to remain married to a sexual predator",
    "likes": 0
  },
  {
    "commentText": "yall funny I love yall",
    "likes": 0
  },
  {
    "commentText": "“Rehash Of Old Rumors,” “Contradicted By His Own testimony. Pro Trump idiot who thinks this will make a dent on Hillary's armor. Not happening folks! Lmao. Trump's mouth, lack of knowlege, and shoddy character already lost him the election after he insulted Jeb Bush and his wife. This clown doesn't have the support of single living Republican president, in fact all 5 living  Presidents say he is a scumbag. But you zombies keep listening to your Fox news bs. This will make his loss that much poingnant. Bwahahaha",
    "likes": 1
  },
  {
    "commentText": "And none of the other networks will touch him courtesy of Hillary's spin team...smh.",
    "likes": 0
  },
  {
    "commentText": "My only comment is, She's been picked to be president.\nMark my words.\nDas Ende",
    "likes": 19
  },
  {
    "commentText": "Hillary will be the worst thing that could happen to this country. We have lost so much respect and admiration in the years since Ronald Reagan. Hillary will destroy the little that we have left. She cares for one thing and one thing only money prestige and having \"President\" on her resume. The little people that go to work each day and believe in this country are her least concern.",
    "likes": 117
  },
  {
    "commentText": "The Clinton's are the epitome of the entitled, corrupt political class. Hillary lambasting the 1% is laughable.",
    "likes": 0
  },
  {
    "commentText": "Hillary Clinton is very, very lucky modern America is chock full of ignorant dumbasses or not only would she NOT get elected President, most likely she would be facing time in Federal prison.  Liberals need to be fuking put down - period.  And if they get their way and destroy this nation they may be very surprised how their lives change and not for the better.",
    "likes": 81
  },
  {
    "commentText": "This fellow is not the only one to say that Hildabeast does not like men.  She is a radical feminist lesbian.   Watch out men she is coming after us if she is elected.",
    "likes": 0
  },
  {
    "commentText": "Excellent",
    "likes": 0
  },
  {
    "commentText": "a sign of punishment is to be assigned to protect hrc, wow",
    "likes": 0
  },
  {
    "commentText": "fox news is loaded with misogynistic women and men",
    "likes": 2
  },
  {
    "commentText": "She needs to be in prison the rest of her life. Bill can join her!!!!",
    "likes": 0
  },
  {
    "commentText": "Let's see if this guy doesn't end up dead like the rest that cross Hillary!",
    "likes": 0
  },
  {
    "commentText": "Way to go Gary.  You keep pushing,  even thought she is trying to block you.  We can't let these people get another eight years in the Whitehouse.   She's a dictator!",
    "likes": 0
  },
  {
    "commentText": "HILLARY 2016",
    "likes": 0
  },
  {
    "commentText": "Read \"American Prisoners of the Revolution\" by Danske Dandridge on the Gutenberg Project website (free) to truly enjoy and experience our Fourth of July's freedom.",
    "likes": 2
  },
  {
    "commentText": "CROOKED HILLARY!",
    "likes": 0
  },
  {
    "commentText": "Donald hands him 20 million dollars.",
    "likes": 1
  },
  {
    "commentText": "it doesn't matter what comes out about Hillary, plenty of morons will still vote for her",
    "likes": 0
  },
  {
    "commentText": "I absolutely cannot stand anyone who claims to be a citizen of this country and knows how corrupt Hillary Clinton is, but still says they plan to vote for her! Oh, and dont forget about the brainless idiots who are voting for her just because she's a woman. \nI would support a woman for president,  but just not this woman. \nIf Hillary Clinton were to be elected the first woman president, she'd ruin the chance of presidency for  other future woman candidates for years to come....similar to what Obama has done for future African American candidates.",
    "likes": 0
  },
  {
    "commentText": "Ok,, more later,, I am cleaning my Assault Rifle right now.  Just trying to keep it simple for u.   Trump '16",
    "likes": 0
  },
  {
    "commentText": "Respect dad",
    "likes": 0
  },
  {
    "commentText": "Clinton's are so classy! Not!",
    "likes": 2
  },
  {
    "commentText": "Please God help us with the enemy , the deceiver ,Hillary. She is evil and corrupt in every way",
    "likes": 0
  },
  {
    "commentText": "Why would anybody ever vote for her?",
    "likes": 0
  },
  {
    "commentText": "Please die Hillary. Please.",
    "likes": 2
  },
  {
    "commentText": "Oh who cares!!! I'm still voting for her!!! Go Hillary!!!",
    "likes": 3
  },
  {
    "commentText": "who the fuck cares if they had a fight you fucken freak they are married ! looser",
    "likes": 0
  },
  {
    "commentText": "you people are freaks ! you would rather have a Rothschild in office you rich freaks ,look he is still talking about Bill having affairs lol So What you fools !",
    "likes": 0
  },
  {
    "commentText": "ONE WORD: TRUMP",
    "likes": 0
  },
  {
    "commentText": "Ex-UN Official John Ashe died suspiciously the day before he was scheduled to testify against Hillary Clinton.",
    "likes": 0
  },
  {
    "commentText": "Although it was once honorable for these agents to hold confidentiality above all else things have changed. At this point these agents, who put their lives on the lines for those they protect (our tax $$) they, and their oath of secrecy is being used and exploited for all kinds of activities ranging from sleazy to downright treasonous It's just possible that they want to tell the public what's going on behind closed doors instead of using the \"I was just following orders\" excuse.",
    "likes": 2
  },
  {
    "commentText": "Too bad that it took so long for this to come out.",
    "likes": 42
  },
  {
    "commentText": "deja vu all over again. Ain't gonna happen, not gonna happen. This lady has no reason to be in the White House. I think it's going to be another Harry Truman incident. God help us all if it isn't. God bless the Don.",
    "likes": 0
  },
  {
    "commentText": "Money makes strange bedfellows!",
    "likes": 0
  },
  {
    "commentText": "These observations are leading up to what we will get if Hillary is elected - Queen Hillary. Her first actions as President would be to have a Russian style pogrom - everyone not appointed by her will be shot. Oops, I mean discharged. Hillary's demeanor can be observed on any day. It's a constant flow of phony actions such as pointing to a mythical person in the audience. Maniacal smiles that mean nothing. Taking the \"high\" ground as if she is totally without sin. She no longer talks of priorities she would have if elected but only goes in for character assassination of her opponents. It's a scary potential future we may have.",
    "likes": 0
  },
  {
    "commentText": "Good summer read. Toxic.",
    "likes": 0
  },
  {
    "commentText": "we have to wake up about the Clinton's these devil worshipping people have a evil agenda, black people need to stop acting like this bitch is on our side she uses that bullshit with us and we fall for any and everything, just Obama did this motherfucka haven't done shit name one thing that this same agenda motherfucka have done for us! ? not shit black people wake up see shit for what it really is! !! if you can legally arm ur self do it if this bitch get in we are in trouble, you have to really listen to trump the shit he say is really true I'd rather have him than her! WAKE UP! !!!",
    "likes": 0
  },
  {
    "commentText": "THE CLINTONS ARE THE SCUM OFF THE EARTH WITH THE CRIMES RAPES EXT  HOW IN THE FUCK CAN SHE STILL RUN FOR PRES THE U S A is a fucking joke these filth should BE BEHIND BARS NO WONDER THE COUNTRY IS UP SHIT CREEK FUCK STAND UP PEOPLE AND DEMAND FOR THE HEADS OF THESE PIECES OF SHIT TO BE PUT ON TRIAL 4 FUCK SUCK SHOW SOME SPINE.",
    "likes": 2
  },
  {
    "commentText": "If you want to know how i feel about Hillary, your just need to change the first letter in her husbands name from a \"B to a \"K\"",
    "likes": 35
  },
  {
    "commentText": "And some people want this witch in office I wish they would put that bitch in prison!!!",
    "likes": 0
  },
  {
    "commentText": "He seems genuine",
    "likes": 0
  },
  {
    "commentText": "The A, B, Cs of voting in 2106:  Anybody But Clinton.",
    "likes": 0
  },
  {
    "commentText": "How about for the $$$$$",
    "likes": 0
  },
  {
    "commentText": "HILLARY HAS SCABS!",
    "likes": 0
  },
  {
    "commentText": "hillary clinton you don't have my vote!",
    "likes": 0
  },
  {
    "commentText": "The sex scandals of the Clinton WH are the low-hanging fruit.  The really insane scandals are the ones involving espionage back then, illegal foreign campaign money, obstruction of justice, murder, firing of the Director of the FBI, death of Deputy WH Counsel Vince Foster the next day, Filegate, Travelgate, Whitewatergate, Chinagate, Vietnam embargo lift quid pro quo, Waco....\n\nThe event that allowed the Clinton WH to turn around from the depths of scandal after scandal was Oklahoma City.  Never let a good crisis go to waste.",
    "likes": 1
  },
  {
    "commentText": "There's a reason Putin calls her the \"Wicked Witch of the West\".  He's had to deal with her.  She's even told an audience that he has no soul. and he's countered by saying that she has no brain.  He's also indicated she would be a threat to Russia and could prompt a unilateral nuclear response.  I hope the FBI is able to stop her, and if there's any justice at all left in this country, she will be indicted.",
    "likes": 0
  },
  {
    "commentText": "You pop up \"now\" all of a sudden...when she is about to become President? chile bye...and BYE to that book! Like what do you want from this?",
    "likes": 1
  },
  {
    "commentText": "this is so wack. He is clearly seeking attention. To even say out his mouth. She don't like military, men, or even law enforcement. He is mentally crazy. He collection COINS with his \"book\" while she is running for PRESIDENT. Shit like this is a sign that we are coming to the end of our time. This guy has the wrong motive.",
    "likes": 1
  },
  {
    "commentText": "WHAT A DISGRACE THE CLINTON'S REALLY ARE!!!...I AM GLAD THAT OTHERS HAVE THE TRUTH WITHIN TO COME OUT TO EXPOSE THE CLINTON'S CORRUPTION....",
    "likes": 120
  },
  {
    "commentText": "Hilary or trump? I will go with trump",
    "likes": 0
  },
  {
    "commentText": "Hillary is a two-faced liar!!! P.S. ware is Bill… with Monika",
    "likes": 1
  },
  {
    "commentText": "Hitlery Clinton. A fucking lying piece of shit.",
    "likes": 0
  },
  {
    "commentText": "And she has the unmitigated gall to repeatedly say that Donald Trump's temperament makes him unqualified for the job?",
    "likes": 2
  },
  {
    "commentText": "She will be the next president of the USA ..",
    "likes": 0
  },
  {
    "commentText": "i cant believe how they going to vote for Hillary",
    "likes": 0
  },
  {
    "commentText": "Dangerous and angry behavior??? Doesn't sound like she should even be a candidate and hopefully this story will be heard by the individuals in charge of the indictment.",
    "likes": 0
  },
  {
    "commentText": "No to Hilary she isn't capable of being president!",
    "likes": 0
  },
  {
    "commentText": "What Truth you want people to know..he is a jerk..Trying to stop Clinton with this stupid gestation that Wow Hillary Clinton can get mad. I think thats great she can get mad..I think its important that she is firm. With a man like Bill she needs to be Firm. He should be happy she didn't give him more than a Black Eye. Me. Clinton is despicable for doing that to his wife in the White House. I mean President Obama graced the White house with his presence and with dignity. He doesn't even get credit for that.",
    "likes": 0
  },
  {
    "commentText": "This guy is a pussy.  This secret service agent has no honor, his duty is to protect the first family and STFU. Not get rich off of his position and access. FoxNews is the perfect venue for this bullshit.  Enjoy Hillary as POTUS.",
    "likes": 0
  },
  {
    "commentText": "Only fellow criminals and liars support Hilllary. I've told my neices to stay away from the Hillary supporters in their college since they are very dangerous and untrustworthy people. They decided to vote Bernie LOL (slaps hand over forehead) but that is still infinitely better than losing them to the Queen Cunt.",
    "likes": 0
  },
  {
    "commentText": "even bernie knows hillary is corrupt ! vote TRUMP",
    "likes": 6
  },
  {
    "commentText": "if hillary Clinton gets in there will be more n more problems in the world they most probably go for iran which they so determined god help us",
    "likes": 0
  },
  {
    "commentText": "they aways bring isreal into it . how about gaza suffering ever bloody day !!!!",
    "likes": 0
  },
  {
    "commentText": "i believe him just to many shady deals one or two maybe not but if you utube the clintons there are pages of stuff me or you would still be in jail",
    "likes": 0
  },
  {
    "commentText": "i believe him just to many shady deals one or two maybe not but if you utube the clintons there are pages of stuff me or you would still be in jail",
    "likes": 0
  },
  {
    "commentText": "Old gossip.  This is all Republicans have left.  I guess when your candidate is a fvcking clown who cheats on his wives, raped and scalped the first one, is on trial for fraud,  is married to a porn star - you have to make things up.",
    "likes": 0
  },
  {
    "commentText": "I hope all you morons that are going to vote for her don't give a shit about your kids and grand children and maybe someday you will be able to forgive yourself for what you did to their rights, freedoms and money",
    "likes": 1
  },
  {
    "commentText": "The Clintons have deep roots and they are rigging the election. There is no way more people think this woman who is obviously not acting genuine should be in power. With Trump, he's not a politician and you can tell, but what this means is he's being genuine.",
    "likes": 0
  },
  {
    "commentText": "Gary Byrne (USSS UD Ret.) needs his own security detail now. Blackwater, Triple Canopy???",
    "likes": 1
  },
  {
    "commentText": "tyt got paid off too it's a damb shame",
    "likes": 0
  },
  {
    "commentText": "Trump for life! Amen for this guy!",
    "likes": 0
  },
  {
    "commentText": "No one wants to hear the truth : they only hear what they want to hear !\nBUT WHY DO THE AMERICAN PEOPLE WANT THIS WITCH ???\nWhat spell has shown cast over them ?",
    "likes": 146
  },
  {
    "commentText": "Debunked by those who know.  Just another empty right wing smear by a dbag trying to make money from slander.",
    "likes": 0
  },
  {
    "commentText": "HILLARY HAS SO MUSH ON THE GOV THAT IF SHE  FALLS THE GOV WILL FALLS !",
    "likes": 1
  },
  {
    "commentText": "These panel of hosts on this show are biased for the crooked woman. it looks like that they omitted something important what we need to know from what former secret agent exposed her,real her. This show is very shallow and not having substance and very cheap .These guys should be more honest and respect their viewers.",
    "likes": 0
  },
  {
    "commentText": "She was on coke to everyone in the white house was it gives you backbone it gives you balls and it makes you to want to have sex all the time.You will fight anyone I know this because I had a good friend on this and she acted the same way thank the lord she found god and she is off for many years now.I know Hillary was on coke to!!!!!!!!!!!!",
    "likes": 0
  },
  {
    "commentText": "The American people will rise up against Hillary !!!!!!!!! We do not care what Obama and Hillary says you wanted war you got one!!!!!!!!!!!!!!!!",
    "likes": 0
  },
  {
    "commentText": "No vote for Hillary Clinton...she is too bad & not a leader....vote Trump2016",
    "likes": 3
  },
  {
    "commentText": "he is broke ... he wants to earn money form other personal life !!",
    "likes": 1
  },
  {
    "commentText": "It's always been known from other insiders that she was a super douche bag, and she's gotten away with it all these years.",
    "likes": 0
  },
  {
    "commentText": "queen hillary is a ugly CUNT!!",
    "likes": 0
  },
  {
    "commentText": "His book won't sway a single Clinton supporter, they will vote for her no matter what.  That is why our country is in such bad shape.",
    "likes": 0
  },
  {
    "commentText": "SHE DIDNT EVEN HAVE ENCRYPTION ON HER SERVER. WE CANT HAVE THAT LEVEL OF STUPIDITY IN THE OFFICE SHES NOT REPRESENTING AMERICA. SHE AND OBAMA ARE MIND CONTROLLED PROGRAMMED SLAVES REPRESENTING THE CARLYSLE GROUP. BUSH SR. IS THEIR HANDLER.",
    "likes": 0
  },
  {
    "commentText": "It's too bad Ken Starr decided he was going to oversee and support the mass rape of females on the Baylor University campus. He still has his job. He also brought charges against Bill Clinton for getting a blow job. I guess if Bill had raped her, it wouldn't have been a big deal. We know how much conservatives love rape.",
    "likes": 0
  },
  {
    "commentText": "SECRET SERVICE ARE ARMED ARENT THEY? HE WOULD HAVE BEEN AN EVEN BIGGER HERO IF HE HAD TAKEN THE WITCH OUT!!!",
    "likes": 0
  },
  {
    "commentText": "Send the witch and her lapdogs to jail and throw the key away.",
    "likes": 0
  },
  {
    "commentText": "domestic violence. Gee.",
    "likes": 0
  },
  {
    "commentText": "Clintons = modern day Bonnie & Clyde",
    "likes": 0
  },
  {
    "commentText": "I don't know of a police department in the country that would hire Hillary to be an officer. They do not hire people who are under federal investigation and being sued by 39 (or so) different people/entities. They might say, \"Come back when all this goes away,\" (or something along that line).\" They do not hire people with simple, poor credit. Now, considering that, why would we hire her as President of the USA under these conditions? After all, when hired (voted in), she would have her hands on the most important weapons in the world -- and surely the most powerful. President is a much higher rank than Chief of Police. She would be Commander in Chief! And, she doesn't qualify. \n\nIt's difficult to understand how she was even vetted to run for President under these conditions. She does not meet the standards to be a police officer nor the President. End of story!",
    "likes": 0
  },
  {
    "commentText": "It's time we have our first \"F\" president. I meant female but the \" emale \" got deleted.",
    "likes": 303
  },
  {
    "commentText": "This scumbag was a glorified security guard with no character. Pathetic shit, sees what he thinks is a black eye, a broken vase and hears a domestic dispute. Testified seeing Monica Lewinsky 4 times\nGeorge W Bush was likely drunk, fell and smashed his face on a coffee table in 2001. I don't want a scumbag Gary's replacement telling me about drunk Bush. That's private life. \nFox shitheads didn't challenge this whore on violating trust.",
    "likes": 0
  },
  {
    "commentText": "'Allergic to coffee under one eye', that cracked me up.",
    "likes": 0
  },
  {
    "commentText": "Everyone need to bring the truth out before she does more damage. I  have noticed Hillary followers do not want to know the truth. Hope this guy can spend the money from his book. Better arrange his funeral while he has time.",
    "likes": 0
  },
  {
    "commentText": "Good job buddy. If only you could get full coverage. ... Maybe Trump will invite you to speak somewhere, who knows?",
    "likes": 0
  },
  {
    "commentText": "Can't wait till Trump gets a a hold of this.  He is going to have so much fun.  By the way, not a Hillary or Trump supporter.  Now that it seems these are the only two left running, I enjoy the show.",
    "likes": 0
  },
  {
    "commentText": "I am torn by this guy , because I believe what he says is true... Yet It's kind of sleazy of him to tell ...I don't think it will change the minds of her supporters  ...",
    "likes": 33
  },
  {
    "commentText": "Hello american folks!I'm from France,and I pray for Trump will be president!Do the right choice!That would be the greatest thing for the Humanity!H.Clinton is evil!She is just a rotten agent of N.W.O!She don't care about common poeple!Don't be influenced by american medias!Please american people help us!",
    "likes": 0
  },
  {
    "commentText": "they can turn shit into Gold...  Good words...   I am so happy that you came forward VOTE FOR TRUMP 2016",
    "likes": 1
  },
  {
    "commentText": "Hillary treats the United States and its citizens the same way she treated the irreplaceable furnishings in the White House when she smashed them in a fit of rage against her philandering, rapist husband.  'Nuff said.",
    "likes": 0
  },
  {
    "commentText": "Some marketing tactic! Bet most of it's true but what timing..",
    "likes": 2
  },
  {
    "commentText": "She just sounds like the normal wife to me, U know women get mad, have frustrations, knock us upside the side the head sometimes when we neglect them, don't listen to them, or may have done them wrong in any way. And the privacy thing..who wants people around all the time..everyone needs private family time, everyone deserves privacy.",
    "likes": 2
  },
  {
    "commentText": "WOW! One that escaped the Clinton muzzle. Must have been low on caskets and flags.",
    "likes": 0
  },
  {
    "commentText": "I'm tired of this Fox anti-Hillary rubbish! Unsubscribe.",
    "likes": 1
  },
  {
    "commentText": "One word describes Hillary, it starts with a C and ends with a T!",
    "likes": 106
  },
  {
    "commentText": "So, this former Secret Service guy writes a book about the Clinton relationship or lack of. Is it a crime for a married couple to have rows or differences? Does every person in a difficult marriage suffer from a 'Crisis of Character'.  \n\nSecret Service agents should keep quiet about what they see and hear when taking care of the President. He is a disgrace to his former occupation in my view.  Secret Service agents are men of honor who will put their lives in danger to save the President, honorable men will not and do not expose to the world,  the private lives of the people they are sworn to protect. I am a law enforcement officer and I am embarrassed at this breach of confidence.  \n \nIf this interview relates to the best bits of his book, then the book is garbage!!! I feel so sorry for him, he can't looks his kids in the face, because he knew Bill Clinton was having affairs, COME ON!! Garbage!!!. He wrote it to make money, full stop and is on Fox to sell it to people who want to read and believe anything negative about the Clinton's.\n\nIf Fox and Friends is a serious program, it should not have guys like this on. \n\nWhen are they going to do a story about Donald Trumps affairs? Maybe he didn't have any. If not, how come he is on his third wife? If there is a book written about that, it is garbage as well. People's personal lives are their own. Cop on!!!",
    "likes": 0
  },
  {
    "commentText": "Please tell every body to read Richard Chagrin's analysis of the election fraud that cheated Bernie Sanders from being the real winner of the Democratic Primaries. Bill is a psychopath and killary is a malignant narcist.",
    "likes": 0
  },
  {
    "commentText": "If Hillary gets elected she'll ditch her Secret Service? That is a tragic mentality. Which agent in their right mind would stop a bullet for her? Yet I have no doubt an agent would put their self in harms way for her. That's called DUTY. The Secret Service is very duty conscious and I hold them in high esteem. Keep up the good work. The good citizens appreciate you.",
    "likes": 0
  },
  {
    "commentText": "lol, Gary Byrne is a disgruntled blacklisted disgrace who thinks he can sell a book to make up for everything he lost... regardless if some of it is true, or none of it is true- you'll never know what's real and what's the ramblings up a butthurt former employee.",
    "likes": 2
  },
  {
    "commentText": "I am not a fan of clinton but I am against this guy doing a tell all.  There is a reason it's called the \"Secrete\" Service.  People being protected by the Secrete Service must be able to trust their agents in ALL aspects of their job.  No matter how horrible a person the one being protected is.",
    "likes": 0
  },
  {
    "commentText": "Nothing Trumps Freedom!",
    "likes": 0
  },
  {
    "commentText": "there are so many actual criminal doings... we need to stop distracting people. Bill fucking a 22 year old ...or Hillary not liking eye contact...who cares? This woman has stolen money, committed perjury, taken bribes, destroyed evidence in at least 3 separate investigations, misused the IRS and FBI to intimidate citizens...and you guys say \"tell us about the thong\" giggle giggle. Hillary is Tony Soprano & you are trying to convince us this is sex and the city...distract",
    "likes": 0
  },
  {
    "commentText": "Hillary is going to import more terrorist in our country than ever before in our lifetime, God forbid, if she becomes the president.",
    "likes": 2
  },
  {
    "commentText": "So what's the conclusion ?",
    "likes": 0
  },
  {
    "commentText": "That's right sell them books. The propaganda network.",
    "likes": 0
  },
  {
    "commentText": "Thank you Fox for not being part of the Clinton news network. It's good to see stories putting Hillary down",
    "likes": 47
  },
  {
    "commentText": "Too bad this was posted to Fox news where none of her voters will see it.",
    "likes": 335
  },
  {
    "commentText": "Amen for this dude coming forward!!!",
    "likes": 589
  },
  {
    "commentText": "Anyone who has followed the Clintons, knew this basic story decades ago.  Stems back to Arkansas.  Why hasn't this guy or any other agent, officer, patriot, contitutionalist, oath keeper or just a regular citizen arrested her for even ONE of her countless crimes?  That is the question.  And the painful and obvious answer is that she is not the biggest problem.  Sadly, the American people are.",
    "likes": 20
  },
  {
    "commentText": "The three foxes are looking uncomfortable...\n\nKudos to FOX for allowing this brave man to expose this disgusting bitch. Duplicitous little powerhouse that she is.\n\nHer passing will be a beeline to a hellish realm. May she be forever consumed.",
    "likes": 3
  },
  {
    "commentText": "Not surprising to hear! Hillary doesn't like anybody and certainly not a leader just ask anyone who worked for her like this guy.",
    "likes": 9
  },
  {
    "commentText": "I'm not so sure I want to vote for Hillary if this guy is telling the truth .",
    "likes": 89
  },
  {
    "commentText": "Charge hillary clinton with treason here -> https://www.change.org/p/to-file-treason-charges-against-hillary-kerry-mccain-and-obama",
    "likes": 10
  },
  {
    "commentText": "Good job Gary...watch your back.",
    "likes": 33
  },
  {
    "commentText": "She can't even keep her husband how is she supposed to run America.... The CLINTONS are SLOPPY. 🖕🏻\nTRUMPTRAIN🚂🚂🚂",
    "likes": 52
  },
  {
    "commentText": "WHAT A BRAVE MAN FR STANDING UP AGAINST THE EVIL WICKED WITCH. WE THE PEOPLE STAND WITH TRUMP",
    "likes": 211
  },
  {
    "commentText": "Keep this guy on the show every day talking about his experiences with the Clintons. Hillary is not complaining or saying that this guy is lying or wrong. Media will downplay this as usual then attack Trump on his behavior.",
    "likes": 318
  },
  {
    "commentText": "Lol to the ppl calling him paid for. Ok # 1 a book magically doesn't write itself & get published over night.  He was working on this book b4 Hillary was even running for office as well as her behavior",
    "likes": 14
  },
  {
    "commentText": "Burn this bitch, fox!",
    "likes": 146
  },
  {
    "commentText": "feel the burn 🇺🇸",
    "likes": 10
  },
  {
    "commentText": "Jaaaaail house,Hillary!",
    "likes": 27
  },
  {
    "commentText": "Trump2016",
    "likes": 14
  }
]