[
  {
    "commentText": "This publicity is awesome for God's People. The Light Wins. God's People, do your part and flood these witches with Light.",
    "likes": 0
  },
  {
    "commentText": "Of course it’s real!  They show you who they really are but people just say, no its just pretend.",
    "likes": 0
  },
  {
    "commentText": "Nothing is as scary as a pissed off group of bitches - I  mean witches  .",
    "likes": 0
  },
  {
    "commentText": "I pray in the name of Jesus for the power of God to be placed on Kavanough and his family. Amen. That's it one drop of Jesus blood can quench all the flames of hell.",
    "likes": 0
  },
  {
    "commentText": "Democrats worship Satan. This comes as no surprise.",
    "likes": 0
  },
  {
    "commentText": "My ex-wife will be there no doubt!",
    "likes": 0
  },
  {
    "commentText": "Seems to me these witches should want to put an end to all witch hunts and get back to innocent until proven guilty and due process.  It did not work out well for them a few centuries ago and would not work out for them again.  They seem to be the ones with the most to lose. As for Kavanaugh, he will be fine.  But these witches that practice black magik have some bad Karma to deal with.",
    "likes": 0
  },
  {
    "commentText": "WAKE UP AMERICA,This is nothing new..It is the battle between good & Evil... USMC Veteran IN OREGON... Pray the Blood of Jesus Rebuke this Evil Age... Pray PEOPLE always then VOTE...",
    "likes": 0
  },
  {
    "commentText": "Their hexing over our President Trump has been fruitless. God is very much in control.",
    "likes": 0
  },
  {
    "commentText": "Being a nut isn't a power.",
    "likes": 0
  },
  {
    "commentText": "A hex isn't an act of violence.....haha its like charging someone because they say they are going to send the witches flying monkeys at em.",
    "likes": 0
  },
  {
    "commentText": "And you'd think burning witches was wrong...",
    "likes": 0
  },
  {
    "commentText": "Pretty hard to be a stupid as that brown-haired bimbo.",
    "likes": 0
  },
  {
    "commentText": "I agree with Tucker. They should be arrested.",
    "likes": 0
  },
  {
    "commentText": "\"Witches\" just means its a DNC rally with Hillary Clinton as the head Witch.",
    "likes": 0
  },
  {
    "commentText": "🌌⚡😵 the Liberals are so desperate !! Why not  try to cast a spell to make one of the Democrats electable and even honest ? now that would be some very powerful witch craft !!",
    "likes": 0
  },
  {
    "commentText": "Mentally ill",
    "likes": 0
  },
  {
    "commentText": "“We wrestle not against flesh and blood but against powers and principalities, spiritual wickedness in high places.”",
    "likes": 0
  },
  {
    "commentText": "GOD RULES THIS WORLD. ..NOT WITCHES OR EVIL PEOPLE. .THEY ARE THE CHILDREN OF THE DEVIL AND WILL BE SENT STRAIGHT TO HELL BY OUR LORD ON JUDGEMENT DAY....NO SANE PERSON WOULD BELIEVE THE GARBAGE THAT THEY ARE SPOUTING. ..GOD BLESS HIS CHILDREN AND KEEP  US SAFE FROM ALL HARM FROM EVIL PEOPLE..",
    "likes": 1
  },
  {
    "commentText": "You people are nuts",
    "likes": 0
  },
  {
    "commentText": "Oh. Lord, give me a break! Does their insanity know no bounds. Hexing. Lets all go back to the early Middle Ages.",
    "likes": 0
  },
  {
    "commentText": "Judge kavanaugh is covered in the blood of Jesus Christ, no weapon formed against him shall prosper and anyone that rises against him shall be condem, that is the heritage of the servants of the Lord and judge Kavanaughs righteousness comes from Almighty God ,in Jesus mighty name , Amen",
    "likes": 0
  },
  {
    "commentText": "Wow.",
    "likes": 0
  },
  {
    "commentText": "No no Tucker no. Not for you.",
    "likes": 0
  },
  {
    "commentText": "The guest is so stupid. We are praying for kavaugh so there is nothing the gates of hell can do to him. Jesus is Lord over all !",
    "likes": 0
  },
  {
    "commentText": "Ya progress.",
    "likes": 0
  },
  {
    "commentText": "Kavanaugh has God’s protection. Praying 🙏 for him.",
    "likes": 0
  },
  {
    "commentText": "We thank God for this public announcement....where are prayer warriors of the Lord? Let's come together fast and pray from the 19th to the 20th till 10pm. In the name of Jesus Christ, we will not sit back and let them put curse on this man. God has put Kavanugh on the Supreme Court to Carry out his will.",
    "likes": 0
  },
  {
    "commentText": "stupid tucker doesnt believe in the power of God? true sons of God should go and rebuke the the witches",
    "likes": 0
  },
  {
    "commentText": "Getting more desperate bt the day .\nCan't wait until Mid Terms.",
    "likes": 0
  },
  {
    "commentText": "pack up on chicken feet everyone!!! :)",
    "likes": 0
  },
  {
    "commentText": "I see a red wave ❤️🇺🇸",
    "likes": 0
  },
  {
    "commentText": "Lol why do you guys worship this guy so much? Really he would spit in your face if your ass is on fire😜 witches? Can't you people grow balls for real? Oh wait...",
    "likes": 0
  },
  {
    "commentText": "no weapon forged against you will prevail, and you will refute every tongue that accuses you. Isaiah 54",
    "likes": 0
  },
  {
    "commentText": "i think this is the first time ive seen crazy cathy not fully embrace something from the left",
    "likes": 0
  },
  {
    "commentText": "Where there is light dark runs away. Get the behind me. In Jesus Christ name Amen",
    "likes": 0
  },
  {
    "commentText": "??? WTF ??? IS she actually NOT defending them ??? HAHAHA WOW",
    "likes": 0
  },
  {
    "commentText": "Oh, trust me- they believe and their power is from SATAN!",
    "likes": 0
  },
  {
    "commentText": "Time to burn witches again I guess.",
    "likes": 0
  },
  {
    "commentText": "Im kind of fond of Areu even though she is a liberal. Her and Tucker have a certain dynamic that's entertaining to watch and she is a respectful guest.",
    "likes": 0
  },
  {
    "commentText": "Hold up, did she tone down her crazy liberal wacko character? She used to go all out and make tucker break character.",
    "likes": 1
  },
  {
    "commentText": "Salem becomes more umderstandable ....",
    "likes": 0
  },
  {
    "commentText": "Sorry- Saints and Patriots have already prayed a hedge of protection around Justice Kavanaugh. If people can’t see that this is more than Dem vs Rep( it is GOOD VS EVIL) then I don’t know what to say.....",
    "likes": 0
  },
  {
    "commentText": "Let us all plead the blood of Jesus against satan.",
    "likes": 0
  },
  {
    "commentText": "OMG these women are despicable and a disgrace against humanity my god! This poor man Judge Brett Kavanaugh to go through this F—K hell again! Remember VOTE RED NOVEMBER 6th!",
    "likes": 0
  },
  {
    "commentText": "I love Tucker's bluntness 😂😂😂",
    "likes": 0
  },
  {
    "commentText": "She plays the part of the nut job very well !",
    "likes": 0
  },
  {
    "commentText": "hahahahahahahaha uf, kof kof kof so much crack....",
    "likes": 0
  },
  {
    "commentText": "Democrats love evil. Proof!",
    "likes": 0
  },
  {
    "commentText": "see if he floats when you dunk him...",
    "likes": 0
  },
  {
    "commentText": "If people know what's best for them they themselves better stay away from that mess. That hex will be put on them.",
    "likes": 0
  },
  {
    "commentText": "Oh gods. If I were still a Democrat, I would be so embarrassed by this foolishness.",
    "likes": 0
  },
  {
    "commentText": "Witchcraft cannot be used to bring bad guys to justice because Satan is not a force for good, he is a force for evil.  Period.",
    "likes": 0
  },
  {
    "commentText": "Anyone who thinks this stuff is not real is fooling themselves. Just ask any authentic exorcism priest. If you are in a state of grace and receiving the sacraments and are wearing sacramental you should have the necessary protection. The President, vice President and Judge Kavanaugh need round the clock prayers and masses for their guidance, strength and protection. This is what you get when societies have too much freedom. All of the attacks, public mockery and profanities, crazed unhinged hostile fake news reporting, as well as crazed unhinged irresponsible attacks from political foes advocating violence and these diabolical gatherings intent on causing harm to our leaders should be outlawed. This is what a disordered society looks like, this is what evil run amok in the streets looks like. We need severe penalties and punishment in this nation for these crazed people and groups. I can't understand how it is that some of these lunatic and dangerous politicians after what they have pulled in public can still hold office. Freedom has been so abused in this country to the detriment of civil society. These lunatics are resolute and  on a rampage and so peace will never come to this nation.",
    "likes": 0
  },
  {
    "commentText": "That's  EVIL!!!!",
    "likes": 0
  },
  {
    "commentText": "\"Fox News\" is an oxymoron.",
    "likes": 0
  },
  {
    "commentText": "Omg this is terrible",
    "likes": 0
  },
  {
    "commentText": "The crazy calling Kanaye crazy!",
    "likes": 0
  },
  {
    "commentText": "Trump was right....again....it's a witch hunt.",
    "likes": 0
  },
  {
    "commentText": "The left is truly of the spirit of Satan!  But the blood of Jesus prevails.",
    "likes": 0
  },
  {
    "commentText": "I Pray they all get Locked up",
    "likes": 0
  },
  {
    "commentText": "🤮",
    "likes": 0
  },
  {
    "commentText": "well! so much for \"An it harms none.\"",
    "likes": 0
  },
  {
    "commentText": "Even the witches are cashing in on the media propaganda.",
    "likes": 0
  },
  {
    "commentText": "This woman is so ignorant she's dangerous to herself and others.",
    "likes": 0
  },
  {
    "commentText": "\"The wicked will fall into their own nets while Kavanaugh and his family escape\". 😀 (Psalm 64 & 35 should keep him covered. This will backfire for certain. I think we need to pray for the witches because they will need it. Also a quick \"correction\". No one does anything bad to \"bad people\". Rapists in prison don't deserve to be cursed. They deserve to hear the message of the Gospel so that they can be saved from the darkness that drove them to those crimes. Jesus didn't call the righteous to repentance but the sick. That includes witches. They also need repentance and deliverance of course.",
    "likes": 0
  },
  {
    "commentText": "wow. cathy. so much more beautiful when talking real instead of playing the neo feminist devil advocate.",
    "likes": 0
  },
  {
    "commentText": "People, entreat YeHoVaH GOD in your prayers, tell him about the children of darkness and their actions, also entreat Him during the Oct. 31st, tell him about the activities of the day. Open the doors of heaven. Amen and Shalom.",
    "likes": 0
  },
  {
    "commentText": "lol liberal sherpa (^^)",
    "likes": 0
  },
  {
    "commentText": "Is this lady for real or is she a troll??🤔",
    "likes": 0
  },
  {
    "commentText": "say no to democratic party witchcraft",
    "likes": 0
  },
  {
    "commentText": "It's not a \"5k\" its SATANIC, evil.",
    "likes": 0
  },
  {
    "commentText": "Jesus will protect his own.",
    "likes": 0
  },
  {
    "commentText": "Cathy you're starting to lean right and look embarrassed to be a democrat. Come rejoice with us when the red tsunami hits. The water's warm!",
    "likes": 0
  },
  {
    "commentText": "Her parent's FAILED her!",
    "likes": 0
  },
  {
    "commentText": "Cahy you are riding the broomstick the wrong way, don't worry you won't get pregnant! she could terminate all male life on this planet if you had to live with her!, good Democrat weapon of mass destruction!",
    "likes": 1
  },
  {
    "commentText": "If the Lord is with you,,,,, who can be against you,?\nNot Satan, or demon crats.",
    "likes": 0
  },
  {
    "commentText": "Wtf is a, \" peaceful hex\"!",
    "likes": 0
  },
  {
    "commentText": "The Demon-KKK-Rats party of loonies and evil people.",
    "likes": 0
  },
  {
    "commentText": "Keep it up Liberals.  You will scare your voters away.",
    "likes": 0
  },
  {
    "commentText": "Knew Democrats are Satan worshippers !",
    "likes": 0
  },
  {
    "commentText": "No Worries. God won't let anything happen to Brett Kavanaugh. He is protected as well as our President.",
    "likes": 1
  },
  {
    "commentText": "Lol. Get refunds on college tuition please.",
    "likes": 0
  },
  {
    "commentText": "WTH?  Cathy not sounding so crazy this time?",
    "likes": 0
  },
  {
    "commentText": "I'll get you my pretty, and your little dog too!",
    "likes": 0
  },
  {
    "commentText": "Not a popular theory but witches was the ones behind the Salem witch trials.",
    "likes": 0
  },
  {
    "commentText": "Sign of the times",
    "likes": 0
  },
  {
    "commentText": "You cannot curse what God has blessed",
    "likes": 0
  },
  {
    "commentText": "Vote red hurricane November 6th.\nCancel witches' votes",
    "likes": 0
  },
  {
    "commentText": "Born Again Christians let's keep Cavanaugh and family in prayer and pray against the dark Forces that would come against them amen",
    "likes": 0
  },
  {
    "commentText": "These witches had better be careful.  It has been confirmed by 17 intelligence agencies that a  Russian house of cards is about to land on the Wicked Witch of the East, their leader.",
    "likes": 0
  },
  {
    "commentText": "This dumb 🐩!",
    "likes": 0
  },
  {
    "commentText": "I ran into some of theses witches before.  I told them to turn me into a toad. I am still not a toad.",
    "likes": 0
  },
  {
    "commentText": "God will be His shield .no weapon formed from the enemy against him will prosper in the mighty name of Jesus Christ. The battle is for the Lord . We pray that righteousness will reign in the land.",
    "likes": 0
  },
  {
    "commentText": "No harm to others -- moron. Which demon or spirit are they asking for this curse -- are they that stupid ( yes ) not to know the bad intentions on an innocent will come back to them 3 fold ?  Gee and you only have to pay 10$ to get yourselves involved in crazy town, snowflake experiments with the occult.  Good luck with that!",
    "likes": 0
  },
  {
    "commentText": "Real witchcraft and wizardry is not Harry Potter, or Gandalf the Grey.\nI can see why God hates it.",
    "likes": 0
  },
  {
    "commentText": "They, Satanist are the BAD guys, stupid!",
    "likes": 0
  },
  {
    "commentText": "Im a Sorcerer... Cast your spell and I will throw it back at you...Lol!!!...\nTRUMP 2020!!!...\nSpread the Love....",
    "likes": 0
  },
  {
    "commentText": "Special K goes to the church of the One True God.\nHe has nothing to worry about.\nTrump was right... witch hunt !",
    "likes": 0
  },
  {
    "commentText": "Don’t worry the Asatru worshippers of Tyr have his back. Evil woman never prosper against us. Godhead abhors the perverse that tries to subvert his divine ordained will.",
    "likes": 0
  },
  {
    "commentText": "Holy crap... since when did these two agree?!",
    "likes": 0
  },
  {
    "commentText": "Is this real life.",
    "likes": 0
  },
  {
    "commentText": "Sad & Crazy!",
    "likes": 0
  },
  {
    "commentText": "LMAO...Too funny Tucker.....Trump 2020",
    "likes": 0
  },
  {
    "commentText": "Why give lip service to this ridiculous stuff?",
    "likes": 0
  },
  {
    "commentText": "Scoop them all up and burn them.  It's the only way to deal with witches.",
    "likes": 0
  },
  {
    "commentText": "LOL - silly rabbits - you can't go against the Kwizats Haderach.......sigh......& it's will bounce bak on them......sigh.......",
    "likes": 0
  },
  {
    "commentText": "which witch is which?",
    "likes": 0
  },
  {
    "commentText": "Lady you are a screwball if you think anything to do with the Devil is peaceful you are out of your mind",
    "likes": 0
  },
  {
    "commentText": "Wow, this about covers all the liberal left:\n\n\"There shall not be found among you any one that maketh his son or his daughter to pass through the fire, or that useth divination, or an observer of times, or an enchanter, or a witch. Or a charmer, or a consulter with familiar spirits, or a wizard, or a necromancer. For all that do these things are an abomination unto the Lord: and because of these abominations the Lord thy God doth drive them out from before thee .Thou shalt be perfect with the Lord thy God.\" Deut 18:10-13, KJV",
    "likes": 0
  },
  {
    "commentText": "In common language the word \"hex\" is often used synonymously with the words curse or jinx to refer to an unfriendly spell meant to bring about mischief.",
    "likes": 0
  },
  {
    "commentText": "There are spiritual beings. Jesus Christ, who is God Almighty, is a spiritual bring. But so are the demons, who have rebelled against God's law.\n\nLet us take comfort in the fact that Jesus has all power over these witches and demons.",
    "likes": 0
  },
  {
    "commentText": "Burn them at the stake. Worked back in the day, pretty sure it'd work now.",
    "likes": 0
  },
  {
    "commentText": "Witches of Endor\n\n1Sa 28:3 Now Samuel was dead,  and all Israel had lamented him, and buried him in Ramah, even in his own city. And Saul had put away those that had familiar spirits, and the wizards, out of the land.\n(Samuel the prophet. Jeremiah 15:1. The magnitude of Samuel's mercy is equivalent of Moses. Mercy is kindness. To answer biblical questions and solutions. \nSaul starts very well. 1 Samuel 10:12. Reminds me of the church of Ephesus in Revelation 2.)\n1Sa 28:4 And the Philistines gathered themselves together,  and came and pitched in Shunem: and Saul gathered all Israel together,  and they pitched in Gilboa.\n(Philistine the old hatred towards Christianity. Global vagabond. Tares. The serpent seeds. Copying everything that Christianity has. Two-faced pretending to be religious. Philistine is Mycenaean. Ezekiel 25:15.)\n1Sa 28:5 And when Saul saw the host of the Philistines, he was afraid,  and his heart greatly trembled. \n(Now, this is the downfall of Saul. Saul turned into Baal worship bending over to lords of nations for bribes (donations) to wreck the land of living. 1 John 4:18.)\n1Sa 28:6 And when Saul enquired of the LORD, the LORD answered him not, neither by dreams, nor by Urim, nor by prophets.\n(No real man of God will answer him. Proverbs 28:9. Rejected. Get out of my face. Matthew 7:23.)\n1Sa 28:7 Then said Saul unto his servants, Seek me a woman that hath a familiar spirit, that I may go to her, and enquire of her. And his servants said to him, Behold, there is a woman that hath a familiar spirit at Endor.\n(Witches of Endor. \nFeminist boughs of the oak of Amorite the devil.)\n\nEn-dor is belonging to Manasseh 🇺🇸. Joshua 17:11. \nThe term means eye of age. What's eye? \nIn archaeological sites, O is eye. The sign for the ancient travelers. To point the way or to warn the danger ahead. Matthew 6:22. The light of the body. The law and the prophets. 2 Peter 1:19. \n(Witches of) Endor mentioned in Psalms 83. Our enemies. Perverts reunion. All haters of Christianity. Biblical illiterate never be able to crack open the good book and can't handle the language. Clueless. Stupefied. The generation of weeping and gnashing of teeth. \n\nPsa 83:10 Which perished at Endor: they became as dung for the earth.",
    "likes": 0
  },
  {
    "commentText": "I actually couldn’t stop laughing 😂",
    "likes": 0
  },
  {
    "commentText": "How desperate for a Party for loosing a Election can go ? They are now going to loose again and thank our GOD !",
    "likes": 0
  },
  {
    "commentText": "This is so sick. I can’t believe it is allowed",
    "likes": 0
  },
  {
    "commentText": "If we overcome evil with evil, evil wins.  In this instance, Justice Kavanaugh is not evil but the way they are coming against him is.",
    "likes": 0
  },
  {
    "commentText": "Coven of morons!!",
    "likes": 1
  },
  {
    "commentText": "I'm laughing so hard I think I peed a little!! LOL!!",
    "likes": 0
  },
  {
    "commentText": "The devil will impregnate you you whore and you will have a devil child like me",
    "likes": 0
  },
  {
    "commentText": "They would have burned tham around the Salem witch trials",
    "likes": 0
  },
  {
    "commentText": "What Ever",
    "likes": 0
  },
  {
    "commentText": "This is old news, a bunch of witches were attacking Kavanaugh on national tv.",
    "likes": 0
  },
  {
    "commentText": "Now I will not bash Christianity, but I do notice that a lot of people commenting here are talking or preaching God, Jesus or whatever.  Freedom of religion. Have you heard of it? Gosh dang you guys are a bunch of wankers. I'm disappointed. Besides these self-proclaimed \"witches\" obviously don't represent the rest of the witchcraft, Pagan, nor wiccan communities. Yes, what they are doing is stupid, but the mention of witch hunts has me disgusted, Disappointed and ashamed to live in America amongside cherry picking Christians.\n> \"Christianity is a religion of peace!\" \n>Proceeds to encourage witch hunts and the killing of other HUMAN beings.\n\nFreedom of religion, folks. Please accept it. And accept that these \"witches\" do not represent my community. Thank you and goodnight I hope you sleep well.",
    "likes": 0
  },
  {
    "commentText": "What happen to hex on Trump, is this dark force from star war?",
    "likes": 0
  },
  {
    "commentText": "Who was a brain in half of a heart and a conscience would want to go are you insane taking the country all the way back to the days of Salem where they burn witches at the stake maybe this is Hillary Clinton's birthday party celebration because she's the biggest Witch of all pathetic disgusting demon rats Give It Up Lucifer lovers",
    "likes": 0
  },
  {
    "commentText": "same group to put up hex on SpongeBob",
    "likes": 1
  },
  {
    "commentText": "Somehow, we have entered Bizarro World!",
    "likes": 2
  },
  {
    "commentText": "WTF",
    "likes": 1
  },
  {
    "commentText": "\"Donations go to planned parenthood to continue their ritual human sacrifice.\" Hit every level.",
    "likes": 8
  },
  {
    "commentText": "Hahahahaha. Is this serious??? Wow hah",
    "likes": 0
  },
  {
    "commentText": "Hipsters--witchcraft yes, vaccines no.",
    "likes": 0
  },
  {
    "commentText": "So... if Kavanaugh is not afected, then the left will at last believe he is innocent?",
    "likes": 0
  },
  {
    "commentText": "I believe in witches,  but these **** ain't one.  Witches have power, these be spoiled Barneys",
    "likes": 0
  },
  {
    "commentText": "I wipe my rear with witches. They run and hide in fear over the name of Jesus. They do however have power over the left because they reject Jesus. Good luck with that!",
    "likes": 0
  },
  {
    "commentText": "Lmfao!!!",
    "likes": 0
  },
  {
    "commentText": "If I ever met this chick, I swear I'd slap the s*** out of her... 😏😁\nEven better, a cage match! Half the proceeds can go to the Republican Party... 😉😄",
    "likes": 0
  },
  {
    "commentText": "Proverbs 26:2.  It’s a waste of time for these girls.  Take your broom and ride!!",
    "likes": 0
  },
  {
    "commentText": "0:32\n\nDAY-UMMM!!!",
    "likes": 0
  },
  {
    "commentText": "Is it just me or did Crazy Kathy even look like she thought this was extremely stupid.",
    "likes": 0
  },
  {
    "commentText": "what happen to witch in salem ?",
    "likes": 0
  },
  {
    "commentText": "The Greater Spirits that guard Trump will consume the petty black magic spirits these worshippers of darkness conjure through their vile blood magics. Rich urban women are far removed from Mother Earth and her children, the Great Lady Freya scorns them as wretches.",
    "likes": 0
  },
  {
    "commentText": "I'm LITERALLY at a loss for word!",
    "likes": 0
  },
  {
    "commentText": "Regardless if you support Kavanaugh or not, witch hunting with a bias judgmental ignorance of seeking whether it floats or drowns to prove ones innocence is madness.\nThe Liberals have only further convinced the ordinaries they are indeed the racist fascists they claim they are not.",
    "likes": 0
  },
  {
    "commentText": "These witches (and the left) are crazy, but I will give them credit in the fact that, unlike most pro-abortion people, they at least realize that abortion is a form of human sacrifice.",
    "likes": 0
  },
  {
    "commentText": "I want to go to film! That sounds fun!",
    "likes": 0
  },
  {
    "commentText": "Witches and goblins and demons are against Cavanaugh and Don J Trump I'm trying to find and listen to his megarallies on Fox News how come they don't are them anymore please let me know",
    "likes": 0
  },
  {
    "commentText": ".     Is Crazy Cathy actually talking sense?",
    "likes": 0
  },
  {
    "commentText": "How come witches are ugly social misfits the majority of the time? Go figure. I pray that God Almighty will \"hex\" them.",
    "likes": 0
  },
  {
    "commentText": "She turned me into a newt!",
    "likes": 0
  },
  {
    "commentText": "I hear there will be a special appearance by Ruth Bader Ginsburg.",
    "likes": 0
  },
  {
    "commentText": "So it is it OFFICIAL yet that the Demonrats are the party of SATAN!!?? Why won't anyone in media declare this simple FACT and get it out in the open once and for all?",
    "likes": 0
  },
  {
    "commentText": "Really? ....wtf",
    "likes": 0
  },
  {
    "commentText": "Really Tucker ?",
    "likes": 0
  },
  {
    "commentText": "It says something that people resort to diabolical rituals against Trump and Kavanaugh. It means these two are on the good side.",
    "likes": 0
  },
  {
    "commentText": "Even crazy cathy thinks its bullshit! Wow shes getting redpilled, slowly but surely! 😂",
    "likes": 0
  },
  {
    "commentText": "Kavenaugh turned me into a newt.",
    "likes": 0
  },
  {
    "commentText": "I like when Tucker has this woman on his show. I rarely laugh harder when I listen to her.",
    "likes": 0
  },
  {
    "commentText": "Satan can not cast out Satan!",
    "likes": 0
  },
  {
    "commentText": "Bring back the \"witch trials\"",
    "likes": 0
  },
  {
    "commentText": "The more President Trump says , God , the more evil people expose themselves  in this world start coming out !",
    "likes": 0
  },
  {
    "commentText": "These witches are literal retards.",
    "likes": 0
  },
  {
    "commentText": "hex is to caste a curse, so yes, this is an act of intended harm/violence and should be outlawed",
    "likes": 0
  },
  {
    "commentText": "Like the HEX against Trump ever worked!   Stupid backwards pagan idiots from the very pit of hell..  By the way Hispanics know Santeria is Afro Cuban garbage and relied on by those who are bereft of intelligence who deem it necessary to sacrifice animals to their pagan god.  Jesus is the way the truth and the light \n.  God raises and uses the most flawed and unlikely to accomplish His plans.  I do believe God has in this manner placed Trump in our WH to give us a reprieve from the sinister 8 years of his lack luster anti American predecessor",
    "likes": 0
  },
  {
    "commentText": "eeeyyyy Kathy's back!\n\nDude she is trying to hold back her laughter while saying these things, you can see it in her face rofl!",
    "likes": 0
  },
  {
    "commentText": "I'll put 10 protection spells on Kavanaugh... Bitches!",
    "likes": 0
  },
  {
    "commentText": "Those who understand  Ephesians 6 know that we are in a spiritual war. We are told to pray for the saints on all occasions so we should all lift Brett and his family to the Lord in prayer.",
    "likes": 0
  },
  {
    "commentText": ".      They did the same thing to Trump when he got elected.......it didn't seem to do anything.",
    "likes": 0
  },
  {
    "commentText": "WHY am I not surprised that women of the Left are usually practicing witches?? If I were a man I wouldn't date one! Pray for Kavanaugh in Jesus' name. The same witches also put hexes on Trump but Christians' prayers have stopped it. They are lunatic. Trump is doing very well.",
    "likes": 0
  },
  {
    "commentText": "I think we should re-boot the Salem Witch Hunts.. I think they were onto something",
    "likes": 0
  },
  {
    "commentText": "Sorry to say , it's real ,if it was not they would not have been  burning people at the stake for playing with such methods of witchcraft back many years ago !",
    "likes": 0
  },
  {
    "commentText": "F~~ing~~……~~ Nutjob freaks ~~~ back in the coves freaks !!!",
    "likes": 0
  },
  {
    "commentText": "Shes about to go home and make a voodoo doll of Tucker...😖",
    "likes": 0
  },
  {
    "commentText": "Since no one else has said it, I guess I get to coin the new liberal disease: \"Kavanaugh derangement syndrome\".",
    "likes": 0
  },
  {
    "commentText": "Well OF COURSE witches are liberals.  Ya don't see a bunch of conservative witches and voodoo doll wack jobs!  Hahahahahahahahahahaha",
    "likes": 0
  },
  {
    "commentText": "A real ..Bonafide COURT TRIAL.... is the only way BART BRETT O’KAVANAUGH... accused rapist will EVER  be able to  rightfully clear his  NAME ...with the honest American People ! BART BRETT the boofer... WAS NEVER EXONERATED.....because there was NEVER A REAL TRIAL just the Sham Senate  job interview... LET’S BRING ON A REAL TRIAL...until then the SUPREME COURT HAS VIRTUALLY LOST ITS LEGITIMACY....",
    "likes": 0
  },
  {
    "commentText": "Tucker she's too crazy! I can't watch it",
    "likes": 0
  },
  {
    "commentText": "When it's too crazy even for Krazy Kathy!!! 🤣",
    "likes": 0
  },
  {
    "commentText": "Witchcraft ==> Satanism",
    "likes": 0
  },
  {
    "commentText": "Many people don't realize that Hillary is a member of the Wing coven in NY.",
    "likes": 5
  },
  {
    "commentText": "Ooohhhhh scarey ahahaha",
    "likes": 0
  },
  {
    "commentText": "Cathy is kinda' cute...she can't honestly believe all the BS she says on the show. I think it's all a bit of a skit.",
    "likes": 0
  },
  {
    "commentText": "They're nothing against the High Priestess Melania Trump.",
    "likes": 0
  },
  {
    "commentText": "Lol!!! God has this. Keep praying people and let’s go vote in November!",
    "likes": 0
  },
  {
    "commentText": "Those on the left are dangerous and unhinged",
    "likes": 5
  },
  {
    "commentText": "hey, a lot of us pagans love and voted for Trump and we also serve in the military. we have freedom of religion to practice what we will. Tucker and this chick know nothing about pagan religions or the differences between them and these witches arent real witches so this is a nonesence report. real witches dont announce what they are going to do and we sure as heck charge people for it...so its all vullcrap.",
    "likes": 0
  },
  {
    "commentText": "He must be terrified!!! I mean, look how well it worked against PRESIDENT TRUMP!!!!",
    "likes": 0
  },
  {
    "commentText": "Even she has the look 👀 wtf! And she still defends it lmao dark times man. Dark Times!",
    "likes": 0
  },
  {
    "commentText": "Kavanaugh and Tucker are a disgrace",
    "likes": 0
  },
  {
    "commentText": "Was Cathy a litte less insane in the video, or was it just me?",
    "likes": 0
  },
  {
    "commentText": "Oh no. Thus lady. She's insane. I wish he didn't give her a voice. Let her go to CNN",
    "likes": 0
  },
  {
    "commentText": "Spoopy.",
    "likes": 0
  },
  {
    "commentText": "Peaceful \"hexes\" are similar to the Democrat's \"peaceful\" mobs",
    "likes": 4
  },
  {
    "commentText": "Real witches are in the LEFT: Clittary, Kamala, Maxine, Nancy, Feinstein, Murkowski, Big Mike and McCatskill.",
    "likes": 3
  },
  {
    "commentText": "In the name of Jesus, I take authority over all forms of divination and witchcraft that may come up against This judge in the name of Jesus. I cover tha Kavanaugh familyinthe blood of Jesus.  I command ever y dark force to be bound and release from your assignment. I command you to return from altar from which you came and there you may complete your assignment in Jesus' mighty name.",
    "likes": 0
  },
  {
    "commentText": "Fox, You really pay this idiot Kathy great money to come on Fox news and act like a total airhead freak. Someone at fox needs to be fired for hiring her, seriously",
    "likes": 2
  },
  {
    "commentText": "these people have real mental health issues",
    "likes": 0
  },
  {
    "commentText": "Another proof that leftist democrats are completely unhindered idiots.",
    "likes": 0
  },
  {
    "commentText": "They can ride their broomsticks the hell out of here.",
    "likes": 0
  },
  {
    "commentText": "Ask yourself, does Tucker have actual news or does he incite you with anger for your fellow man day in and day out?",
    "likes": 0
  },
  {
    "commentText": "Kathy is a the epidome of a moron! I have met and hear some of the most stupid ignorant people. It is a toss up between this idiot kathy and or Ocasio... Totalmente esta mujer es una idiota!",
    "likes": 0
  },
  {
    "commentText": "The devil is real, but the only answer is trusting Jesus and Him alone to forgive you for your sins and to take you to Heaven. What has helped me is Thru the Bible with J Vernon McGee   ttb.org  Sunday Sermons are great along with 5 year Bible study.",
    "likes": 0
  },
  {
    "commentText": "Maybe it's just me but it seems that when crazy Kathy is interviewed fox uses a rainbow and unicorn like background.",
    "likes": 0
  },
  {
    "commentText": "A coven of witches.  And leftist degenerates wonder why adult ever takes them seriously.",
    "likes": 0
  },
  {
    "commentText": "the nonsense always gets worse.",
    "likes": 0
  },
  {
    "commentText": "When I saw the title I thought the witches where the women on The View.",
    "likes": 0
  },
  {
    "commentText": "they must like trump not hexing him",
    "likes": 0
  },
  {
    "commentText": "God anointed Trump and he chose kavanaugh! God is protecting him woe to those who come against him in the name of yeshua!",
    "likes": 5
  },
  {
    "commentText": "Hey \"dont knock it\" hex'es is a powerful thing.  Indiana has some spells i know about.  I'm telling you, the know about it.   Dont worry, ( add \"dont worry\"[ to everybody else, all americans] in your hex ladies)  .   A hex can be a good thing, for everybody not bad or people trying to figure stuff out TGB the way i mean it.   have fun, [IMPLUENCE IT] TGB the way i mean it,  implement it.  find love afterwards after going so speak in time .( the levility ) TGB protected the levilty TGB the way i mean it.\nTGB the way i mean it  \n    levesurRRement",
    "likes": 0
  },
  {
    "commentText": "Deuteronomy 23:5 KJV\n[5] Nevertheless the Lord thy God would not hearken unto Balaam; but the Lord thy God turned the curse into a blessing unto thee, because the Lord thy God loved thee.",
    "likes": 0
  },
  {
    "commentText": "Itd be awesome if someone started a fire and locked the doors...would give a great new meaning to modern witch hunt",
    "likes": 0
  },
  {
    "commentText": "I think Cathy Areu is an actor who pretends like a total crazy person.  I dunno, is it just me or she's just a crazy liberal? I mean, nobody can be that crazy, right? I dunno.",
    "likes": 3
  },
  {
    "commentText": "unfortunately, witchcraft is not fake! I know someone who participated in a collective spell on Trump. A couple months later, terrible things happened to this person! Spells do backfire. It only shows that the people who do witchcraft don't really believe in it, but they are wrong...",
    "likes": 3
  },
  {
    "commentText": "Mr Kavanaugh is strong in his faith. And these have no power at all. Too many cockroaches trying to escape the LIGHT. Pathetic",
    "likes": 0
  },
  {
    "commentText": "come on it is Halloween let the kids have there fun",
    "likes": 0
  },
  {
    "commentText": "An attention grab, and you're giving them air time for their ridiculousness",
    "likes": 0
  },
  {
    "commentText": "man I love Crazy Cathy to come on here all the time defending the insanity of the left just to get bashed by both the left and right. Money must be good!",
    "likes": 2
  },
  {
    "commentText": "I GOT 99 PROBLEMS BUT A WITCH AIN'T ONE!!!!",
    "likes": 6
  },
  {
    "commentText": "Been there before when they tried it with Trump. How did that work out for ya witches?",
    "likes": 7
  },
  {
    "commentText": "HEXES are fake, fire and stakes are REAL!",
    "likes": 0
  },
  {
    "commentText": "All the democratic senators and representatives will fall down when these libs cast their hex against rapists.",
    "likes": 0
  },
  {
    "commentText": "Human sacrifice rituals lmao",
    "likes": 1
  },
  {
    "commentText": "He he he... Time to start hunting witches, make Salem witch trials great again!  Lol",
    "likes": 1
  },
  {
    "commentText": "This is just too hilarious. This is crazier than a japanese manga. Hell, it could easily become an anime series just on the premise alone! One Supreme court judge must do battle with the evil forces of the Democrat Witch Party for the fate of the world!",
    "likes": 2
  },
  {
    "commentText": "I mean...really??  LMAO",
    "likes": 0
  },
  {
    "commentText": "I’m in love with Kavanaugh. He’s a role model. He’s a fighter. He doesn’t back down. He’s someone we can all show to our kids",
    "likes": 7
  },
  {
    "commentText": "please fox film this it will be comical",
    "likes": 0
  },
  {
    "commentText": "Cathy Areu, The rocket ship doesn't even land on the planet she's on.",
    "likes": 2
  },
  {
    "commentText": "God has a place for so called liberal witches it is call HELL!!!!!!!!! For anyone who attends it is a unforgivable sin.  You cannot be forgiven for sins like this against GOD.  You already have your ticket punched for hell.",
    "likes": 0
  },
  {
    "commentText": "Is Alyssa Milano going to be there??😂😂😂😂😂",
    "likes": 6
  },
  {
    "commentText": "Tucker continues to make a fool of himself.",
    "likes": 3
  },
  {
    "commentText": "LOVE YOU TUCKER!",
    "likes": 1
  },
  {
    "commentText": "journalism at its finest 🤦🏻‍♀️",
    "likes": 0
  },
  {
    "commentText": "Call the Exorcist",
    "likes": 0
  },
  {
    "commentText": "Lol ! You wanna see a real witch? My  ex wife ! These witches couldn t summon a  decent fart between them all !  And if you believe in this heres some news for the witches, what you put out there comes back ten fold ! You would be sabrinas might want to take that into consideration !",
    "likes": 0
  },
  {
    "commentText": "Mental disorders in progressive phase.",
    "likes": 0
  },
  {
    "commentText": "So people like this believe that Kanye is crazy",
    "likes": 11
  },
  {
    "commentText": "Tucker is woke af!!!",
    "likes": 3
  },
  {
    "commentText": "Well... Us logical people have been calling this whole SHAM a witch hunt for months now... I see the left finally gets it... ... ... sort of..",
    "likes": 2
  },
  {
    "commentText": "Fox News is so dumb haha how is this network even still funded?",
    "likes": 0
  },
  {
    "commentText": "I'm sorry, did we just go back 4,000 years ago to the UK? Hexing? Really??",
    "likes": 1
  },
  {
    "commentText": "Oh these hookah-smoking hippies & their magic spells",
    "likes": 3
  },
  {
    "commentText": "The problem with America is that we have it too good, and many have taken it for granted. The left has to constantly invent problems, so they have something to do with their time spent not-struggling for basic rights.",
    "likes": 7
  },
  {
    "commentText": "Such a waste of hot chick. She should be making supper and babies.",
    "likes": 0
  },
  {
    "commentText": "BABYLON HISTORY! BABYLONIANS PRACTICED MAGIC!",
    "likes": 0
  },
  {
    "commentText": "Weird women...",
    "likes": 0
  },
  {
    "commentText": "Typical Luciferian Socialist bullshit.",
    "likes": 0
  },
  {
    "commentText": "hex me please",
    "likes": 0
  },
  {
    "commentText": "Lol...what freaking weirdos leftists are! This lefty speaker looks like a terrified puppet! Hahahaha!!",
    "likes": 0
  },
  {
    "commentText": "Disgusting...     God doesn’t like witches.  Craziest people....",
    "likes": 1
  },
  {
    "commentText": "Reversal hex",
    "likes": 1
  },
  {
    "commentText": "I blacked out from the cringe in this video..",
    "likes": 1
  },
  {
    "commentText": "They LibFarts just no when to stop ⏰",
    "likes": 0
  },
  {
    "commentText": "Demokkkrats look like witches.",
    "likes": 6
  },
  {
    "commentText": "I'm a Witch for 45 years and not all witches are liberal. A lot of Christian right hex the liberals, but they are too stupid to understand what hexing is. The witches you are hearing about are mostly kids. Screw you Tucker, your christianity has done more murdering in the history of the world than witches. a true witch is a healer and do good things and don't believe in the Christian devil!",
    "likes": 0
  },
  {
    "commentText": "For Kavanaugh and Tucker:\n\nSaint Michael the Archangel, \ndefend us in battle. \nBe our protection against the wickedness \n       and snares of the devil. \n\nMay God rebuke him we humbly pray; \nand do Thou, O Prince of the Heavenly Host, \nby the Power of God, \ncast into hell Satan and all the evil spirits, \nwho prowl through the world \nseeking the ruin of souls.  Amen.",
    "likes": 5
  },
  {
    "commentText": "That ten dollar cover charge does the trick for the curious,voodoo is now part of liberal lunacy.",
    "likes": 3
  },
  {
    "commentText": "This is the most crazy thing I’ve ever heard . They have totally lost their collective mind. And they say Kanye is crazy lol",
    "likes": 6
  },
  {
    "commentText": "I could picture Maxine Waters and Elizabeth Warren around a cauldron.   Only Warren would have feathers on her witch hat!",
    "likes": 10
  },
  {
    "commentText": "there hexing Tucker",
    "likes": 0
  },
  {
    "commentText": "They have no power.  It's a mental health issue only.",
    "likes": 34
  },
  {
    "commentText": "I rebuke them in Jesus name.",
    "likes": 59
  },
  {
    "commentText": "No self respecting Witch would ever think of doing such a thing. I should know as I've been a Pagan for over 10 years. \n The Wiccan Rede /ˈriːd/ is a statement that provides the key moral system in the Neopagan religion of Wicca and certain other related Witchcraft-based faiths. \nA common form of the Rede is An’ ye harm none, do what ye will\nThe word \"Rede\" derives from Middle English, meaning \"advice\" or \"counsel\" and being closely related to the German Rat or Scandinavian råd. \"An\"\n is an archaic Middle English conjunction, meaning \"if.\" \"Ye\" is an archaic or dialectal form of \"you\" (nominative plural).\nOther variants of the Rede include:\nEight words the Wiccan Rede fulfill, An it harm none do what ye will. Note: this is the first published form of the couplet, quoted from Doreen Valiente in 1964. Later published versions include \"ye\" instead of \"it\" (as the second word, following 'An'): \"Eight words the Wiccan Rede fulfill – An 'ye' harm none, do what ye will\" (Earth Religion News, 1974); \"wilt\" rather than \"will\": \"Eight words Wiccan Rede fulfill – An' it harm none, do what ye wilt\" (Green Egg, 1975); \"thou\" instead of \"ye\" or \"you\", or \"as\" in place of \"what\", or any combination, e.g. \"...An' (it/ye/you) harm none, do (as/what) (ye/thou/you) (wilt/will)\":\n    An it harm none, do what thou wilt\n    An it harm none, do as thou wilt\n    That it harm none, do as thou wilt\n    Do what you will, so long as it harms none\nPS: Whatever harm that is cast upon others, will come back to the castor- 3 Fold... so not so good for this Wiccan Coven;}",
    "likes": 13
  },
  {
    "commentText": "Pray for Kavanaugh and his family our country and our POTUS. These witches have no powers against our prayers.",
    "likes": 5
  },
  {
    "commentText": "Wait....I'm confused are us liberals doing the witch hunt....or are we witches getting hunted?????",
    "likes": 3
  },
  {
    "commentText": "My favorite liberal Sherpal. I couldn't ask for a better sherpal to sherpal me around in the Democrat dreamland.",
    "likes": 0
  },
  {
    "commentText": "Im more concerned for Tucker spiritually.  As an Episcopalian,  he has forfeited Divine protection as a heretic and moral relativist.",
    "likes": 1
  },
  {
    "commentText": "wow what's next",
    "likes": 8
  },
  {
    "commentText": "Oh man... here we are. So if witchcraft is real... then its evil... its definitely not a good thing. \"Summoning dark forces\" means they believe in satan. If you believe in satan then you must believe in God right? So they're ok with being on the losing side?! Stupid.",
    "likes": 3
  },
  {
    "commentText": "No weapon formed against us shall prosper.",
    "likes": 6
  },
  {
    "commentText": "Liberal women like Stormy love 'snake oil'.",
    "likes": 26
  },
  {
    "commentText": "Styxhexenhammer666 knows more about Paganism and Wiccanism and knows these clowns are fake practitioners of witchcraft.",
    "likes": 1
  },
  {
    "commentText": "Back?? Are you guys really going to pretend like the elite class everywhere is not heavily into satanism. This is a front to throw us off because this has always been a major part. Jedi are real people ...WAKE UP",
    "likes": 3
  },
  {
    "commentText": "I pray a hedge around Brett and his family so the principalities and powers, evil spirits, cannot touch him. I pray for peace for him and his family, knowing that the God they worship is protecting them through all this. Confuse the evil ones that the evil comes upon them instead.  In Christ Jesus name, Amen!",
    "likes": 71
  },
  {
    "commentText": "Lmao FINALLY found a topic that makes cathy look sane LOL",
    "likes": 2
  },
  {
    "commentText": "Kavanaugh is a devout Catholic and regular receiver of the Holy Eucharist.  He is well protected.",
    "likes": 18
  },
  {
    "commentText": "Witches have NO POWER  over Gods people. None whatsoever.",
    "likes": 165
  },
  {
    "commentText": "Well it didn't work on President Trump, and it won't work on Justice Kavanaugh. Nothing but foolishness from hell bound people.",
    "likes": 82
  },
  {
    "commentText": "The judge sold his soul for this job.  He is a Masonic jesuit and is owned by the satanic Zionists.  Wake up.  He was their man all along and this was all a dog and pony show",
    "likes": 0
  },
  {
    "commentText": "I’m sorry but this must be the most funniest and dumbest things the liberals have come up with yet😂",
    "likes": 3
  },
  {
    "commentText": "If God is real he will be able to beat the works of idiots.",
    "likes": 2
  },
  {
    "commentText": "It seems like even Cathy isn't buying the witch stuff",
    "likes": 1
  },
  {
    "commentText": "That shows you that he’s the right one. It’s down to good and evil now.",
    "likes": 0
  },
  {
    "commentText": "GET HER OFF THE COKE",
    "likes": 24
  },
  {
    "commentText": "🚫Never date a  dem they are crazy",
    "likes": 76
  },
  {
    "commentText": "BURN THEM",
    "likes": 0
  },
  {
    "commentText": "Tucker, dont worry...we have hexes for those witches...really.",
    "likes": 0
  },
  {
    "commentText": "Maybe it's time to bring back witch trials",
    "likes": 21
  },
  {
    "commentText": "Exodus 22:18",
    "likes": 6
  },
  {
    "commentText": "Ok so we just finished the proverbial witch hunt/trial with Russia and Kavanaugh. Time for a real witch hunt.",
    "likes": 18
  },
  {
    "commentText": "the only way dem women feel powerful / spells hexes and snake oil . all your salted circles won't keep you from heLL",
    "likes": 24
  },
  {
    "commentText": "LMAO so now they are on some supernatural thing HAHAHHA",
    "likes": 8
  },
  {
    "commentText": "Hillary supporters.",
    "likes": 28
  },
  {
    "commentText": "Liberals are circling the drain///////lol",
    "likes": 16
  },
  {
    "commentText": "Just can't listen to this woman . She'll say absolutely ANYTHING to get on tv regardless how stupid it is",
    "likes": 16
  },
  {
    "commentText": "witches are fake , ghosts are fake , monsters are fake ( only real monsters are people and some rabid animals and such ) , heck I don't even believe in UFO's .  Not to say other life isn't out there somewhere. It all makes for some good movies though ) And some good novels.",
    "likes": 20
  },
  {
    "commentText": "Replace Kavanaugh for Candace Owens he did it",
    "likes": 1
  },
  {
    "commentText": "😂😂😂 What a bunch of maroons!! 😂😂😂",
    "likes": 19
  },
  {
    "commentText": "Dear God please help us and please protect Justice Kavanaugh.",
    "likes": 0
  },
  {
    "commentText": "Hi Tucker, you rock!",
    "likes": 1
  },
  {
    "commentText": "God is stronger",
    "likes": 84
  },
  {
    "commentText": "No evil will be formed against him.",
    "likes": 22
  },
  {
    "commentText": "Hi Fox News, you're the best news source! You are the only real news!!",
    "likes": 3
  },
  {
    "commentText": "liberals are insane.",
    "likes": 56
  }
]